usr.sbin/rarpd/rarpd.8
.\"	$OpenBSD: rarpd.8,v 1.21 2015/10/28 10:02:59 jmc Exp $
.\"	$NetBSD: rarpd.8,v 1.7 1998/04/15 15:06:06 mrg Exp $
.\"
.\" Copyright (c) 1988-1990 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that: (1) source code distributions
.\" retain the above copyright notice and this paragraph in its entirety, (2)
.\" distributions including binary code include the above copyright notice and
.\" this paragraph in its entirety in the documentation or other materials
.\" provided with the distribution, and (3) all advertising materials mentioning
.\" features or use of this software display the following acknowledgement:
.\" ``This product includes software developed by the University of California,
.\" Lawrence Berkeley Laboratory and its contributors.'' Neither the name of
.\" the University nor the names of its contributors may be used to endorse
.\" or promote products derived from this software without specific prior
.\" written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR IMPLIED
.\" WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\" @(#) $Id: rarpd.8,v 1.21 2015/10/28 10:02:59 jmc Exp $
.\"
.Dd $Mdocdate: October 28 2015 $
.Dt RARPD 8
.Os
.Sh NAME
.Nm rarpd
.Nd reverse ARP daemon
.Sh SYNOPSIS
.Nm rarpd
.Op Fl adflt
.Ar if0 Op Ar ... ifN
.Sh DESCRIPTION
.Nm
services Reverse ARP requests on the Ethernet connected to
the specified interfaces.
Upon receiving a request,
.Nm
maps the target hardware address to an IP address via its name, which
must be present in both the
.Xr ethers 5
and
.Xr hosts 5
databases.
If a host does not exist in both databases, the translation cannot
proceed and a reply will not be sent.
.Pp
In normal operation,
.Nm
forks a copy of itself and runs in the background.
Anomalies and errors are reported via
.Xr syslog 3 .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl a
Listen on all the Ethernets attached to the system.
If
.Fl a
is omitted, a list of interfaces must be specified.
.It Fl d
Run in debug mode, with all the output to stderr.
This option implies the
.Fl f
option.
.It Fl f
Run in the foreground.
.It Fl l
Log all requests to
.Xr syslog 3 .
.It Fl t
Only honour a request if the server
(the host that
.Nm
is running on)
can "boot" the target; that is, if a file or directory called
.Pa /tftpboot/ipaddr
exists, where
.Pa ipaddr
is the target IP address expressed in uppercase hexadecimal
(only the first 8 characters of filenames are checked).
.El
.Sh FILES
.Bl -tag -width /etc/ethers -compact
.It Pa /etc/ethers
Ethernet host name database.
.It Pa /etc/hosts
Host name database.
.\" .It Pa /tftpboot
.El
.Sh SEE ALSO
.Xr bpf 4 ,
.Xr diskless 8
.Sh STANDARDS
.Rs
.%A R. Finlayson
.%A T. Mann
.%A J. Mogul
.%A M. Theimer
.%D June 1984
.%R RFC 903
.%T A Reverse Address Resolution Protocol
.Re
.Sh AUTHORS
.An -nosplit
.An Craig Leres Aq Mt leres@ee.lbl.gov
and
.An Steven McCanne Aq Mt mccanne@ee.lbl.gov ,
Lawrence Berkeley Laboratory, University of California, Berkeley, CA.
