share/man/man7/intro.7
.\"	$OpenBSD: intro.7,v 1.20 2018/09/30 13:24:33 schwarze Exp $
.\"	$NetBSD: intro.7,v 1.3 1994/11/30 19:07:15 jtc Exp $
.\"
.\" Copyright (c) 1983, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)intro.7	8.1 (Berkeley) 6/5/93
.\"
.Dd $Mdocdate: September 30 2018 $
.Dt INTRO 7
.Os
.Sh NAME
.Nm intro
.Nd miscellaneous information pages
.Sh DESCRIPTION
The manual pages in section 7 contain miscellaneous documentation.
.Pp
.Bl -tag -width "mirroring-ports(7)" -compact
.It Xr ascii 7
Map of ASCII character set.
.It Xr environ 7
User environment.
.It Xr eqn 7
Eqn language reference for
.Xr mandoc 1 .
.It Xr glob 7
Shell-style pattern matching.
.It Xr hier 7
File system hierarchy.
.It Xr hostname 7
Hostname resolution rules.
.It Xr library-specs 7
Shared library name specifications.
.It Xr man 7
Man language reference.
.It Xr mandoc_char 7
Mandoc special characters.
.It Xr mdoc 7
Mdoc language reference.
.It Xr mirroring-ports 7
How to build a mirror for ports distfiles.
.It Xr operator 7
C operator precedence.
.It Xr packages 7
Overview of the binary package system.
.It Xr packages-specs 7
Binary package names specifications.
.It Xr pkgpath 7
Ports tree location for a package build.
.It Xr ports 7
Contributed applications.
.It Xr re_format 7
POSIX regular expressions.
.It Xr roff 7
Roff language reference for
.Xr mandoc 1 .
.It Xr script 7
Interpreter script execution.
.It Xr securelevel 7
The securelevel kernel state and its effects.
.It Xr sndio 7
Interface to audio and MIDI.
.It Xr symlink 7
Symbolic link handling.
.It Xr tbl 7
Tbl language reference for
.Xr mandoc 1 .
.It Xr term 7
Conventions for naming terminal types.
.El
.Sh HISTORY
An
.Nm
manual for section 7 appeared in
.Bx 4.2 .
