share/man/man4/man4.macppc/abtn.4
.\" $OpenBSD: abtn.4,v 1.12 2015/01/15 20:37:36 schwarze Exp $
.\"
.\" Copyright (c) 2001 Peter Philipp
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd $Mdocdate: January 15 2015 $
.Dt ABTN 4 macppc
.Os
.Sh NAME
.Nm abtn
.Nd Apple brightness/volume/eject button control
.Sh SYNOPSIS
.Cd "abtn at adb?"
.Sh DESCRIPTION
The
.Nm
driver allows you to dim the brightness of your display,
change the volume of your speakers and eject the disc
inserted into your drive.
This driver only currently recognizes the dim, brightness, volume
and eject buttons.
Numlock is also handled by this driver but it is silently ignored.
.Sh SEE ALSO
.Xr adb 4 ,
.Xr intro 4
.Sh AUTHORS
The
.Nm
driver was written by
.An Tsubai Masanari
for
.Nx .
