share/man/man4/man4.macppc/mpcpcibr.4
.\"     $OpenBSD: mpcpcibr.4,v 1.2 2015/01/15 20:37:36 schwarze Exp $
.\"
.\" Copyright (c) 2008 Xavier Santolaria <xsa@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: January 15 2015 $
.Dt MPCPCIBR 4 macppc
.Os
.Sh NAME
.Nm mpcpcibr
.Nd PCI host bridge
.Sh SYNOPSIS
.Cd "mpcpcibr* at mainbus0"
.Cd "pci* at mpcpcibr?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the PCI host bridge present on PowerPC systems.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 2.2 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Per Fogelstrom .
