share/man/man4/man4.macppc/onyx.4
.\"   $OpenBSD: onyx.4,v 1.8 2013/07/20 19:35:49 martin Exp $
.\"
.\" Copyright (c) 2005 Mark Kettenis
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 20 2013 $
.Dt ONYX 4 macppc
.Os
.Sh NAME
.Nm onyx
.Nd Apple "onyx" audio device
.Sh SYNOPSIS
.Cd "onyx* at macobio?"
.Cd "audio* at onyx?"
.Sh DESCRIPTION
The
.Nm
driver provides support for audio hardware using the PCM3052 chip
found in some macppc machines.
.Sh HARDWARE
Machines supported by the
.Nm
driver include:
.Pp
.Bl -dash -offset indent -compact
.It
PowerBook5,8
.It
PowerBook5,9
.It
PowerBook6,8
.It
PowerMac11,2
.El
.Sh SEE ALSO
.Xr audio 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.9 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org
based on code written by Tsubai Masanari.
.Sh BUGS
The driver emits some nasty pop-noise when playback starts.
.Pp
This manual page needs more precision and detail.
