/*-
 * SPDX-License-Identifier: BSD-2-Clause-FreeBSD
 *
 * Copyright (c) 2011 Alexander Motin <mav@FreeBSD.org>
 * Copyright (c) 2000 - 2008 Søren Schmidt <sos@FreeBSD.org>
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 */

#include <sys/cdefs.h>
__FBSDID("$FreeBSD$");

#include <sys/param.h>
#include <sys/bio.h>
#include <sys/endian.h>
#include <sys/kernel.h>
#include <sys/kobj.h>
#include <sys/limits.h>
#include <sys/lock.h>
#include <sys/malloc.h>
#include <sys/mutex.h>
#include <sys/systm.h>
#include <sys/taskqueue.h>
#include <geom/geom.h>
#include "geom/raid/g_raid.h"
#include "g_raid_md_if.h"

static MALLOC_DEFINE(M_MD_SII, "md_sii_data", "GEOM_RAID SiI metadata");

struct sii_raid_conf {
	uint16_t	ata_params_00_53[54];
	uint64_t	total_sectors;		/* 54 - 57 */
	uint16_t	ata_params_58_81[72];
	uint16_t	product_id;		/* 130 */
	uint16_t	vendor_id;		/* 131 */
	uint16_t	version_minor;		/* 132 */
	uint16_t	version_major;		/* 133 */
	uint8_t		timestamp[6];		/* 134 - 136 */
	uint16_t	strip_sectors;		/* 137 */
	uint16_t	dummy_2;
	uint8_t		disk_number;		/* 139 */
	uint8_t		type;
#define SII_T_RAID0             0x00
#define SII_T_RAID1             0x01
#define SII_T_RAID01            0x02
#define SII_T_SPARE             0x03
#define SII_T_CONCAT            0x04
#define SII_T_RAID5             0x10
#define SII_T_RESERVED          0xfd
#define SII_T_JBOD              0xff

	uint8_t		raid0_disks;		/* 140 */
	uint8_t		raid0_ident;
	uint8_t		raid1_disks;		/* 141 */
	uint8_t		raid1_ident;
	uint64_t	rebuild_lba;		/* 142 - 145 */
	uint32_t	generation;		/* 146 - 147 */
	uint8_t		disk_status;		/* 148 */
#define SII_S_CURRENT           0x01
#define SII_S_REBUILD           0x02
#define SII_S_DROPPED           0x03
#define SII_S_REMOVED           0x04

	uint8_t		raid_status;
#define SII_S_ONLINE            0x01
#define SII_S_AVAILABLE         0x02

	uint8_t		raid_location;		/* 149 */
	uint8_t		disk_location;
	uint8_t		auto_rebuild;		/* 150 */
#define SII_R_REBUILD           0x00
#define SII_R_NOREBUILD         0xff

	uint8_t		dummy_3;
	uint8_t		name[16];		/* 151 - 158 */
	uint16_t	checksum;		/* 159 */
	uint16_t	ata_params_160_255[96];
} __packed;

struct g_raid_md_sii_perdisk {
	struct sii_raid_conf	*pd_meta;
	int			 pd_disk_pos;
	off_t			 pd_disk_size;
};

struct g_raid_md_sii_object {
	struct g_raid_md_object	 mdio_base;
	uint8_t			 mdio_timestamp[6];
	uint8_t			 mdio_location;
	uint32_t		 mdio_generation;
	struct sii_raid_conf	*mdio_meta;
	struct callout		 mdio_start_co;	/* STARTING state timer. */
	int			 mdio_total_disks;
	int			 mdio_disks_present;
	int			 mdio_started;
	int			 mdio_incomplete;
	struct root_hold_token	*mdio_rootmount; /* Root mount delay token. */
};

static g_raid_md_create_t g_raid_md_create_sii;
static g_raid_md_taste_t g_raid_md_taste_sii;
static g_raid_md_event_t g_raid_md_event_sii;
static g_raid_md_ctl_t g_raid_md_ctl_sii;
static g_raid_md_write_t g_raid_md_write_sii;
static g_raid_md_fail_disk_t g_raid_md_fail_disk_sii;
static g_raid_md_free_disk_t g_raid_md_free_disk_sii;
static g_raid_md_free_t g_raid_md_free_sii;

