/*-
*******************************************************************************
Copyright (C) 2015 Annapurna Labs Ltd.

This file may be licensed under the terms of the Annapurna Labs Commercial
License Agreement.

Alternatively, this file can be distributed under the terms of the GNU General
Public License V2 as published by the Free Software Foundation and can be
found at http://www.gnu.org/licenses/gpl-2.0.html

Alternatively, redistribution and use in source and binary forms, with or
without modification, are permitted provided that the following conditions are
met:

    *     Redistributions of source code must retain the above copyright notice,
this list of conditions and the following disclaimer.

    *     Redistributions in binary form must reproduce the above copyright
notice, this list of conditions and the following disclaimer in
the documentation and/or other materials provided with the
distribution.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR
ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*******************************************************************************/

/**
 *  @{
 * @file   al_hal_eth_mac_regs.h
 *
 * @brief Ethernet MAC registers
 *
 */

#ifndef __AL_HAL_ETH_MAC_REGS_H__
#define __AL_HAL_ETH_MAC_REGS_H__

#include "al_hal_plat_types.h"

#ifdef __cplusplus
extern "C" {
#endif
/*
* Unit Registers
*/

struct al_eth_mac_1g_stats {
	uint32_t reserved1[2];
	uint32_t aFramesTransmittedOK;			/* 0x68 */
	uint32_t aFramesReceivedOK;			/* 0x6c */
	uint32_t aFrameCheckSequenceErrors;		/* 0x70 */
	uint32_t aAlignmentErrors;			/* 0x74 */
	uint32_t aOctetsTransmittedOK;			/* 0x78 */
	uint32_t aOctetsReceivedOK;			/* 0x7c */
	uint32_t aPAUSEMACCtrlFramesTransmitted;	/* 0x80 */
	uint32_t aPAUSEMACCtrlFramesReceived;		/* 0x84 */
	uint32_t ifInErrors	;			/* 0x88 */
	uint32_t ifOutErrors;				/* 0x8c */
	uint32_t ifInUcastPkts;				/* 0x90 */
	uint32_t ifInMulticastPkts;			/* 0x94 */
	uint32_t ifInBroadcastPkts;			/* 0x98 */
	uint32_t reserved2;
	uint32_t ifOutUcastPkts;			/* 0xa0 */
	uint32_t ifOutMulticastPkts;			/* 0xa4 */
	uint32_t ifOutBroadcastPkts;			/* 0xa8 */
	uint32_t etherStatsDropEvents;			/* 0xac */
	uint32_t etherStatsOctets;			/* 0xb0 */
	uint32_t etherStatsPkts;			/* 0xb4 */
	uint32_t etherStatsUndersizePkts;		/* 0xb8 */
	uint32_t etherStatsOversizePkts;		/* 0xbc */
	uint32_t etherStatsPkts64Octets;		/* 0xc0 */
	uint32_t etherStatsPkts65to127Octets;		/* 0xc4 */
	uint32_t etherStatsPkts128to255Octets;		/* 0xc8 */
	uint32_t etherStatsPkts256to511Octets;		/* 0xcc */
	uint32_t etherStatsPkts512to1023Octets;		/* 0xd0 */
	uint32_t etherStatsPkts1024to1518Octets;	/* 0xd4 */
	uint32_t etherStatsPkts1519toX;			/* 0xd8 */
	uint32_t etherStatsJabbers;			/* 0xdc */
	uint32_t etherStatsFragments;			/* 0xe0 */
	uint32_t reserved3[71];
};

struct al_eth_mac_1g {
	/* [0x0] */
	uint32_t rev;
	uint32_t scratch;
	uint32_t cmd_cfg;
	uint32_t mac_0;
	/* [0x10] */
	uint32_t mac_1;
	uint32_t frm_len;
	uint32_t pause_quant;
	uint32_t rx_section_empty;
	/* [0x20] */
	uint32_t rx_section_full;
	uint32_t tx_section_empty;
	uint32_t tx_section_full;
	uint32_t rx_almost_empty;
	/* [0x30] */
	uint32_t rx_almost_full;
	uint32_t tx_almost_empty;
	uint32_t tx_almost_full;
	uint32_t mdio_addr0;
	/* [0x40] */
	uint32_t mdio_addr1;
	uint32_t Reserved[5];
	/* [0x58] */
	uint32_t reg_stat;
	uint32_t tx_ipg_len;
	/* [0x60] */
	struct al_eth_mac_1g_stats stats;
	/* [0x200] */
	uint32_t phy_regs_base;
	uint32_t Reserved2[127];
};

struct al_eth_mac_10g_stats_v2 {
	uint32_t aFramesTransmittedOK;			/* 0x80 */
	uint32_t reserved1;
	uint32_t aFramesReceivedOK;			/* 0x88 */
	uint32_t reserved2;
	uint32_t aFrameCheckSequenceErrors;		/* 0x90 */
	uint32_t reserved3;
	uint32_t aAlignmentErrors;			/* 0x98 */
	uint32_t reserved4;
	uint32_t aPAUSEMACCtrlFramesTransmitted;	/* 0xa0 */
	uint32_t reserved5;
	uint32_t aPAUSEMACCtrlFramesReceived;		/* 0xa8 */
	uint32_t reserved6;
	uint32_t aFrameTooLongErrors;			/* 0xb0 */
	uint32_t reserved7;
	uint32_t aInRangeLengthErrors;			/* 0xb8 */
	uint32_t reserved8;
	uint32_t VLANTransmittedOK;			/* 0xc0 */
	uint32_t reserved9;
	uint32_t VLANReceivedOK;			/* 0xc8 */
	uint32_t reserved10;
	uint32_t ifOutOctetsL;				/* 0xd0 */
	uint32_t ifOutOctetsH;				/* 0xd4 */
	uint32_t ifInOctetsL;				/* 0xd8 */
	uint32_t ifInOctetsH;				/* 0xdc */
	uint32_t ifInUcastPkts;				/* 0xe0 */
	uint32_t reserved11;
	uint32_t ifInMulticastPkts;			/* 0xe8 */
	uint32_t reserved12;
	uint32_t ifInBroadcastPkts;			/* 0xf0 */
	uint32_t reserved13;
	uint32_t ifOutErrors;				/* 0xf8 */
	uint32_t reserved14[3];
	uint32_t ifOutUcastPkts;			/* 0x108 */
	uint32_t reserved15;
	uint32_t ifOutMulticastPkts;			/* 0x110 */
	uint32_t reserved16;
	uint32_t ifOutBroadcastPkts;			/* 0x118 */
	uint32_t reserved17;
	uint32_t etherStatsDropEvents;			/* 0x120 */
	uint32_t reserved18;
	uint32_t etherStatsOctets;			/* 0x128 */
	uint32_t reserved19;
	uint32_t etherStatsPkts;			/* 0x130 */
	uint32_t reserved20;
	uint32_t etherStatsUndersizePkts;		/* 0x138 */
	uint32_t reserved21;
	uint32_t etherStatsPkts64Octets;		/* 0x140 */
	uint32_t reserved22;
	uint32_t etherStatsPkts65to127Octets;		/* 0x148 */
	uint32_t reserved23;
	uint32_t etherStatsPkts128to255Octets;		/* 0x150 */
	uint32_t reserved24;
	uint32_t etherStatsPkts256to511Octets;		/* 0x158 */
	uint32_t reserved25;
	uint32_t etherStatsPkts512to1023Octets;		/* 0x160 */
	uint32_t reserved26;
	uint32_t etherStatsPkts1024to1518Octets;	/* 0x168 */
	uint32_t reserved27;
	uint32_t etherStatsPkts1519toX;			/* 0x170 */
	uint32_t reserved28;
	uint32_t etherStatsOversizePkts;		/* 0x178 */
	uint32_t reserved29;
	uint32_t etherStatsJabbers;			/* 0x180 */
	uint32_t reserved30;
	uint32_t etherStatsFragments;			/* 0x188 */
	uint32_t reserved31;
	uint32_t ifInErrors;				/* 0x190 */
	uint32_t reserved32[91];
};

struct al_eth_mac_10g_stats_v3_rx {
	uint32_t etherStatsOctets;			/* 0x00 */
	uint32_t reserved2;
	uint32_t ifOctetsL;				/* 0x08 */
	uint32_t ifOctetsH;				/* 0x0c */
	uint32_t aAlignmentErrors;			/* 0x10 */
	uint32_t reserved4;
	uint32_t aPAUSEMACCtrlFrames;			/* 0x18 */
	uint32_t reserved5;
	uint32_t FramesOK;				/* 0x20 */
	uint32_t reserved6;
	uint32_t CRCErrors;				/* 0x28 */
	uint32_t reserved7;
	uint32_t VLANOK;				/* 0x30 */
	uint32_t reserved8;
	uint32_t ifInErrors;				/* 0x38 */
	uint32_t reserved9;
	uint32_t ifInUcastPkts;				/* 0x40 */
	uint32_t reserved10;
	uint32_t ifInMulticastPkts;			/* 0x48 */
	uint32_t reserved11;
	uint32_t ifInBroadcastPkts;			/* 0x50 */
	uint32_t reserved12;
	uint32_t etherStatsDropEvents;			/* 0x58 */
	uint32_t reserved13;
	uint32_t etherStatsPkts;			/* 0x60 */
	uint32_t reserved14;
	uint32_t etherStatsUndersizePkts;		/* 0x68 */
	uint32_t reserved15;
	uint32_t etherStatsPkts64Octets;		/* 0x70 */
	uint32_t reserved16;
	uint32_t etherStatsPkts65to127Octets;		/* 0x78 */
	uint32_t reserved17;
	uint32_t etherStatsPkts128to255Octets;		/* 0x80 */
	uint32_t reserved18;
	uint32_t etherStatsPkts256to511Octets;		/* 0x88 */
	uint32_t reserved19;
	uint32_t etherStatsPkts512to1023Octets;		/* 0x90 */
	uint32_t reserved20;
	uint32_t etherStatsPkts1024to1518Octets;	/* 0x98 */
	uint32_t reserved21;
	uint32_t etherStatsPkts1519toMax;		/* 0xa0 */
	uint32_t reserved22;
	uint32_t etherStatsOversizePkts;		/* 0xa8 */
	uint32_t reserved23;
	uint32_t etherStatsJabbers;			/* 0xb0 */
	uint32_t reserved24;
	uint32_t etherStatsFragments;			/* 0xb8 */
	uint32_t reserved25;
	uint32_t aMACControlFramesReceived;		/* 0xc0 */
	uint32_t reserved26;
	uint32_t aFrameTooLong;				/* 0xc8 */
	uint32_t reserved27;
	uint32_t aInRangeLengthErrors;			/* 0xd0 */
	uint32_t reserved28;
	uint32_t reserved29[10];
};

struct al_eth_mac_10g_stats_v3_tx {
	uint32_t etherStatsOctets;			/* 0x00 */
	uint32_t reserved30;
	uint32_t ifOctetsL;				/* 0x08 */
	uint32_t ifOctetsH;				/* 0x0c */
	uint32_t aAlignmentErrors;			/* 0x10 */
	uint32_t reserved32;
	uint32_t aPAUSEMACCtrlFrames;			/* 0x18 */
	uint32_t reserved33;
	uint32_t FramesOK;				/* 0x20 */
	uint32_t reserved34;
	uint32_t CRCErrors;				/* 0x28 */
	uint32_t reserved35;
	uint32_t VLANOK;				/* 0x30 */
	uint32_t reserved36;
	uint32_t ifOutErrors;				/* 0x38 */
	uint32_t reserved37;
	uint32_t ifUcastPkts;				/* 0x40 */
	uint32_t reserved38;
	uint32_t ifMulticastPkts;			/* 0x48 */
	uint32_t reserved39;
	uint32_t ifBroadcastPkts;			/* 0x50 */
	uint32_t reserved40;
	uint32_t etherStatsDropEvents;			/* 0x58 */
	uint32_t reserved41;
	uint32_t etherStatsPkts;			/* 0x60 */
	uint32_t reserved42;
	uint32_t etherStatsUndersizePkts;		/* 0x68 */
	uint32_t reserved43;
	uint32_t etherStatsPkts64Octets;		/* 0x70 */
	uint32_t reserved44;
	uint32_t etherStatsPkts65to127Octets;		/* 0x78 */
	uint32_t reserved45;
	uint32_t etherStatsPkts128to255Octets;		/* 0x80 */
	uint32_t reserved46;
	uint32_t etherStatsPkts256to511Octets;		/* 0x88 */
	uint32_t reserved47;
	uint32_t etherStatsPkts512to1023Octets;		/* 0x90 */
	uint32_t reserved48;
	uint32_t etherStatsPkts1024to1518Octets;	/* 0x98 */
	uint32_t reserved49;
	uint32_t etherStatsPkts1519toTX_MTU;		/* 0xa0 */
	uint32_t reserved50;
	uint32_t reserved51[4];
	uint32_t aMACControlFrames;			/* 0xc0 */
	uint32_t reserved52[15];
};

struct al_eth_mac_10g_stats_v3 {
	uint32_t reserved1[32];
	/* 0x100 */
	struct al_eth_mac_10g_stats_v3_rx	rx;
	/* 0x200 */
	struct al_eth_mac_10g_stats_v3_tx	tx;
};

union al_eth_mac_10g_stats {
	struct al_eth_mac_10g_stats_v2	v2;
	struct al_eth_mac_10g_stats_v3	v3;
};

struct al_eth_mac_10g {
	/* [0x0] */
	uint32_t rev;
	uint32_t scratch;
	uint32_t cmd_cfg;
	uint32_t mac_0;
	/* [0x10] */
	uint32_t mac_1;
	uint32_t frm_len;
	uint32_t Reserved;
	uint32_t rx_fifo_sections;
	/* [0x20] */
	uint32_t tx_fifo_sections;
	uint32_t rx_fifo_almost_f_e;
	uint32_t tx_fifo_almost_f_e;
	uint32_t hashtable_load;
	/* [0x30] */
	uint32_t mdio_cfg_status;
	uint16_t mdio_cmd;
	uint16_t reserved1;
	uint16_t mdio_data;
	uint16_t reserved2;
	uint16_t mdio_regaddr;
	uint16_t reserved3;
	/* [0x40] */
	uint32_t status;
	uint32_t tx_ipg_len;
	uint32_t Reserved1[3];
	/* [0x54] */
	uint32_t cl01_pause_quanta;
	uint32_t cl23_pause_quanta;
