<abi-corpus-group architecture='elf-arm-aarch64'>
  <abi-corpus path='vmlinux' architecture='elf-arm-aarch64'>
    <elf-function-symbols>
      <elf-symbol name='__alloc_disk_node' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='__alloc_pages_nodemask' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='__alloc_skb' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='__alloc_workqueue_key' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='__check_object_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='__close_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='__const_udelay' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='__cpuhp_remove_state' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='__cpuhp_setup_state' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

      <elf-symbol name='usb_hcd_link_urb_to_ep' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='usb_hcd_poll_rh_status' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='usb_hcd_resume_root_hub' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='usb_hcd_unlink_urb_from_ep' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='usb_put_dev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='usb_put_hcd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='usb_remove_hcd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='usleep_range' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='vfree' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='vm_get_page_prot' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='vm_insert_mixed' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='vm_insert_pfn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='vm_map_ram' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='vm_unmap_ram' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='vmalloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='vmalloc_to_page' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='vmap' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='vunmap' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='wait_for_completion' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='wait_for_completion_killable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='wait_woken' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='wake_up_process' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='wiphy_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='wiphy_new_nm' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='wiphy_register' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='wiphy_unregister' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='woken_wake_function' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='would_dump' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='ww_mutex_lock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='ww_mutex_lock_interruptible' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='ww_mutex_unlock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='xdp_do_flush_map' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='xdp_do_redirect' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='xdp_return_frame' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='xdp_return_frame_rx_napi' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='xdp_rxq_info_reg' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='xdp_rxq_info_reg_mem_model' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
      <elf-symbol name='xdp_rxq_info_unreg' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    </elf-function-symbols>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/crypto/aes-ce-glue.c' language='LANG_C89'>
      <class-decl name='crypto_type' size-in-bits='576' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-1'/>
      <class-decl name='skcipher_givcrypt_request' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-2'/>
      <class-decl name='trace_event_call' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-3'/>
      <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='infinite' id='type-id-5'>
        <subrange length='infinite' type-id='type-id-6' id='type-id-7'/>

      </array-type-def>
      <class-decl name='crypto_alg' size-in-bits='4096' is-struct='yes' visibility='default' filepath='include/linux/crypto.h' line='461' column='1' id='type-id-8'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='cra_list' type-id='type-id-9' visibility='default' filepath='include/linux/crypto.h' line='462' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='cra_users' type-id='type-id-9' visibility='default' filepath='include/linux/crypto.h' line='463' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='cra_flags' type-id='type-id-10' visibility='default' filepath='include/linux/crypto.h' line='465' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='288'>
          <var-decl name='cra_blocksize' type-id='type-id-11' visibility='default' filepath='include/linux/crypto.h' line='466' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='cra_ctxsize' type-id='type-id-11' visibility='default' filepath='include/linux/crypto.h' line='467' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='352'>
          <var-decl name='cra_alignmask' type-id='type-id-11' visibility='default' filepath='include/linux/crypto.h' line='468' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='cra_priority' type-id='type-id-12' visibility='default' filepath='include/linux/crypto.h' line='470' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='416'>
          <var-decl name='cra_refcnt' type-id='type-id-13' visibility='default' filepath='include/linux/crypto.h' line='471' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='cra_name' type-id='type-id-14' visibility='default' filepath='include/linux/crypto.h' line='473' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='cra_driver_name' type-id='type-id-14' visibility='default' filepath='include/linux/crypto.h' line='474' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2496'>
          <var-decl name='cra_type' type-id='type-id-15' visibility='default' filepath='include/linux/crypto.h' line='476' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2560'>
          <var-decl name='cra_u' type-id='type-id-16' visibility='default' filepath='include/linux/crypto.h' line='483' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3072'>
          <var-decl name='cra_init' type-id='type-id-17' visibility='default' filepath='include/linux/crypto.h' line='485' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3136'>
          <var-decl name='cra_exit' type-id='type-id-18' visibility='default' filepath='include/linux/crypto.h' line='486' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3200'>
          <var-decl name='cra_destroy' type-id='type-id-19' visibility='default' filepath='include/linux/crypto.h' line='487' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3264'>
          <var-decl name='cra_module' type-id='type-id-20' visibility='default' filepath='include/linux/crypto.h' line='489' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='ablkcipher_alg' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/linux/crypto.h' line='265' column='1' id='type-id-21'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='setkey' type-id='type-id-22' visibility='default' filepath='include/linux/crypto.h' line='266' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='encrypt' type-id='type-id-23' visibility='default' filepath='include/linux/crypto.h' line='268' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='decrypt' type-id='type-id-23' visibility='default' filepath='include/linux/crypto.h' line='269' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='givencrypt' type-id='type-id-24' visibility='default' filepath='include/linux/crypto.h' line='270' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='givdecrypt' type-id='type-id-24' visibility='default' filepath='include/linux/crypto.h' line='271' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='geniv' type-id='type-id-25' visibility='default' filepath='include/linux/crypto.h' line='273' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='min_keysize' type-id='type-id-11' visibility='default' filepath='include/linux/crypto.h' line='275' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='416'>
          <var-decl name='max_keysize' type-id='type-id-11' visibility='default' filepath='include/linux/crypto.h' line='276' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='ivsize' type-id='type-id-11' visibility='default' filepath='include/linux/crypto.h' line='277' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='crypto_ablkcipher' size-in-bits='1024' is-struct='yes' visibility='default' filepath='include/linux/crypto.h' line='611' column='1' id='type-id-26'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='base' type-id='type-id-27' visibility='default' filepath='include/linux/crypto.h' line='612' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='crypto_tfm' size-in-bits='1024' is-struct='yes' visibility='default' filepath='include/linux/crypto.h' line='593' column='1' id='type-id-27'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='crt_flags' type-id='type-id-10' visibility='default' filepath='include/linux/crypto.h' line='595' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='crt_u' type-id='type-id-28' visibility='default' filepath='include/linux/crypto.h' line='602' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='exit' type-id='type-id-18' visibility='default' filepath='include/linux/crypto.h' line='604' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='__crt_alg' type-id='type-id-29' visibility='default' filepath='include/linux/crypto.h' line='606' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='__crt_ctx' type-id='type-id-5' visibility='default' filepath='include/linux/crypto.h' line='608' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='ablkcipher_tfm' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/linux/crypto.h' line='550' column='1' id='type-id-30'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='setkey' type-id='type-id-22' visibility='default' filepath='include/linux/crypto.h' line='551' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='encrypt' type-id='type-id-23' visibility='default' filepath='include/linux/crypto.h' line='553' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='decrypt' type-id='type-id-23' visibility='default' filepath='include/linux/crypto.h' line='554' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='base' type-id='type-id-31' visibility='default' filepath='include/linux/crypto.h' line='556' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='ivsize' type-id='type-id-11' visibility='default' filepath='include/linux/crypto.h' line='558' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='288'>
          <var-decl name='reqsize' type-id='type-id-11' visibility='default' filepath='include/linux/crypto.h' line='559' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='ablkcipher_request' size-in-bits='1024' is-struct='yes' visibility='default' filepath='include/linux/crypto.h' line='180' column='1' id='type-id-32'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='base' type-id='type-id-33' visibility='default' filepath='include/linux/crypto.h' line='181' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='nbytes' type-id='type-id-11' visibility='default' filepath='include/linux/crypto.h' line='183' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='info' type-id='type-id-4' visibility='default' filepath='include/linux/crypto.h' line='185' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='src' type-id='type-id-34' visibility='default' filepath='include/linux/crypto.h' line='187' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='dst' type-id='type-id-34' visibility='default' filepath='include/linux/crypto.h' line='188' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='__ctx' type-id='type-id-5' visibility='default' filepath='include/linux/crypto.h' line='190' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='crypto_async_request' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/linux/crypto.h' line='171' column='1' id='type-id-33'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='list' type-id='type-id-9' visibility='default' filepath='include/linux/crypto.h' line='172' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='complete' type-id='type-id-35' visibility='default' filepath='include/linux/crypto.h' line='173' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='data' type-id='type-id-4' visibility='default' filepath='include/linux/crypto.h' line='174' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='tfm' type-id='type-id-36' visibility='default' filepath='include/linux/crypto.h' line='175' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='flags' type-id='type-id-10' visibility='default' filepath='include/linux/crypto.h' line='177' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='crypto_completion_t' type-id='type-id-37' filepath='include/linux/crypto.h' line='162' column='1' id='type-id-35'/>
      <class-decl name='blkcipher_tfm' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/crypto.h' line='562' column='1' id='type-id-38'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='iv' type-id='type-id-4' visibility='default' filepath='include/linux/crypto.h' line='563' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='setkey' type-id='type-id-39' visibility='default' filepath='include/linux/crypto.h' line='564' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='encrypt' type-id='type-id-40' visibility='default' filepath='include/linux/crypto.h' line='566' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='decrypt' type-id='type-id-40' visibility='default' filepath='include/linux/crypto.h' line='568' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='blkcipher_desc' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/crypto.h' line='193' column='1' id='type-id-41'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='tfm' type-id='type-id-42' visibility='default' filepath='include/linux/crypto.h' line='194' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='info' type-id='type-id-4' visibility='default' filepath='include/linux/crypto.h' line='195' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='flags' type-id='type-id-10' visibility='default' filepath='include/linux/crypto.h' line='196' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='crypto_blkcipher' size-in-bits='1024' is-struct='yes' visibility='default' filepath='include/linux/crypto.h' line='615' column='1' id='type-id-43'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='base' type-id='type-id-27' visibility='default' filepath='include/linux/crypto.h' line='616' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='cipher_tfm' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/crypto.h' line='572' column='1' id='type-id-44'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='cit_setkey' type-id='type-id-39' visibility='default' filepath='include/linux/crypto.h' line='573' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='cit_encrypt_one' type-id='type-id-45' visibility='default' filepath='include/linux/crypto.h' line='575' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='cit_decrypt_one' type-id='type-id-45' visibility='default' filepath='include/linux/crypto.h' line='576' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='compress_tfm' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/crypto.h' line='579' column='1' id='type-id-46'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='cot_compress' type-id='type-id-47' visibility='default' filepath='include/linux/crypto.h' line='580' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='cot_decompress' type-id='type-id-47' visibility='default' filepath='include/linux/crypto.h' line='583' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='blkcipher_alg' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/linux/crypto.h' line='292' column='1' id='type-id-48'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='setkey' type-id='type-id-39' visibility='default' filepath='include/linux/crypto.h' line='293' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='encrypt' type-id='type-id-40' visibility='default' filepath='include/linux/crypto.h' line='295' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='decrypt' type-id='type-id-40' visibility='default' filepath='include/linux/crypto.h' line='298' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='geniv' type-id='type-id-25' visibility='default' filepath='include/linux/crypto.h' line='302' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='min_keysize' type-id='type-id-11' visibility='default' filepath='include/linux/crypto.h' line='304' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='288'>
          <var-decl name='max_keysize' type-id='type-id-11' visibility='default' filepath='include/linux/crypto.h' line='305' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='ivsize' type-id='type-id-11' visibility='default' filepath='include/linux/crypto.h' line='306' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='cipher_alg' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/crypto.h' line='356' column='1' id='type-id-49'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='cia_min_keysize' type-id='type-id-11' visibility='default' filepath='include/linux/crypto.h' line='357' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='cia_max_keysize' type-id='type-id-11' visibility='default' filepath='include/linux/crypto.h' line='358' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='cia_setkey' type-id='type-id-39' visibility='default' filepath='include/linux/crypto.h' line='359' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='cia_encrypt' type-id='type-id-45' visibility='default' filepath='include/linux/crypto.h' line='361' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='cia_decrypt' type-id='type-id-45' visibility='default' filepath='include/linux/crypto.h' line='362' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='compress_alg' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/crypto.h' line='365' column='1' id='type-id-50'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='coa_compress' type-id='type-id-47' visibility='default' filepath='include/linux/crypto.h' line='366' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='coa_decompress' type-id='type-id-47' visibility='default' filepath='include/linux/crypto.h' line='368' column='1'/>
        </data-member>
      </class-decl>
      <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-51'/>
      <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-52'/>
      <qualified-type-def type-id='type-id-1' const='yes' id='type-id-53'/>
      <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-15'/>
      <qualified-type-def type-id='type-id-54' const='yes' id='type-id-55'/>
      <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-56'/>
      <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-31'/>
      <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-29'/>
      <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-57'/>
      <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-42'/>
      <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-36'/>
      <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-23'/>
      <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-40'/>
      <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-22'/>
      <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-17'/>
      <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-39'/>
      <pointer-type-def type-id='type-id-63' size-in-bits='64' id='type-id-47'/>
      <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-24'/>
      <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-65'/>
      <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-66'/>
      <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-67'/>
      <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-68'/>
      <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-19'/>
      <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-37'/>
      <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-18'/>
      <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-45'/>
      <function-decl name='crypto_unregister_alg' mangled-name='crypto_unregister_alg' filepath='include/linux/crypto.h' line='535' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='crypto_unregister_alg'>
        <parameter type-id='type-id-29'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='crypto_register_alg' mangled-name='crypto_register_alg' filepath='include/linux/crypto.h' line='534' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='crypto_register_alg'>
        <parameter type-id='type-id-29'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-type size-in-bits='64' id='type-id-58'>
        <parameter type-id='type-id-51'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-59'>
        <parameter type-id='type-id-52'/>
        <parameter type-id='type-id-34'/>
        <parameter type-id='type-id-34'/>
        <parameter type-id='type-id-11'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-60'>
        <parameter type-id='type-id-31'/>
        <parameter type-id='type-id-56'/>
        <parameter type-id='type-id-11'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-61'>
        <parameter type-id='type-id-36'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-62'>
        <parameter type-id='type-id-36'/>
        <parameter type-id='type-id-56'/>
        <parameter type-id='type-id-11'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-63'>
        <parameter type-id='type-id-36'/>
        <parameter type-id='type-id-56'/>
        <parameter type-id='type-id-11'/>
        <parameter type-id='type-id-68'/>
        <parameter type-id='type-id-73'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-64'>
        <parameter type-id='type-id-65'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-69'>
        <parameter type-id='type-id-29'/>
        <return type-id='type-id-74'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-70'>
        <parameter type-id='type-id-57'/>
        <parameter type-id='type-id-12'/>
        <return type-id='type-id-74'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-71'>
        <parameter type-id='type-id-36'/>
        <return type-id='type-id-74'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-72'>
        <parameter type-id='type-id-36'/>
        <parameter type-id='type-id-68'/>
        <parameter type-id='type-id-56'/>
        <return type-id='type-id-74'/>
      </function-type>
      <union-decl name='__anonymous_union__' size-in-bits='512' is-anonymous='yes' visibility='default' filepath='include/linux/crypto.h' line='478' column='1' id='type-id-16'>
        <data-member access='private'>
          <var-decl name='ablkcipher' type-id='type-id-21' visibility='default' filepath='include/linux/crypto.h' line='479' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='blkcipher' type-id='type-id-48' visibility='default' filepath='include/linux/crypto.h' line='480' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='cipher' type-id='type-id-49' visibility='default' filepath='include/linux/crypto.h' line='481' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='compress' type-id='type-id-50' visibility='default' filepath='include/linux/crypto.h' line='482' column='1'/>
        </data-member>
      </union-decl>
      <union-decl name='__anonymous_union__1' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='include/linux/crypto.h' line='597' column='1' id='type-id-28'>
        <data-member access='private'>
          <var-decl name='ablkcipher' type-id='type-id-30' visibility='default' filepath='include/linux/crypto.h' line='598' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='blkcipher' type-id='type-id-38' visibility='default' filepath='include/linux/crypto.h' line='599' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='cipher' type-id='type-id-44' visibility='default' filepath='include/linux/crypto.h' line='600' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='compress' type-id='type-id-46' visibility='default' filepath='include/linux/crypto.h' line='601' column='1'/>
        </data-member>
      </union-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/cpufeature.c' language='LANG_C89'>
      <function-decl name='cpus_read_lock' mangled-name='cpus_read_lock' filepath='include/linux/cpu.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cpus_read_lock'>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='cpus_read_unlock' mangled-name='cpus_read_unlock' filepath='include/linux/cpu.h' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cpus_read_unlock'>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/cpuinfo.c' language='LANG_C89'>
      <function-decl name='kobject_del' mangled-name='kobject_del' filepath='include/linux/kobject.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='kobject_del'>
        <parameter type-id='type-id-75'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/debug-monitors.c' language='LANG_C89'>
      <function-decl name='preempt_schedule' mangled-name='preempt_schedule' filepath='include/asm-generic/preempt.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='preempt_schedule'>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/insn.c' language='LANG_C89'>
      <function-decl name='vmalloc_to_page' mangled-name='vmalloc_to_page' filepath='include/linux/mm.h' line='557' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vmalloc_to_page'>
        <parameter type-id='type-id-4'/>
        <return type-id='type-id-76'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/io.c' language='LANG_C89'>
      <qualified-type-def type-id='type-id-77' const='yes' id='type-id-78'/>
      <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-79'/>
      <qualified-type-def type-id='type-id-74' volatile='yes' id='type-id-77'/>
      <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-80'/>
      <function-decl name='__memcpy_fromio' mangled-name='__memcpy_fromio' filepath='arch/arm64/kernel/io.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__memcpy_fromio'>
        <parameter type-id='type-id-4' name='to' filepath='arch/arm64/kernel/io.c' line='26' column='1'/>
        <parameter type-id='type-id-79' name='from' filepath='arch/arm64/kernel/io.c' line='26' column='1'/>
        <parameter type-id='type-id-81' name='count' filepath='arch/arm64/kernel/io.c' line='26' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='__memcpy_toio' mangled-name='__memcpy_toio' filepath='arch/arm64/kernel/io.c' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__memcpy_toio'>
        <parameter type-id='type-id-80' name='to' filepath='arch/arm64/kernel/io.c' line='54' column='1'/>
        <parameter type-id='type-id-4' name='from' filepath='arch/arm64/kernel/io.c' line='54' column='1'/>
        <parameter type-id='type-id-81' name='count' filepath='arch/arm64/kernel/io.c' line='54' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='__memset_io' mangled-name='__memset_io' filepath='arch/arm64/kernel/io.c' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__memset_io'>
        <parameter type-id='type-id-80' name='dst' filepath='arch/arm64/kernel/io.c' line='82' column='1'/>
        <parameter type-id='type-id-12' name='c' filepath='arch/arm64/kernel/io.c' line='82' column='1'/>
        <parameter type-id='type-id-81' name='count' filepath='arch/arm64/kernel/io.c' line='82' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/irq.c' language='LANG_C89'>
      <class-decl name='dev_pagemap' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-82'/>
      <class-decl name='iov_iter' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-83'/>
      <class-decl name='mem_cgroup' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-84'/>
      <class-decl name='module' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-85'/>
      <class-decl name='user_namespace' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-86'/>
      <class-decl name='__anonymous_struct__' size-in-bits='6848' is-struct='yes' is-anonymous='yes' visibility='default' filepath='include/linux/mm_types.h' line='353' column='1' id='type-id-87'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='mmap' type-id='type-id-88' visibility='default' filepath='include/linux/mm_types.h' line='354' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='mm_rb' type-id='type-id-89' visibility='default' filepath='include/linux/mm_types.h' line='355' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='vmacache_seqnum' type-id='type-id-90' visibility='default' filepath='include/linux/mm_types.h' line='356' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='get_unmapped_area' type-id='type-id-91' visibility='default' filepath='include/linux/mm_types.h' line='358' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='mmap_base' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='362' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='mmap_legacy_base' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='363' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='task_size' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='369' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='highest_vm_end' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='370' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='pgd' type-id='type-id-93' visibility='default' filepath='include/linux/mm_types.h' line='371' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='mm_users' type-id='type-id-94' visibility='default' filepath='include/linux/mm_types.h' line='382' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='608'>
          <var-decl name='mm_count' type-id='type-id-94' visibility='default' filepath='include/linux/mm_types.h' line='391' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='pgtables_bytes' type-id='type-id-95' visibility='default' filepath='include/linux/mm_types.h' line='394' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='map_count' type-id='type-id-12' visibility='default' filepath='include/linux/mm_types.h' line='396' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='736'>
          <var-decl name='page_table_lock' type-id='type-id-96' visibility='default' filepath='include/linux/mm_types.h' line='398' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='mmap_sem' type-id='type-id-97' visibility='default' filepath='include/linux/mm_types.h' line='401' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='mmlist' type-id='type-id-9' visibility='default' filepath='include/linux/mm_types.h' line='403' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='hiwater_rss' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='410' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='hiwater_vm' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='411' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='total_vm' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='413' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='locked_vm' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='414' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='pinned_vm' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='415' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='data_vm' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='416' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='exec_vm' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='417' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='stack_vm' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='418' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1728'>
          <var-decl name='def_flags' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='419' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='arg_lock' type-id='type-id-96' visibility='default' filepath='include/linux/mm_types.h' line='421' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1856'>
          <var-decl name='start_code' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='422' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='end_code' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='422' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='start_data' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='422' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='end_data' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='422' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2112'>
          <var-decl name='start_brk' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='423' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2176'>
          <var-decl name='brk' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='423' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2240'>
          <var-decl name='start_stack' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='423' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='arg_start' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='424' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2368'>
          <var-decl name='arg_end' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='424' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2432'>
          <var-decl name='env_start' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='424' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2496'>
          <var-decl name='env_end' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='424' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2560'>
          <var-decl name='saved_auxv' type-id='type-id-98' visibility='default' filepath='include/linux/mm_types.h' line='426' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5504'>
          <var-decl name='rss_stat' type-id='type-id-99' visibility='default' filepath='include/linux/mm_types.h' line='432' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5760'>
          <var-decl name='binfmt' type-id='type-id-100' visibility='default' filepath='include/linux/mm_types.h' line='434' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5824'>
          <var-decl name='context' type-id='type-id-101' visibility='default' filepath='include/linux/mm_types.h' line='437' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6016'>
          <var-decl name='flags' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='439' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6080'>
          <var-decl name='core_state' type-id='type-id-102' visibility='default' filepath='include/linux/mm_types.h' line='441' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6144'>
          <var-decl name='membarrier_state' type-id='type-id-94' visibility='default' filepath='include/linux/mm_types.h' line='443' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6176'>
          <var-decl name='ioctx_lock' type-id='type-id-96' visibility='default' filepath='include/linux/mm_types.h' line='446' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6208'>
          <var-decl name='ioctx_table' type-id='type-id-103' visibility='default' filepath='include/linux/mm_types.h' line='447' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6272'>
          <var-decl name='owner' type-id='type-id-104' visibility='default' filepath='include/linux/mm_types.h' line='460' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6336'>
          <var-decl name='user_ns' type-id='type-id-105' visibility='default' filepath='include/linux/mm_types.h' line='462' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6400'>
          <var-decl name='exe_file' type-id='type-id-106' visibility='default' filepath='include/linux/mm_types.h' line='465' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6464'>
          <var-decl name='tlb_flush_pending' type-id='type-id-94' visibility='default' filepath='include/linux/mm_types.h' line='491' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6528'>
          <var-decl name='uprobes_state' type-id='type-id-107' visibility='default' filepath='include/linux/mm_types.h' line='496' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6592'>
          <var-decl name='async_put_work' type-id='type-id-108' visibility='default' filepath='include/linux/mm_types.h' line='500' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__3' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='include/linux/mm_types.h' line='79' column='1' id='type-id-109'>
        <member-type access='private'>
          <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' filepath='include/linux/mm_types.h' line='138' column='1' id='type-id-110'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_pt_pad_1' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='139' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='pmd_huge_pte' type-id='type-id-111' visibility='default' filepath='include/linux/mm_types.h' line='140' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='_pt_pad_2' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='141' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <var-decl name='' type-id='type-id-112' visibility='default' filepath='include/linux/mm_types.h' line='142' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='256'>
              <var-decl name='ptl' type-id='type-id-96' visibility='default' filepath='include/linux/mm_types.h' line='149' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='__anonymous_struct__1' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='include/linux/mm_types.h' line='152' column='1' id='type-id-113'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='pgmap' type-id='type-id-114' visibility='default' filepath='include/linux/mm_types.h' line='154' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='hmm_data' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='155' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='_zd_pad_1' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='156' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='private'>
          <var-decl name='' type-id='type-id-115' visibility='default' filepath='include/linux/mm_types.h' line='80' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='callback_head' type-id='type-id-116' visibility='default' filepath='include/linux/mm_types.h' line='160' column='1'/>
        </data-member>
      </union-decl>
      <union-decl name='__anonymous_union__4' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='include/linux/mm_types.h' line='142' column='1' id='type-id-112'>
        <data-member access='private'>
          <var-decl name='pt_mm' type-id='type-id-117' visibility='default' filepath='include/linux/mm_types.h' line='143' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='pt_frag_refcount' type-id='type-id-94' visibility='default' filepath='include/linux/mm_types.h' line='144' column='1'/>
        </data-member>
      </union-decl>
      <qualified-type-def type-id='type-id-118' const='yes' id='type-id-119'/>
      <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-120'/>
      <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-114'/>
      <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-121'/>
      <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-122'/>
      <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-123'/>
      <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-105'/>
      <function-decl name='seq_printf' mangled-name='seq_printf' filepath='include/linux/seq_file.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='seq_printf'>
        <parameter type-id='type-id-124'/>
        <parameter type-id='type-id-25'/>
        <parameter is-variadic='yes'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='cpumask_next' mangled-name='cpumask_next' filepath='include/linux/cpumask.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cpumask_next'>
        <parameter type-id='type-id-12'/>
        <parameter type-id='type-id-120'/>
        <return type-id='type-id-11'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/module.c' language='LANG_C89'>
      <function-decl name='vfree' mangled-name='vfree' filepath='include/linux/vmalloc.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vfree'>
        <parameter type-id='type-id-4'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/psci.c' language='LANG_C89'>
      <function-decl name='usleep_range' mangled-name='usleep_range' filepath='include/linux/delay.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='usleep_range'>
        <parameter type-id='type-id-92'/>
        <parameter type-id='type-id-92'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/ptrace.c' language='LANG_C89'>
      <class-decl name='uts_namespace' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-125'/>
      <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-126'/>
      <function-decl name='send_sig' mangled-name='send_sig' filepath='include/linux/sched/signal.h' line='337' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='send_sig'>
        <parameter type-id='type-id-12'/>
        <parameter type-id='type-id-104'/>
        <parameter type-id='type-id-12'/>
        <return type-id='type-id-12'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/signal.c' language='LANG_C89'>
      <function-decl name='schedule' mangled-name='schedule' filepath='include/linux/sched.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='schedule'>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/traps.c' language='LANG_C89'>
      <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-127'/>
      <function-decl name='_raw_spin_lock_irqsave' mangled-name='_raw_spin_lock_irqsave' filepath='include/linux/spinlock_api_smp.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_raw_spin_lock_irqsave'>
        <parameter type-id='type-id-128'/>
        <return type-id='type-id-92'/>
      </function-decl>
      <function-decl name='_raw_spin_unlock_irqrestore' mangled-name='_raw_spin_unlock_irqrestore' filepath='include/linux/spinlock_api_smp.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_raw_spin_unlock_irqrestore'>
        <parameter type-id='type-id-128'/>
        <parameter type-id='type-id-92'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='down_read' mangled-name='down_read' filepath='include/linux/rwsem.h' line='120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='down_read'>
        <parameter type-id='type-id-127'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='up_read' mangled-name='up_read' filepath='include/linux/rwsem.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='up_read'>
        <parameter type-id='type-id-127'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/vdso.c' language='LANG_C89'>
      <function-decl name='up_write' mangled-name='up_write' filepath='include/linux/rwsem.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='up_write'>
        <parameter type-id='type-id-127'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/lib/atomic_ll_sc.c' language='LANG_C89'>
      <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-130'/>
      <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-131'/>
      <function-decl name='__ll_sc_atomic_add' mangled-name='__ll_sc_atomic_add' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ll_sc_atomic_add'>
        <parameter type-id='type-id-12' name='i' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='113' column='1'/>
        <parameter type-id='type-id-131' name='v' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='113' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='__ll_sc_atomic_add_return' mangled-name='__ll_sc_atomic_add_return' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ll_sc_atomic_add_return'>
        <parameter type-id='type-id-12' name='i' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='113' column='1'/>
        <parameter type-id='type-id-131' name='v' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='113' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='__ll_sc_atomic_sub' mangled-name='__ll_sc_atomic_sub' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ll_sc_atomic_sub'>
        <parameter type-id='type-id-12' name='i' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='114' column='1'/>
        <parameter type-id='type-id-131' name='v' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='114' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='__ll_sc_atomic_sub_return' mangled-name='__ll_sc_atomic_sub_return' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ll_sc_atomic_sub_return'>
        <parameter type-id='type-id-12' name='i' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='114' column='1'/>
        <parameter type-id='type-id-131' name='v' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='114' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='__ll_sc_atomic64_add' mangled-name='__ll_sc_atomic64_add' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ll_sc_atomic64_add'>
        <parameter type-id='type-id-132' name='i' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='207' column='1'/>
        <parameter type-id='type-id-130' name='v' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='207' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='__ll_sc_atomic64_add_return_relaxed' mangled-name='__ll_sc_atomic64_add_return_relaxed' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ll_sc_atomic64_add_return_relaxed'>
        <parameter type-id='type-id-132' name='i' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='207' column='1'/>
        <parameter type-id='type-id-130' name='v' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='207' column='1'/>
        <return type-id='type-id-132'/>
      </function-decl>
      <function-decl name='__ll_sc_atomic64_sub' mangled-name='__ll_sc_atomic64_sub' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='208' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ll_sc_atomic64_sub'>
        <parameter type-id='type-id-132' name='i' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='208' column='1'/>
        <parameter type-id='type-id-130' name='v' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='208' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='__ll_sc_atomic64_andnot' mangled-name='__ll_sc_atomic64_andnot' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ll_sc_atomic64_andnot'>
        <parameter type-id='type-id-132' name='i' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='219' column='1'/>
        <parameter type-id='type-id-130' name='v' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='219' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='__ll_sc_atomic64_or' mangled-name='__ll_sc_atomic64_or' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ll_sc_atomic64_or'>
        <parameter type-id='type-id-132' name='i' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='220' column='1'/>
        <parameter type-id='type-id-130' name='v' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='220' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='__ll_sc___cmpxchg_case_mb_4' mangled-name='__ll_sc___cmpxchg_case_mb_4' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ll_sc___cmpxchg_case_mb_4'>
        <parameter type-id='type-id-80' name='ptr' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='291' column='1'/>
        <parameter type-id='type-id-92' name='old' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='291' column='1'/>
        <parameter type-id='type-id-92' name='new' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='291' column='1'/>
        <return type-id='type-id-92'/>
      </function-decl>
      <function-decl name='__ll_sc___cmpxchg_case_mb_8' mangled-name='__ll_sc___cmpxchg_case_mb_8' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='292' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ll_sc___cmpxchg_case_mb_8'>
        <parameter type-id='type-id-80' name='ptr' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='292' column='1'/>
        <parameter type-id='type-id-92' name='old' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='292' column='1'/>
        <parameter type-id='type-id-92' name='new' filepath='arch/arm64/include/asm/atomic_ll_sc.h' line='292' column='1'/>
        <return type-id='type-id-92'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/lib/delay.c' language='LANG_C89'>
      <function-decl name='__const_udelay' mangled-name='__const_udelay' filepath='arch/arm64/lib/delay.c' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__const_udelay'>
        <parameter type-id='type-id-92' name='xloops' filepath='arch/arm64/lib/delay.c' line='54' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/mm/copypage.c' language='LANG_C89'>
      <function-decl name='copy_page' mangled-name='copy_page' filepath='arch/arm64/include/asm/page.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='copy_page'>
        <parameter type-id='type-id-4'/>
        <parameter type-id='type-id-4'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='clear_page' mangled-name='clear_page' filepath='arch/arm64/include/asm/page.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clear_page'>
        <parameter type-id='type-id-4'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/mm/dma-mapping.c' language='LANG_C89'>
      <union-decl name='__anonymous_union__1' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='include/linux/mm_types.h' line='79' column='1' id='type-id-133'>
        <member-type access='private'>
          <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='include/linux/mm_types.h' line='152' column='1' id='type-id-134'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='pgmap' type-id='type-id-135' visibility='default' filepath='include/linux/mm_types.h' line='154' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='hmm_data' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='155' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='_zd_pad_1' type-id='type-id-92' visibility='default' filepath='include/linux/mm_types.h' line='156' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='private'>
          <var-decl name='' type-id='type-id-115' visibility='default' filepath='include/linux/mm_types.h' line='80' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='callback_head' type-id='type-id-116' visibility='default' filepath='include/linux/mm_types.h' line='160' column='1'/>
        </data-member>
      </union-decl>
      <function-decl name='memparse' mangled-name='memparse' filepath='include/linux/kernel.h' line='506' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memparse'>
        <parameter type-id='type-id-25'/>
        <parameter type-id='type-id-136'/>
        <return type-id='type-id-137'/>
      </function-decl>
      <function-decl name='vunmap' mangled-name='vunmap' filepath='include/linux/vmalloc.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vunmap'>
        <parameter type-id='type-id-4'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='remap_pfn_range' mangled-name='remap_pfn_range' filepath='include/linux/mm.h' line='2549' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='remap_pfn_range'>
        <parameter type-id='type-id-88'/>
        <parameter type-id='type-id-92'/>
        <parameter type-id='type-id-92'/>
        <parameter type-id='type-id-92'/>
        <parameter type-id='type-id-138'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='sg_alloc_table' mangled-name='sg_alloc_table' filepath='include/linux/scatterlist.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sg_alloc_table'>
        <parameter type-id='type-id-139'/>
        <parameter type-id='type-id-11'/>
        <parameter type-id='type-id-11'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='sg_next' mangled-name='sg_next' filepath='include/linux/scatterlist.h' line='256' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sg_next'>
        <parameter type-id='type-id-34'/>
        <return type-id='type-id-34'/>
      </function-decl>
      <function-decl name='sg_alloc_table_from_pages' mangled-name='sg_alloc_table_from_pages' filepath='include/linux/scatterlist.h' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sg_alloc_table_from_pages'>
        <parameter type-id='type-id-139'/>
        <parameter type-id='type-id-140'/>
        <parameter type-id='type-id-11'/>
        <parameter type-id='type-id-11'/>
        <parameter type-id='type-id-92'/>
        <parameter type-id='type-id-11'/>
        <return type-id='type-id-12'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/mm/ioremap.c' language='LANG_C89'>
      <function-decl name='__ioremap' mangled-name='__ioremap' filepath='arch/arm64/mm/ioremap.c' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ioremap'>
        <parameter type-id='type-id-141' name='phys_addr' filepath='arch/arm64/mm/ioremap.c' line='76' column='1'/>
        <parameter type-id='type-id-81' name='size' filepath='arch/arm64/mm/ioremap.c' line='76' column='1'/>
        <parameter type-id='type-id-142' name='prot' filepath='arch/arm64/mm/ioremap.c' line='76' column='1'/>
        <return type-id='type-id-4'/>
      </function-decl>
      <function-decl name='__iounmap' mangled-name='__iounmap' filepath='arch/arm64/mm/ioremap.c' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__iounmap'>
        <parameter type-id='type-id-80' name='io_addr' filepath='arch/arm64/mm/ioremap.c' line='83' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/mm/pgd.c' language='LANG_C89'>
      <function-decl name='free_pages' mangled-name='free_pages' filepath='include/linux/gfp.h' line='567' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free_pages'>
        <parameter type-id='type-id-92'/>
        <parameter type-id='type-id-11'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='block/badblocks.c' language='LANG_C89'>
      <function-decl name='devm_kfree' mangled-name='devm_kfree' filepath='include/linux/device.h' line='711' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='devm_kfree'>
        <parameter type-id='type-id-143'/>
        <parameter type-id='type-id-4'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='block/bio.c' language='LANG_C89'>
      <function-decl name='bio_chain' mangled-name='bio_chain' filepath='block/bio.c' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bio_chain'>
        <parameter type-id='type-id-144' name='bio' filepath='block/bio.c' line='342' column='1'/>
        <parameter type-id='type-id-144' name='parent' filepath='block/bio.c' line='342' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='block/blk-core.c' language='LANG_C89'>
      <typedef-decl name='blk_mq_req_flags_t' type-id='type-id-145' filepath='include/linux/blk_types.h' line='269' column='1' id='type-id-146'/>
      <function-decl name='blk_cleanup_queue' mangled-name='blk_cleanup_queue' filepath='block/blk-core.c' line='757' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_cleanup_queue'>
        <parameter type-id='type-id-147' name='q' filepath='block/blk-core.c' line='757' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='blk_get_request' mangled-name='blk_get_request' filepath='block/blk-core.c' line='1624' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_get_request'>
        <parameter type-id='type-id-147' name='q' filepath='block/blk-core.c' line='1624' column='1'/>
        <parameter type-id='type-id-11' name='op' filepath='block/blk-core.c' line='1624' column='1'/>
        <parameter type-id='type-id-146' name='flags' filepath='block/blk-core.c' line='1625' column='1'/>
        <return type-id='type-id-148'/>
      </function-decl>
      <function-decl name='blk_put_request' mangled-name='blk_put_request' filepath='block/blk-core.c' line='1792' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_put_request'>
        <parameter type-id='type-id-148' name='req' filepath='block/blk-core.c' line='1792' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='block/blk-exec.c' language='LANG_C89'>
      <function-decl name='blk_execute_rq' mangled-name='blk_execute_rq' filepath='block/blk-exec.c' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_execute_rq'>
        <parameter type-id='type-id-147' name='q' filepath='block/blk-exec.c' line='94' column='1'/>
        <parameter type-id='type-id-149' name='bd_disk' filepath='block/blk-exec.c' line='94' column='1'/>
        <parameter type-id='type-id-148' name='rq' filepath='block/blk-exec.c' line='95' column='1'/>
        <parameter type-id='type-id-12' name='at_head' filepath='block/blk-exec.c' line='95' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='block/blk-flush.c' language='LANG_C89'>
      <function-decl name='blk_mq_end_request' mangled-name='blk_mq_end_request' filepath='include/linux/blk-mq.h' line='262' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_mq_end_request'>
        <parameter type-id='type-id-148'/>
        <parameter type-id='type-id-150'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='block/blk-map.c' language='LANG_C89'>
      <function-decl name='blk_rq_map_kern' mangled-name='blk_rq_map_kern' filepath='block/blk-map.c' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_rq_map_kern'>
        <parameter type-id='type-id-147' name='q' filepath='block/blk-map.c' line='215' column='1'/>
        <parameter type-id='type-id-148' name='rq' filepath='block/blk-map.c' line='215' column='1'/>
        <parameter type-id='type-id-4' name='kbuf' filepath='block/blk-map.c' line='215' column='1'/>
        <parameter type-id='type-id-11' name='len' filepath='block/blk-map.c' line='216' column='1'/>
        <parameter type-id='type-id-151' name='gfp_mask' filepath='block/blk-map.c' line='216' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='block/blk-merge.c' language='LANG_C89'>
      <function-decl name='blk_rq_map_sg' mangled-name='blk_rq_map_sg' filepath='block/blk-merge.c' line='431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_rq_map_sg'>
        <parameter type-id='type-id-147' name='q' filepath='block/blk-merge.c' line='431' column='1'/>
        <parameter type-id='type-id-148' name='rq' filepath='block/blk-merge.c' line='431' column='1'/>
        <parameter type-id='type-id-34' name='sglist' filepath='block/blk-merge.c' line='432' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='block/blk-mq-pci.c' language='LANG_C89'>
      <array-type-def dimensions='1' type-id='type-id-152' size-in-bits='704' id='type-id-153'>
        <subrange length='11' type-id='type-id-6' id='type-id-154'/>

      </array-type-def>
      <class-decl name='hotplug_slot' size-in-bits='384' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-155'/>
      <class-decl name='msi_controller' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-156'/>
      <class-decl name='pci_vpd' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-157'/>
      <array-type-def dimensions='1' type-id='type-id-158' size-in-bits='256' id='type-id-159'>
        <subrange length='4' type-id='type-id-6' id='type-id-160'/>

      </array-type-def>
      <array-type-def dimensions='1' type-id='type-id-161' size-in-bits='5632' id='type-id-162'>
        <subrange length='11' type-id='type-id-6' id='type-id-154'/>

      </array-type-def>
      <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='512' id='type-id-163'>
        <subrange length='16' type-id='type-id-6' id='type-id-164'/>

      </array-type-def>
      <class-decl name='pci_dev' size-in-bits='15744' is-struct='yes' visibility='default' filepath='include/linux/pci.h' line='286' column='1' id='type-id-165'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='bus_list' type-id='type-id-9' visibility='default' filepath='include/linux/pci.h' line='287' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='bus' type-id='type-id-166' visibility='default' filepath='include/linux/pci.h' line='288' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='subordinate' type-id='type-id-166' visibility='default' filepath='include/linux/pci.h' line='289' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='sysdata' type-id='type-id-4' visibility='default' filepath='include/linux/pci.h' line='291' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='procent' type-id='type-id-167' visibility='default' filepath='include/linux/pci.h' line='292' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='slot' type-id='type-id-168' visibility='default' filepath='include/linux/pci.h' line='293' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='devfn' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='295' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='480'>
          <var-decl name='vendor' type-id='type-id-169' visibility='default' filepath='include/linux/pci.h' line='296' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='496'>
          <var-decl name='device' type-id='type-id-169' visibility='default' filepath='include/linux/pci.h' line='297' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='subsystem_vendor' type-id='type-id-169' visibility='default' filepath='include/linux/pci.h' line='298' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='528'>
          <var-decl name='subsystem_device' type-id='type-id-169' visibility='default' filepath='include/linux/pci.h' line='299' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='544'>
          <var-decl name='class' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='300' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='revision' type-id='type-id-54' visibility='default' filepath='include/linux/pci.h' line='301' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='584'>
          <var-decl name='hdr_type' type-id='type-id-54' visibility='default' filepath='include/linux/pci.h' line='302' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='592'>
          <var-decl name='pcie_cap' type-id='type-id-54' visibility='default' filepath='include/linux/pci.h' line='307' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='600'>
          <var-decl name='msi_cap' type-id='type-id-54' visibility='default' filepath='include/linux/pci.h' line='308' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='608'>
          <var-decl name='msix_cap' type-id='type-id-54' visibility='default' filepath='include/linux/pci.h' line='309' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5'>
          <var-decl name='pcie_mpss' type-id='type-id-54' visibility='default' filepath='include/linux/pci.h' line='310' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='624'>
          <var-decl name='rom_base_reg' type-id='type-id-54' visibility='default' filepath='include/linux/pci.h' line='311' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='632'>
          <var-decl name='pin' type-id='type-id-54' visibility='default' filepath='include/linux/pci.h' line='312' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='pcie_flags_reg' type-id='type-id-170' visibility='default' filepath='include/linux/pci.h' line='313' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='dma_alias_mask' type-id='type-id-171' visibility='default' filepath='include/linux/pci.h' line='314' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='driver' type-id='type-id-172' visibility='default' filepath='include/linux/pci.h' line='316' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='dma_mask' type-id='type-id-90' visibility='default' filepath='include/linux/pci.h' line='317' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='dma_parms' type-id='type-id-173' visibility='default' filepath='include/linux/pci.h' line='323' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='current_state' type-id='type-id-174' visibility='default' filepath='include/linux/pci.h' line='325' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1056'>
          <var-decl name='pm_cap' type-id='type-id-54' visibility='default' filepath='include/linux/pci.h' line='328' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='19'>
          <var-decl name='pme_support' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='329' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='18'>
          <var-decl name='pme_poll' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='331' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='17'>
          <var-decl name='d1_support' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='332' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='d2_support' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='333' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='15'>
          <var-decl name='no_d1d2' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='334' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='14'>
          <var-decl name='no_d3cold' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='335' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='13'>
          <var-decl name='bridge_d3' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='336' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='12'>
          <var-decl name='d3cold_allowed' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='337' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='11'>
          <var-decl name='mmio_always_on' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='338' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='10'>
          <var-decl name='wakeup_prepared' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='340' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9'>
          <var-decl name='runtime_d3cold' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='341' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8'>
          <var-decl name='ignore_hotplug' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='345' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7'>
          <var-decl name='hotplug_user_indicators' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='346' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6'>
          <var-decl name='clear_retrain_link' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='349' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='d3_delay' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='351' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1120'>
          <var-decl name='d3cold_delay' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='352' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='31'>
          <var-decl name='eetlp_prefix_path' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='359' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1184'>
          <var-decl name='error_state' type-id='type-id-175' visibility='default' filepath='include/linux/pci.h' line='361' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='dev' type-id='type-id-176' visibility='default' filepath='include/linux/pci.h' line='362' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7424'>
          <var-decl name='cfg_size' type-id='type-id-12' visibility='default' filepath='include/linux/pci.h' line='364' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7456'>
          <var-decl name='irq' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='370' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7488'>
          <var-decl name='resource' type-id='type-id-162' visibility='default' filepath='include/linux/pci.h' line='371' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='13120'>
          <var-decl name='match_driver' type-id='type-id-177' visibility='default' filepath='include/linux/pci.h' line='373' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='23'>
          <var-decl name='transparent' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='375' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='22'>
          <var-decl name='multifunction' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='376' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='21'>
          <var-decl name='is_busmaster' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='378' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='20'>
          <var-decl name='no_msi' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='379' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='19'>
          <var-decl name='no_64bit_msi' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='380' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='18'>
          <var-decl name='block_cfg_access' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='381' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='17'>
          <var-decl name='broken_parity_status' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='382' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='15'>
          <var-decl name='irq_reroute_variant' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='383' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='14'>
          <var-decl name='msi_enabled' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='384' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='13'>
          <var-decl name='msix_enabled' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='385' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='12'>
          <var-decl name='ari_enabled' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='386' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='11'>
          <var-decl name='ats_enabled' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='387' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='10'>
          <var-decl name='pasid_enabled' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='388' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9'>
          <var-decl name='pri_enabled' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='389' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8'>
          <var-decl name='is_managed' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='390' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7'>
          <var-decl name='needs_freset' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='391' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6'>
          <var-decl name='state_saved' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='392' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5'>
          <var-decl name='is_physfn' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='393' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4'>
          <var-decl name='is_virtfn' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='394' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3'>
          <var-decl name='reset_fn' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='395' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2'>
          <var-decl name='is_hotplug_bridge' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='396' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1'>
          <var-decl name='shpc_managed' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='397' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='13120'>
          <var-decl name='is_thunderbolt' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='398' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='31'>
          <var-decl name='__aer_firmware_first_valid' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='399' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='30'>
          <var-decl name='__aer_firmware_first' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='400' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='29'>
          <var-decl name='broken_intx_masking' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='401' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='28'>
          <var-decl name='io_window_1k' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='402' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='27'>
          <var-decl name='irq_managed' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='403' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26'>
          <var-decl name='has_secondary_link' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='404' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='25'>
          <var-decl name='non_compliant_bars' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='405' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24'>
          <var-decl name='is_probed' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='406' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='13168'>
          <var-decl name='dev_flags' type-id='type-id-178' visibility='default' filepath='include/linux/pci.h' line='407' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='13184'>
          <var-decl name='enable_cnt' type-id='type-id-94' visibility='default' filepath='include/linux/pci.h' line='408' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='13216'>
          <var-decl name='saved_config_space' type-id='type-id-163' visibility='default' filepath='include/linux/pci.h' line='410' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='13760'>
          <var-decl name='saved_cap_space' type-id='type-id-179' visibility='default' filepath='include/linux/pci.h' line='411' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='13824'>
          <var-decl name='rom_attr' type-id='type-id-152' visibility='default' filepath='include/linux/pci.h' line='412' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='13888'>
          <var-decl name='rom_attr_enabled' type-id='type-id-12' visibility='default' filepath='include/linux/pci.h' line='413' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='13952'>
          <var-decl name='res_attr' type-id='type-id-153' visibility='default' filepath='include/linux/pci.h' line='414' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='14656'>
          <var-decl name='res_attr_wc' type-id='type-id-153' visibility='default' filepath='include/linux/pci.h' line='415' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='15360'>
          <var-decl name='msi_irq_groups' type-id='type-id-180' visibility='default' filepath='include/linux/pci.h' line='426' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='15424'>
          <var-decl name='vpd' type-id='type-id-181' visibility='default' filepath='include/linux/pci.h' line='428' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='15488'>
          <var-decl name='rom' type-id='type-id-141' visibility='default' filepath='include/linux/pci.h' line='444' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='15552'>
          <var-decl name='romlen' type-id='type-id-81' visibility='default' filepath='include/linux/pci.h' line='445' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='15616'>
          <var-decl name='driver_override' type-id='type-id-182' visibility='default' filepath='include/linux/pci.h' line='446' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='15680'>
          <var-decl name='priv_flags' type-id='type-id-92' visibility='default' filepath='include/linux/pci.h' line='448' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='pci_bus' size-in-bits='8768' is-struct='yes' visibility='default' filepath='include/linux/pci.h' line='545' column='1' id='type-id-183'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='node' type-id='type-id-9' visibility='default' filepath='include/linux/pci.h' line='546' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='parent' type-id='type-id-166' visibility='default' filepath='include/linux/pci.h' line='547' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='children' type-id='type-id-9' visibility='default' filepath='include/linux/pci.h' line='548' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='devices' type-id='type-id-9' visibility='default' filepath='include/linux/pci.h' line='549' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='self' type-id='type-id-184' visibility='default' filepath='include/linux/pci.h' line='550' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='slots' type-id='type-id-9' visibility='default' filepath='include/linux/pci.h' line='551' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='resource' type-id='type-id-159' visibility='default' filepath='include/linux/pci.h' line='553' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='resources' type-id='type-id-9' visibility='default' filepath='include/linux/pci.h' line='554' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='busn_res' type-id='type-id-161' visibility='default' filepath='include/linux/pci.h' line='555' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='ops' type-id='type-id-185' visibility='default' filepath='include/linux/pci.h' line='557' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='msi' type-id='type-id-186' visibility='default' filepath='include/linux/pci.h' line='558' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='sysdata' type-id='type-id-4' visibility='default' filepath='include/linux/pci.h' line='559' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1728'>
          <var-decl name='procdir' type-id='type-id-167' visibility='default' filepath='include/linux/pci.h' line='560' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='number' type-id='type-id-150' visibility='default' filepath='include/linux/pci.h' line='562' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1800'>
          <var-decl name='primary' type-id='type-id-150' visibility='default' filepath='include/linux/pci.h' line='563' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1808'>
          <var-decl name='max_bus_speed' type-id='type-id-150' visibility='default' filepath='include/linux/pci.h' line='564' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1816'>
          <var-decl name='cur_bus_speed' type-id='type-id-150' visibility='default' filepath='include/linux/pci.h' line='565' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1824'>
          <var-decl name='domain_nr' type-id='type-id-12' visibility='default' filepath='include/linux/pci.h' line='567' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1856'>
          <var-decl name='name' type-id='type-id-187' visibility='default' filepath='include/linux/pci.h' line='570' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2240'>
          <var-decl name='bridge_ctl' type-id='type-id-169' visibility='default' filepath='include/linux/pci.h' line='572' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2256'>
          <var-decl name='bus_flags' type-id='type-id-188' visibility='default' filepath='include/linux/pci.h' line='573' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='bridge' type-id='type-id-143' visibility='default' filepath='include/linux/pci.h' line='574' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2368'>
          <var-decl name='dev' type-id='type-id-176' visibility='default' filepath='include/linux/pci.h' line='575' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8576'>
          <var-decl name='legacy_io' type-id='type-id-152' visibility='default' filepath='include/linux/pci.h' line='576' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8640'>
          <var-decl name='legacy_mem' type-id='type-id-152' visibility='default' filepath='include/linux/pci.h' line='577' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='31'>
          <var-decl name='is_added' type-id='type-id-11' visibility='default' filepath='include/linux/pci.h' line='578' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='pci_ops' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/linux/pci.h' line='669' column='1' id='type-id-189'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='add_bus' type-id='type-id-190' visibility='default' filepath='include/linux/pci.h' line='670' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='remove_bus' type-id='type-id-191' visibility='default' filepath='include/linux/pci.h' line='671' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='map_bus' type-id='type-id-192' visibility='default' filepath='include/linux/pci.h' line='672' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='read' type-id='type-id-193' visibility='default' filepath='include/linux/pci.h' line='673' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='write' type-id='type-id-194' visibility='default' filepath='include/linux/pci.h' line='674' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='pci_bus_flags_t' type-id='type-id-169' filepath='include/linux/pci.h' line='215' column='1' id='type-id-188'/>
      <class-decl name='pci_slot' size-in-bits='832' is-struct='yes' visibility='default' filepath='include/linux/pci.h' line='56' column='1' id='type-id-195'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='bus' type-id='type-id-166' visibility='default' filepath='include/linux/pci.h' line='57' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='list' type-id='type-id-9' visibility='default' filepath='include/linux/pci.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='hotplug' type-id='type-id-196' visibility='default' filepath='include/linux/pci.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='number' type-id='type-id-150' visibility='default' filepath='include/linux/pci.h' line='60' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='kobj' type-id='type-id-197' visibility='default' filepath='include/linux/pci.h' line='61' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='pci_driver' size-in-bits='2176' is-struct='yes' visibility='default' filepath='include/linux/pci.h' line='754' column='1' id='type-id-198'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='node' type-id='type-id-9' visibility='default' filepath='include/linux/pci.h' line='755' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='name' type-id='type-id-25' visibility='default' filepath='include/linux/pci.h' line='756' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='id_table' type-id='type-id-199' visibility='default' filepath='include/linux/pci.h' line='757' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='probe' type-id='type-id-200' visibility='default' filepath='include/linux/pci.h' line='758' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='remove' type-id='type-id-201' visibility='default' filepath='include/linux/pci.h' line='759' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='suspend' type-id='type-id-202' visibility='default' filepath='include/linux/pci.h' line='760' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='suspend_late' type-id='type-id-202' visibility='default' filepath='include/linux/pci.h' line='761' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='resume_early' type-id='type-id-203' visibility='default' filepath='include/linux/pci.h' line='762' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='resume' type-id='type-id-203' visibility='default' filepath='include/linux/pci.h' line='763' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='shutdown' type-id='type-id-201' visibility='default' filepath='include/linux/pci.h' line='764' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='sriov_configure' type-id='type-id-204' visibility='default' filepath='include/linux/pci.h' line='765' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='err_handler' type-id='type-id-205' visibility='default' filepath='include/linux/pci.h' line='766' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='groups' type-id='type-id-180' visibility='default' filepath='include/linux/pci.h' line='767' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='driver' type-id='type-id-206' visibility='default' filepath='include/linux/pci.h' line='768' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='dynids' type-id='type-id-207' visibility='default' filepath='include/linux/pci.h' line='769' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='pci_device_id' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/mod_devicetable.h' line='19' column='1' id='type-id-208'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='vendor' type-id='type-id-145' visibility='default' filepath='include/linux/mod_devicetable.h' line='20' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='device' type-id='type-id-145' visibility='default' filepath='include/linux/mod_devicetable.h' line='20' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='subvendor' type-id='type-id-145' visibility='default' filepath='include/linux/mod_devicetable.h' line='21' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='subdevice' type-id='type-id-145' visibility='default' filepath='include/linux/mod_devicetable.h' line='21' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='class' type-id='type-id-145' visibility='default' filepath='include/linux/mod_devicetable.h' line='22' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='class_mask' type-id='type-id-145' visibility='default' filepath='include/linux/mod_devicetable.h' line='22' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='driver_data' type-id='type-id-209' visibility='default' filepath='include/linux/mod_devicetable.h' line='23' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='pci_error_handlers' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/linux/pci.h' line='733' column='1' id='type-id-210'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='error_detected' type-id='type-id-211' visibility='default' filepath='include/linux/pci.h' line='735' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='mmio_enabled' type-id='type-id-212' visibility='default' filepath='include/linux/pci.h' line='739' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='slot_reset' type-id='type-id-212' visibility='default' filepath='include/linux/pci.h' line='742' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='reset_prepare' type-id='type-id-201' visibility='default' filepath='include/linux/pci.h' line='745' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='reset_done' type-id='type-id-201' visibility='default' filepath='include/linux/pci.h' line='746' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='resume' type-id='type-id-201' visibility='default' filepath='include/linux/pci.h' line='749' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='pci_ers_result_t' type-id='type-id-11' filepath='include/linux/pci.h' line='710' column='1' id='type-id-213'/>
      <enum-decl name='pci_channel_state' filepath='include/linux/pci.h' line='160' column='1' id='type-id-214'>
        <underlying-type type-id='type-id-215'/>
        <enumerator name='pci_channel_io_normal' value='1'/>
        <enumerator name='pci_channel_io_frozen' value='2'/>
        <enumerator name='pci_channel_io_perm_failure' value='3'/>
      </enum-decl>
      <class-decl name='pci_dynids' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/pci.h' line='697' column='1' id='type-id-207'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='lock' type-id='type-id-96' visibility='default' filepath='include/linux/pci.h' line='698' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='list' type-id='type-id-9' visibility='default' filepath='include/linux/pci.h' line='699' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='pci_power_t' type-id='type-id-12' filepath='include/linux/pci.h' line='130' column='1' id='type-id-174'/>
      <typedef-decl name='pci_channel_state_t' type-id='type-id-11' filepath='include/linux/pci.h' line='158' column='1' id='type-id-175'/>
      <typedef-decl name='pci_dev_flags_t' type-id='type-id-169' filepath='include/linux/pci.h' line='184' column='1' id='type-id-178'/>
      <qualified-type-def type-id='type-id-208' const='yes' id='type-id-216'/>
      <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-199'/>
      <qualified-type-def type-id='type-id-210' const='yes' id='type-id-217'/>
      <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-205'/>
      <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-196'/>
      <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-190'/>
      <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-194'/>
      <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-193'/>
      <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-203'/>
      <pointer-type-def type-id='type-id-222' size-in-bits='64' id='type-id-200'/>
      <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-204'/>
      <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-202'/>
      <pointer-type-def type-id='type-id-156' size-in-bits='64' id='type-id-186'/>
      <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-166'/>
      <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-184'/>
      <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-172'/>
      <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-185'/>
      <pointer-type-def type-id='type-id-195' size-in-bits='64' id='type-id-168'/>
      <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-181'/>
      <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-212'/>
      <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-211'/>
      <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-191'/>
      <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-201'/>
      <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-192'/>
      <function-decl name='pci_irq_get_affinity' mangled-name='pci_irq_get_affinity' filepath='include/linux/pci.h' line='1388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pci_irq_get_affinity'>
        <parameter type-id='type-id-184'/>
        <parameter type-id='type-id-12'/>
        <return type-id='type-id-120'/>
      </function-decl>
      <function-type size-in-bits='64' id='type-id-218'>
        <parameter type-id='type-id-166'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-219'>
        <parameter type-id='type-id-166'/>
        <parameter type-id='type-id-11'/>
        <parameter type-id='type-id-12'/>
        <parameter type-id='type-id-12'/>
        <parameter type-id='type-id-10'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-220'>
        <parameter type-id='type-id-166'/>
        <parameter type-id='type-id-11'/>
        <parameter type-id='type-id-12'/>
        <parameter type-id='type-id-12'/>
        <parameter type-id='type-id-230'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-221'>
        <parameter type-id='type-id-184'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-222'>
        <parameter type-id='type-id-184'/>
        <parameter type-id='type-id-199'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-223'>
        <parameter type-id='type-id-184'/>
        <parameter type-id='type-id-12'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-224'>
        <parameter type-id='type-id-184'/>
        <parameter type-id='type-id-231'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-225'>
        <parameter type-id='type-id-184'/>
        <return type-id='type-id-213'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-226'>
        <parameter type-id='type-id-184'/>
        <parameter type-id='type-id-214'/>
        <return type-id='type-id-213'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-227'>
        <parameter type-id='type-id-166'/>
        <return type-id='type-id-74'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-228'>
        <parameter type-id='type-id-184'/>
        <return type-id='type-id-74'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-229'>
        <parameter type-id='type-id-166'/>
        <parameter type-id='type-id-11'/>
        <parameter type-id='type-id-12'/>
        <return type-id='type-id-4'/>
      </function-type>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='block/blk-mq.c' language='LANG_C89'>
      <function-decl name='blk_mq_map_queues' mangled-name='blk_mq_map_queues' filepath='include/linux/blk-mq.h' line='294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_mq_map_queues'>
        <parameter type-id='type-id-232'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='blk_mq_alloc_tag_set' mangled-name='blk_mq_alloc_tag_set' filepath='block/blk-mq.c' line='2774' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_mq_alloc_tag_set'>
        <parameter type-id='type-id-232' name='set' filepath='block/blk-mq.c' line='2774' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='blk_mq_complete_request' mangled-name='blk_mq_complete_request' filepath='block/blk-mq.c' line='616' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_mq_complete_request'>
        <parameter type-id='type-id-148' name='rq' filepath='block/blk-mq.c' line='616' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='blk_mq_start_request' mangled-name='blk_mq_start_request' filepath='block/blk-mq.c' line='630' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_mq_start_request'>
        <parameter type-id='type-id-148' name='rq' filepath='block/blk-mq.c' line='630' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='blk_mq_stop_hw_queue' mangled-name='blk_mq_stop_hw_queue' filepath='block/blk-mq.c' line='1464' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_mq_stop_hw_queue'>
        <parameter type-id='type-id-233' name='hctx' filepath='block/blk-mq.c' line='1464' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='blk_mq_start_stopped_hw_queues' mangled-name='blk_mq_start_stopped_hw_queues' filepath='block/blk-mq.c' line='1519' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_mq_start_stopped_hw_queues'>
        <parameter type-id='type-id-147' name='q' filepath='block/blk-mq.c' line='1519' column='1'/>
        <parameter type-id='type-id-177' name='async' filepath='block/blk-mq.c' line='1519' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='blk_mq_init_queue' mangled-name='blk_mq_init_queue' filepath='block/blk-mq.c' line='2487' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_mq_init_queue'>
        <parameter type-id='type-id-232' name='set' filepath='block/blk-mq.c' line='2487' column='1'/>
        <return type-id='type-id-147'/>
      </function-decl>
      <function-decl name='blk_mq_free_tag_set' mangled-name='blk_mq_free_tag_set' filepath='block/blk-mq.c' line='2848' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_mq_free_tag_set'>
        <parameter type-id='type-id-232' name='set' filepath='block/blk-mq.c' line='2848' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='block/blk-settings.c' language='LANG_C89'>
      <function-decl name='blk_queue_max_hw_sectors' mangled-name='blk_queue_max_hw_sectors' filepath='block/blk-settings.c' line='237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_queue_max_hw_sectors'>
        <parameter type-id='type-id-147' name='q' filepath='block/blk-settings.c' line='237' column='1'/>
        <parameter type-id='type-id-11' name='max_hw_sectors' filepath='block/blk-settings.c' line='237' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='blk_queue_max_segments' mangled-name='blk_queue_max_segments' filepath='block/blk-settings.c' line='323' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_queue_max_segments'>
        <parameter type-id='type-id-147' name='q' filepath='block/blk-settings.c' line='323' column='1'/>
        <parameter type-id='type-id-169' name='max_segments' filepath='block/blk-settings.c' line='323' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='blk_queue_max_segment_size' mangled-name='blk_queue_max_segment_size' filepath='block/blk-settings.c' line='360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_queue_max_segment_size'>
        <parameter type-id='type-id-147' name='q' filepath='block/blk-settings.c' line='360' column='1'/>
        <parameter type-id='type-id-11' name='max_size' filepath='block/blk-settings.c' line='360' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='blk_queue_logical_block_size' mangled-name='blk_queue_logical_block_size' filepath='block/blk-settings.c' line='382' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_queue_logical_block_size'>
        <parameter type-id='type-id-147' name='q' filepath='block/blk-settings.c' line='382' column='1'/>
        <parameter type-id='type-id-11' name='size' filepath='block/blk-settings.c' line='382' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='blk_queue_physical_block_size' mangled-name='blk_queue_physical_block_size' filepath='block/blk-settings.c' line='404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_queue_physical_block_size'>
        <parameter type-id='type-id-147' name='q' filepath='block/blk-settings.c' line='404' column='1'/>
        <parameter type-id='type-id-11' name='size' filepath='block/blk-settings.c' line='404' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='blk_queue_alignment_offset' mangled-name='blk_queue_alignment_offset' filepath='block/blk-settings.c' line='427' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_queue_alignment_offset'>
        <parameter type-id='type-id-147' name='q' filepath='block/blk-settings.c' line='427' column='1'/>
        <parameter type-id='type-id-11' name='offset' filepath='block/blk-settings.c' line='427' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='blk_queue_io_min' mangled-name='blk_queue_io_min' filepath='block/blk-settings.c' line='472' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_queue_io_min'>
        <parameter type-id='type-id-147' name='q' filepath='block/blk-settings.c' line='472' column='1'/>
        <parameter type-id='type-id-11' name='min' filepath='block/blk-settings.c' line='472' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='blk_queue_io_opt' mangled-name='blk_queue_io_opt' filepath='block/blk-settings.c' line='510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_queue_io_opt'>
        <parameter type-id='type-id-147' name='q' filepath='block/blk-settings.c' line='510' column='1'/>
        <parameter type-id='type-id-11' name='opt' filepath='block/blk-settings.c' line='510' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='blk_queue_write_cache' mangled-name='blk_queue_write_cache' filepath='block/blk-settings.c' line='890' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_queue_write_cache'>
        <parameter type-id='type-id-147' name='q' filepath='block/blk-settings.c' line='890' column='1'/>
        <parameter type-id='type-id-177' name='wc' filepath='block/blk-settings.c' line='890' column='1'/>
        <parameter type-id='type-id-177' name='fua' filepath='block/blk-settings.c' line='890' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='block/elevator.c' language='LANG_C89'>
      <array-type-def dimensions='1' type-id='type-id-234' size-in-bits='256' id='type-id-235'>
        <subrange length='4' type-id='type-id-6' id='type-id-160'/>

      </array-type-def>
      <array-type-def dimensions='1' type-id='type-id-9' size-in-bits='256' id='type-id-236'>
        <subrange length='2' type-id='type-id-6' id='type-id-237'/>

      </array-type-def>
      <array-type-def dimensions='1' type-id='type-id-238' size-in-bits='192' id='type-id-239'>
        <subrange length='3' type-id='type-id-6' id='type-id-240'/>

      </array-type-def>
      <array-type-def dimensions='1' type-id='type-id-241' size-in-bits='2304' id='type-id-242'>
        <subrange length='3' type-id='type-id-6' id='type-id-240'/>

      </array-type-def>
      <array-type-def dimensions='1' type-id='type-id-243' size-in-bits='infinite' id='type-id-244'>
        <subrange length='infinite' type-id='type-id-6' id='type-id-7'/>

      </array-type-def>
      <array-type-def dimensions='1' type-id='type-id-92' size-in-bits='256' id='type-id-245'>
        <subrange length='4' type-id='type-id-6' id='type-id-160'/>

      </array-type-def>
      <array-type-def dimensions='1' type-id='type-id-92' size-in-bits='448' id='type-id-246'>
        <subrange length='7' type-id='type-id-6' id='type-id-247'/>

      </array-type-def>
      <class-decl name='__anonymous_struct__' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='block/blk-mq.h' line='14' column='1' id='type-id-248'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='lock' type-id='type-id-96' visibility='default' filepath='block/blk-mq.h' line='15' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='rq_list' type-id='type-id-9' visibility='default' filepath='block/blk-mq.h' line='16' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='rq_qos_ops' size-in-bits='512' is-struct='yes' visibility='default' filepath='block/blk-rq-qos.h' line='27' column='1' id='type-id-249'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='throttle' type-id='type-id-250' visibility='default' filepath='block/blk-rq-qos.h' line='28' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='track' type-id='type-id-251' visibility='default' filepath='block/blk-rq-qos.h' line='29' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='issue' type-id='type-id-252' visibility='default' filepath='block/blk-rq-qos.h' line='30' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='requeue' type-id='type-id-252' visibility='default' filepath='block/blk-rq-qos.h' line='31' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='done' type-id='type-id-252' visibility='default' filepath='block/blk-rq-qos.h' line='32' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='done_bio' type-id='type-id-253' visibility='default' filepath='block/blk-rq-qos.h' line='33' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='cleanup' type-id='type-id-253' visibility='default' filepath='block/blk-rq-qos.h' line='34' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='exit' type-id='type-id-254' visibility='default' filepath='block/blk-rq-qos.h' line='35' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='rq_qos_id' filepath='block/blk-rq-qos.h' line='10' column='1' id='type-id-255'>
        <underlying-type type-id='type-id-215'/>
        <enumerator name='RQ_QOS_WBT' value='0'/>
        <enumerator name='RQ_QOS_CGROUP' value='1'/>
      </enum-decl>
      <typedef-decl name='queue_rq_fn' type-id='type-id-256' filepath='include/linux/blk-mq.h' line='100' column='1' id='type-id-257'/>
      <class-decl name='blk_mq_hw_ctx' size-in-bits='4608' is-struct='yes' visibility='default' filepath='include/linux/blk-mq.h' line='15' column='1' id='type-id-258'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='' type-id='type-id-259' visibility='default' filepath='include/linux/blk-mq.h' line='16' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='run_work' type-id='type-id-260' visibility='default' filepath='include/linux/blk-mq.h' line='22' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='cpumask' type-id='type-id-261' visibility='default' filepath='include/linux/blk-mq.h' line='23' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='next_cpu' type-id='type-id-12' visibility='default' filepath='include/linux/blk-mq.h' line='24' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1312'>
          <var-decl name='next_cpu_batch' type-id='type-id-12' visibility='default' filepath='include/linux/blk-mq.h' line='25' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='flags' type-id='type-id-92' visibility='default' filepath='include/linux/blk-mq.h' line='27' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='sched_data' type-id='type-id-4' visibility='default' filepath='include/linux/blk-mq.h' line='29' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='queue' type-id='type-id-147' visibility='default' filepath='include/linux/blk-mq.h' line='30' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='fq' type-id='type-id-262' visibility='default' filepath='include/linux/blk-mq.h' line='31' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='driver_data' type-id='type-id-4' visibility='default' filepath='include/linux/blk-mq.h' line='33' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='ctx_map' type-id='type-id-263' visibility='default' filepath='include/linux/blk-mq.h' line='35' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1856'>
          <var-decl name='dispatch_from' type-id='type-id-264' visibility='default' filepath='include/linux/blk-mq.h' line='37' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='dispatch_busy' type-id='type-id-11' visibility='default' filepath='include/linux/blk-mq.h' line='38' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1952'>
          <var-decl name='nr_ctx' type-id='type-id-11' visibility='default' filepath='include/linux/blk-mq.h' line='40' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='ctxs' type-id='type-id-265' visibility='default' filepath='include/linux/blk-mq.h' line='41' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='dispatch_wait_lock' type-id='type-id-96' visibility='default' filepath='include/linux/blk-mq.h' line='43' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2112'>
          <var-decl name='dispatch_wait' type-id='type-id-266' visibility='default' filepath='include/linux/blk-mq.h' line='44' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2432'>
          <var-decl name='wait_index' type-id='type-id-94' visibility='default' filepath='include/linux/blk-mq.h' line='45' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2496'>
          <var-decl name='tags' type-id='type-id-267' visibility='default' filepath='include/linux/blk-mq.h' line='47' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2560'>
          <var-decl name='sched_tags' type-id='type-id-267' visibility='default' filepath='include/linux/blk-mq.h' line='48' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2624'>
          <var-decl name='queued' type-id='type-id-92' visibility='default' filepath='include/linux/blk-mq.h' line='50' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2688'>
          <var-decl name='run' type-id='type-id-92' visibility='default' filepath='include/linux/blk-mq.h' line='51' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2752'>
          <var-decl name='dispatched' type-id='type-id-246' visibility='default' filepath='include/linux/blk-mq.h' line='53' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3200'>
          <var-decl name='numa_node' type-id='type-id-11' visibility='default' filepath='include/linux/blk-mq.h' line='55' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3232'>
          <var-decl name='queue_num' type-id='type-id-11' visibility='default' filepath='include/linux/blk-mq.h' line='56' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3264'>
          <var-decl name='nr_active' type-id='type-id-94' visibility='default' filepath='include/linux/blk-mq.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3296'>
          <var-decl name='nr_expired' type-id='type-id-11' visibility='default' filepath='include/linux/blk-mq.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3328'>
          <var-decl name='cpuhp_dead' type-id='type-id-268' visibility='default' filepath='include/linux/blk-mq.h' line='61' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3456'>
          <var-decl name='kobj' type-id='type-id-197' visibility='default' filepath='include/linux/blk-mq.h' line='62' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3968'>
          <var-decl name='poll_considered' type-id='type-id-92' visibility='default' filepath='include/linux/blk-mq.h' line='64' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4032'>
          <var-decl name='poll_invoked' type-id='type-id-92' visibility='default' filepath='include/linux/blk-mq.h' line='65' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4096'>
          <var-decl name='poll_success' type-id='type-id-92' visibility='default' filepath='include/linux/blk-mq.h' line='66' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4160'>
          <var-decl name='srcu' type-id='type-id-244' visibility='default' filepath='include/linux/blk-mq.h' line='74' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__anonymous_struct__1' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='include/linux/blk-mq.h' line='16' column='1' id='type-id-259'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='lock' type-id='type-id-96' visibility='default' filepath='include/linux/blk-mq.h' line='17' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='dispatch' type-id='type-id-9' visibility='default' filepath='include/linux/blk-mq.h' line='18' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='state' type-id='type-id-92' visibility='default' filepath='include/linux/blk-mq.h' line='19' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='blk_flush_queue' size-in-bits='704' is-struct='yes' visibility='default' filepath='block/blk.h' line='22' column='1' id='type-id-269'>
        <data-member access='public' layout-offset-in-bits='31'>
          <var-decl name='flush_queue_delayed' type-id='type-id-11' visibility='default' filepath='block/blk.h' line='23' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='30'>
          <var-decl name='flush_pending_idx' type-id='type-id-11' visibility='default' filepath='block/blk.h' line='24' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='29'>
          <var-decl name='flush_running_idx' type-id='type-id-11' visibility='default' filepath='block/blk.h' line='25' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8'>
          <var-decl name='rq_status' type-id='type-id-270' visibility='default' filepath='block/blk.h' line='26' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='flush_pending_since' type-id='type-id-92' visibility='default' filepath='block/blk.h' line='27' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='flush_queue' type-id='type-id-236' visibility='default' filepath='block/blk.h' line='28' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='flush_data_in_flight' type-id='type-id-9' visibility='default' filepath='block/blk.h' line='29' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='flush_rq' type-id='type-id-148' visibility='default' filepath='block/blk.h' line='30' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='orig_rq' type-id='type-id-148' visibility='default' filepath='block/blk.h' line='36' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='mq_flush_lock' type-id='type-id-96' visibility='default' filepath='block/blk.h' line='37' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='sbitmap' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/sbitmap.h' line='49' column='1' id='type-id-263'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='depth' type-id='type-id-11' visibility='default' filepath='include/linux/sbitmap.h' line='53' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='shift' type-id='type-id-11' visibility='default' filepath='include/linux/sbitmap.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='map_nr' type-id='type-id-11' visibility='default' filepath='include/linux/sbitmap.h' line='63' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='map' type-id='type-id-271' visibility='default' filepath='include/linux/sbitmap.h' line='68' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='sbitmap_word' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/linux/sbitmap.h' line='31' column='1' id='type-id-272'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='word' type-id='type-id-92' visibility='default' filepath='include/linux/sbitmap.h' line='35' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='depth' type-id='type-id-92' visibility='default' filepath='include/linux/sbitmap.h' line='40' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='wait_queue_entry_t' type-id='type-id-273' filepath='include/linux/wait.h' line='14' column='1' id='type-id-266'/>
      <class-decl name='blk_mq_tags' size-in-bits='1280' is-struct='yes' visibility='default' filepath='block/blk-mq-tag.h' line='10' column='1' id='type-id-274'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='nr_tags' type-id='type-id-11' visibility='default' filepath='block/blk-mq-tag.h' line='11' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='nr_reserved_tags' type-id='type-id-11' visibility='default' filepath='block/blk-mq-tag.h' line='12' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='active_queues' type-id='type-id-94' visibility='default' filepath='block/blk-mq-tag.h' line='14' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='bitmap_tags' type-id='type-id-275' visibility='default' filepath='block/blk-mq-tag.h' line='16' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='breserved_tags' type-id='type-id-275' visibility='default' filepath='block/blk-mq-tag.h' line='17' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='rqs' type-id='type-id-276' visibility='default' filepath='block/blk-mq-tag.h' line='19' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='static_rqs' type-id='type-id-276' visibility='default' filepath='block/blk-mq-tag.h' line='20' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='page_list' type-id='type-id-9' visibility='default' filepath='block/blk-mq-tag.h' line='21' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='sbitmap_queue' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/linux/sbitmap.h' line='98' column='1' id='type-id-275'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='sb' type-id='type-id-263' visibility='default' filepath='include/linux/sbitmap.h' line='102' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='alloc_hint' type-id='type-id-73' visibility='default' filepath='include/linux/sbitmap.h' line='110' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='wake_batch' type-id='type-id-11' visibility='default' filepath='include/linux/sbitmap.h' line='116' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='288'>
          <var-decl name='wake_index' type-id='type-id-94' visibility='default' filepath='include/linux/sbitmap.h' line='121' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='ws' type-id='type-id-277' visibility='default' filepath='include/linux/sbitmap.h' line='126' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='round_robin' type-id='type-id-177' visibility='default' filepath='include/linux/sbitmap.h' line='131' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='416'>
          <var-decl name='min_shallow_depth' type-id='type-id-11' visibility='default' filepath='include/linux/sbitmap.h' line='137' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='sbq_wait_state' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/linux/sbitmap.h' line='77' column='1' id='type-id-278'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='wait_cnt' type-id='type-id-94' visibility='default' filepath='include/linux/sbitmap.h' line='81' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='wait' type-id='type-id-279' visibility='default' filepath='include/linux/sbitmap.h' line='86' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='srcu_struct' size-in-bits='4800' is-struct='yes' visibility='default' filepath='include/linux/srcutree.h' line='76' column='1' id='type-id-243'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='node' type-id='type-id-242' visibility='default' filepath='include/linux/srcutree.h' line='77' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='level' type-id='type-id-239' visibility='default' filepath='include/linux/srcutree.h' line='78' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2496'>
          <var-decl name='srcu_cb_mutex' type-id='type-id-280' visibility='default' filepath='include/linux/srcutree.h' line='80' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2752'>
          <var-decl name='lock' type-id='type-id-96' visibility='default' filepath='include/linux/srcutree.h' line='81' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2816'>
          <var-decl name='srcu_gp_mutex' type-id='type-id-280' visibility='default' filepath='include/linux/srcutree.h' line='82' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3072'>
          <var-decl name='srcu_idx' type-id='type-id-11' visibility='default' filepath='include/linux/srcutree.h' line='83' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3136'>
          <var-decl name='srcu_gp_seq' type-id='type-id-92' visibility='default' filepath='include/linux/srcutree.h' line='84' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3200'>
          <var-decl name='srcu_gp_seq_needed' type-id='type-id-92' visibility='default' filepath='include/linux/srcutree.h' line='85' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3264'>
          <var-decl name='srcu_gp_seq_needed_exp' type-id='type-id-92' visibility='default' filepath='include/linux/srcutree.h' line='86' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3328'>
          <var-decl name='srcu_last_gp_end' type-id='type-id-92' visibility='default' filepath='include/linux/srcutree.h' line='87' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3392'>
          <var-decl name='sda' type-id='type-id-281' visibility='default' filepath='include/linux/srcutree.h' line='88' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3456'>
          <var-decl name='srcu_barrier_seq' type-id='type-id-92' visibility='default' filepath='include/linux/srcutree.h' line='89' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3520'>
          <var-decl name='srcu_barrier_mutex' type-id='type-id-280' visibility='default' filepath='include/linux/srcutree.h' line='90' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3776'>
          <var-decl name='srcu_barrier_completion' type-id='type-id-282' visibility='default' filepath='include/linux/srcutree.h' line='91' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4032'>
          <var-decl name='srcu_barrier_cpu_cnt' type-id='type-id-94' visibility='default' filepath='include/linux/srcutree.h' line='93' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4096'>
          <var-decl name='work' type-id='type-id-260' visibility='default' filepath='include/linux/srcutree.h' line='96' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='srcu_node' size-in-bits='768' is-struct='yes' visibility='default' filepath='include/linux/srcutree.h' line='60' column='1' id='type-id-241'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='lock' type-id='type-id-96' visibility='default' filepath='include/linux/srcutree.h' line='61' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='srcu_have_cbs' type-id='type-id-245' visibility='default' filepath='include/linux/srcutree.h' line='62' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='srcu_data_have_cbs' type-id='type-id-245' visibility='default' filepath='include/linux/srcutree.h' line='65' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='srcu_gp_seq_needed_exp' type-id='type-id-92' visibility='default' filepath='include/linux/srcutree.h' line='67' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='srcu_parent' type-id='type-id-238' visibility='default' filepath='include/linux/srcutree.h' line='68' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='grplo' type-id='type-id-12' visibility='default' filepath='include/linux/srcutree.h' line='69' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='736'>
          <var-decl name='grphi' type-id='type-id-12' visibility='default' filepath='include/linux/srcutree.h' line='70' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='srcu_data' size-in-bits='2560' is-struct='yes' visibility='default' filepath='include/linux/srcutree.h' line='37' column='1' id='type-id-283'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='srcu_lock_count' type-id='type-id-284' visibility='default' filepath='include/linux/srcutree.h' line='39' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='srcu_unlock_count' type-id='type-id-284' visibility='default' filepath='include/linux/srcutree.h' line='40' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='lock' type-id='type-id-96' visibility='default' filepath='include/linux/srcutree.h' line='43' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='srcu_cblist' type-id='type-id-285' visibility='default' filepath='include/linux/srcutree.h' line='44' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='srcu_gp_seq_needed' type-id='type-id-92' visibility='default' filepath='include/linux/srcutree.h' line='45' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='srcu_gp_seq_needed_exp' type-id='type-id-92' visibility='default' filepath='include/linux/srcutree.h' line='46' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='srcu_cblist_invoking' type-id='type-id-177' visibility='default' filepath='include/linux/srcutree.h' line='47' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='work' type-id='type-id-260' visibility='default' filepath='include/linux/srcutree.h' line='48' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2176'>
          <var-decl name='srcu_barrier_head' type-id='type-id-116' visibility='default' filepath='include/linux/srcutree.h' line='49' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='mynode' type-id='type-id-238' visibility='default' filepath='include/linux/srcutree.h' line='50' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2368'>
          <var-decl name='grpmask' type-id='type-id-92' visibility='default' filepath='include/linux/srcutree.h' line='51' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2432'>
          <var-decl name='cpu' type-id='type-id-12' visibility='default' filepath='include/linux/srcutree.h' line='53' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2496'>
          <var-decl name='sp' type-id='type-id-286' visibility='default' filepath='include/linux/srcutree.h' line='54' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='rcu_segcblist' size-in-bits='704' is-struct='yes' visibility='default' filepath='include/linux/rcu_segcblist.h' line='77' column='1' id='type-id-285'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='head' type-id='type-id-287' visibility='default' filepath='include/linux/rcu_segcblist.h' line='78' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='tails' type-id='type-id-235' visibility='default' filepath='include/linux/rcu_segcblist.h' line='79' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='gp_seq' type-id='type-id-245' visibility='default' filepath='include/linux/rcu_segcblist.h' line='80' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='len' type-id='type-id-132' visibility='default' filepath='include/linux/rcu_segcblist.h' line='81' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='len_lazy' type-id='type-id-132' visibility='default' filepath='include/linux/rcu_segcblist.h' line='82' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='blk_mq_queue_data' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/blk-mq.h' line='95' column='1' id='type-id-288'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='rq' type-id='type-id-148' visibility='default' filepath='include/linux/blk-mq.h' line='96' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='last' type-id='type-id-177' visibility='default' filepath='include/linux/blk-mq.h' line='97' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='get_budget_fn' type-id='type-id-289' filepath='include/linux/blk-mq.h' line='102' column='1' id='type-id-290'/>
      <typedef-decl name='put_budget_fn' type-id='type-id-291' filepath='include/linux/blk-mq.h' line='103' column='1' id='type-id-292'/>
      <typedef-decl name='timeout_fn' type-id='type-id-293' filepath='include/linux/blk-mq.h' line='104' column='1' id='type-id-294'/>
      <typedef-decl name='poll_fn' type-id='type-id-295' filepath='include/linux/blk-mq.h' line='115' column='1' id='type-id-296'/>
      <typedef-decl name='init_hctx_fn' type-id='type-id-297' filepath='include/linux/blk-mq.h' line='105' column='1' id='type-id-298'/>
      <typedef-decl name='exit_hctx_fn' type-id='type-id-299' filepath='include/linux/blk-mq.h' line='106' column='1' id='type-id-300'/>
      <typedef-decl name='init_request_fn' type-id='type-id-301' filepath='include/linux/blk-mq.h' line='107' column='1' id='type-id-302'/>
      <class-decl name='blk_mq_tag_set' size-in-bits='896' is-struct='yes' visibility='default' filepath='include/linux/blk-mq.h' line='77' column='1' id='type-id-303'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='mq_map' type-id='type-id-73' visibility='default' filepath='include/linux/blk-mq.h' line='78' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='ops' type-id='type-id-304' visibility='default' filepath='include/linux/blk-mq.h' line='79' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='nr_hw_queues' type-id='type-id-11' visibility='default' filepath='include/linux/blk-mq.h' line='80' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='queue_depth' type-id='type-id-11' visibility='default' filepath='include/linux/blk-mq.h' line='81' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='reserved_tags' type-id='type-id-11' visibility='default' filepath='include/linux/blk-mq.h' line='82' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='224'>
          <var-decl name='cmd_size' type-id='type-id-11' visibility='default' filepath='include/linux/blk-mq.h' line='83' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='numa_node' type-id='type-id-12' visibility='default' filepath='include/linux/blk-mq.h' line='84' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='288'>
          <var-decl name='timeout' type-id='type-id-11' visibility='default' filepath='include/linux/blk-mq.h' line='85' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='flags' type-id='type-id-11' visibility='default' filepath='include/linux/blk-mq.h' line='86' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='driver_data' type-id='type-id-4' visibility='default' filepath='include/linux/blk-mq.h' line='87' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='tags' type-id='type-id-305' visibility='default' filepath='include/linux/blk-mq.h' line='89' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='tag_list_lock' type-id='type-id-280' visibility='default' filepath='include/linux/blk-mq.h' line='91' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='tag_list' type-id='type-id-9' visibility='default' filepath='include/linux/blk-mq.h' line='92' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='exit_request_fn' type-id='type-id-306' filepath='include/linux/blk-mq.h' line='109' column='1' id='type-id-307'/>
      <typedef-decl name='cleanup_rq_fn' type-id='type-id-308' filepath='include/linux/blk-mq.h' line='117' column='1' id='type-id-309'/>
      <typedef-decl name='map_queues_fn' type-id='type-id-310' filepath='include/linux/blk-mq.h' line='116' column='1' id='type-id-311'/>
      <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-262'/>
      <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-265'/>
      <pointer-type-def type-id='type-id-258' size-in-bits='64' id='type-id-233'/>
      <pointer-type-def type-id='type-id-233' size-in-bits='64' id='type-id-312'/>
      <pointer-type-def type-id='type-id-303' size-in-bits='64' id='type-id-232'/>
      <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-267'/>
      <pointer-type-def type-id='type-id-267' size-in-bits='64' id='type-id-305'/>
      <pointer-type-def type-id='type-id-313' size-in-bits='64' id='type-id-314'/>
      <pointer-type-def type-id='type-id-287' size-in-bits='64' id='type-id-234'/>
      <pointer-type-def type-id='type-id-309' size-in-bits='64' id='type-id-315'/>
      <qualified-type-def type-id='type-id-288' const='yes' id='type-id-316'/>
      <pointer-type-def type-id='type-id-316' size-in-bits='64' id='type-id-317'/>
      <qualified-type-def type-id='type-id-318' const='yes' id='type-id-319'/>
      <pointer-type-def type-id='type-id-319' size-in-bits='64' id='type-id-320'/>
      <pointer-type-def type-id='type-id-300' size-in-bits='64' id='type-id-321'/>
      <pointer-type-def type-id='type-id-307' size-in-bits='64' id='type-id-322'/>
      <pointer-type-def type-id='type-id-290' size-in-bits='64' id='type-id-323'/>
      <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-324'/>
      <pointer-type-def type-id='type-id-302' size-in-bits='64' id='type-id-325'/>
      <pointer-type-def type-id='type-id-326' size-in-bits='64' id='type-id-327'/>
      <pointer-type-def type-id='type-id-311' size-in-bits='64' id='type-id-328'/>
      <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-329'/>
      <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-330'/>
      <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-331'/>
      <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-332'/>
      <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-271'/>
      <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-277'/>
      <pointer-type-def type-id='type-id-283' size-in-bits='64' id='type-id-281'/>
      <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-238'/>
      <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-286'/>
      <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-333'/>
      <pointer-type-def type-id='type-id-334' size-in-bits='64' id='type-id-335'/>
      <pointer-type-def type-id='type-id-336' size-in-bits='64' id='type-id-254'/>
      <pointer-type-def type-id='type-id-337' size-in-bits='64' id='type-id-253'/>
      <pointer-type-def type-id='type-id-338' size-in-bits='64' id='type-id-250'/>
      <pointer-type-def type-id='type-id-339' size-in-bits='64' id='type-id-252'/>
      <pointer-type-def type-id='type-id-340' size-in-bits='64' id='type-id-251'/>
      <function-decl name='blk_mq_quiesce_queue' mangled-name='blk_mq_quiesce_queue' filepath='include/linux/blk-mq.h' line='280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_mq_quiesce_queue'>
        <parameter type-id='type-id-147'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='blk_mq_unquiesce_queue' mangled-name='blk_mq_unquiesce_queue' filepath='include/linux/blk-mq.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='blk_mq_unquiesce_queue'>
        <parameter type-id='type-id-147'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-type size-in-bits='64' id='type-id-293'>
        <parameter type-id='type-id-148'/>
        <parameter type-id='type-id-177'/>
        <return type-id='type-id-341'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-295'>
        <parameter type-id='type-id-233'/>
        <parameter type-id='type-id-11'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-297'>
        <parameter type-id='type-id-233'/>
        <parameter type-id='type-id-4'/>
        <parameter type-id='type-id-11'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-310'>
        <parameter type-id='type-id-232'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-301'>
        <parameter type-id='type-id-232'/>
        <parameter type-id='type-id-148'/>
        <parameter type-id='type-id-11'/>
        <parameter type-id='type-id-11'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-326'>
        <parameter type-id='type-id-320'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-256'>
        <parameter type-id='type-id-233'/>
        <parameter type-id='type-id-317'/>
        <return type-id='type-id-270'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-289'>
        <parameter type-id='type-id-233'/>
        <return type-id='type-id-177'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-291'>
        <parameter type-id='type-id-233'/>
        <return type-id='type-id-74'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-299'>
        <parameter type-id='type-id-233'/>
        <parameter type-id='type-id-11'/>
        <return type-id='type-id-74'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-306'>
        <parameter type-id='type-id-232'/>
        <parameter type-id='type-id-148'/>
        <parameter type-id='type-id-11'/>
        <return type-id='type-id-74'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-334'>
        <parameter type-id='type-id-342'/>
        <return type-id='type-id-74'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-308'>
        <parameter type-id='type-id-148'/>
        <return type-id='type-id-74'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-336'>
        <parameter type-id='type-id-343'/>
        <return type-id='type-id-74'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-337'>
        <parameter type-id='type-id-343'/>
        <parameter type-id='type-id-144'/>
        <return type-id='type-id-74'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-338'>
        <parameter type-id='type-id-343'/>
        <parameter type-id='type-id-144'/>
        <parameter type-id='type-id-344'/>
        <return type-id='type-id-74'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-339'>
        <parameter type-id='type-id-343'/>
        <parameter type-id='type-id-148'/>
        <return type-id='type-id-74'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-340'>
        <parameter type-id='type-id-343'/>
        <parameter type-id='type-id-148'/>
        <parameter type-id='type-id-144'/>
        <return type-id='type-id-74'/>
      </function-type>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='block/genhd.c' language='LANG_C89'>
      <enum-decl name='kobject_action' filepath='include/linux/kobject.h' line='53' column='1' id='type-id-345'>
        <underlying-type type-id='type-id-215'/>
        <enumerator name='KOBJ_ADD' value='0'/>
        <enumerator name='KOBJ_REMOVE' value='1'/>
        <enumerator name='KOBJ_CHANGE' value='2'/>
        <enumerator name='KOBJ_MOVE' value='3'/>
        <enumerator name='KOBJ_ONLINE' value='4'/>
        <enumerator name='KOBJ_OFFLINE' value='5'/>
        <enumerator name='KOBJ_BIND' value='6'/>
        <enumerator name='KOBJ_UNBIND' value='7'/>
        <enumerator name='KOBJ_MAX' value='8'/>
      </enum-decl>
      <function-decl name='kobject_uevent_env' mangled-name='kobject_uevent_env' filepath='include/linux/kobject.h' line='240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='kobject_uevent_env'>
        <parameter type-id='type-id-75'/>
        <parameter type-id='type-id-345'/>
        <parameter type-id='type-id-136'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='__alloc_disk_node' mangled-name='__alloc_disk_node' filepath='block/genhd.c' line='1435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__alloc_disk_node'>
        <parameter type-id='type-id-12' name='minors' filepath='block/genhd.c' line='1435' column='1'/>
        <parameter type-id='type-id-12' name='node_id' filepath='block/genhd.c' line='1435' column='1'/>
        <return type-id='type-id-149'/>
      </function-decl>
      <function-decl name='register_blkdev' mangled-name='register_blkdev' filepath='block/genhd.c' line='340' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='register_blkdev'>
        <parameter type-id='type-id-11' name='major' filepath='block/genhd.c' line='340' column='1'/>
        <parameter type-id='type-id-25' name='name' filepath='block/genhd.c' line='340' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='unregister_blkdev' mangled-name='unregister_blkdev' filepath='block/genhd.c' line='404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='unregister_blkdev'>
        <parameter type-id='type-id-11' name='major' filepath='block/genhd.c' line='404' column='1'/>
        <parameter type-id='type-id-25' name='name' filepath='block/genhd.c' line='404' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='device_add_disk' mangled-name='device_add_disk' filepath='block/genhd.c' line='727' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='device_add_disk'>
        <parameter type-id='type-id-143' name='parent' filepath='block/genhd.c' line='727' column='1'/>
        <parameter type-id='type-id-149' name='disk' filepath='block/genhd.c' line='727' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='del_gendisk' mangled-name='del_gendisk' filepath='block/genhd.c' line='739' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='del_gendisk'>
        <parameter type-id='type-id-149' name='disk' filepath='block/genhd.c' line='739' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='put_disk' mangled-name='put_disk' filepath='block/genhd.c' line='1509' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='put_disk'>
        <parameter type-id='type-id-149' name='disk' filepath='block/genhd.c' line='1509' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='set_disk_ro' mangled-name='set_disk_ro' filepath='block/genhd.c' line='1548' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='set_disk_ro'>
        <parameter type-id='type-id-149' name='disk' filepath='block/genhd.c' line='1548' column='1'/>
        <parameter type-id='type-id-12' name='flag' filepath='block/genhd.c' line='1548' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='block/partition-generic.c' language='LANG_C89'>
      <function-decl name='add_uevent_var' mangled-name='add_uevent_var' filepath='include/linux/kobject.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='add_uevent_var'>
        <parameter type-id='type-id-346'/>
        <parameter type-id='type-id-25'/>
        <parameter is-variadic='yes'/>
        <return type-id='type-id-12'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='crypto/adiantum.c' language='LANG_C89'>
      <class-decl name='sg_mapping_iter' size-in-bits='576' is-struct='yes' visibility='default' filepath='include/linux/scatterlist.h' line='413' column='1' id='type-id-347'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='page' type-id='type-id-76' visibility='default' filepath='include/linux/scatterlist.h' line='415' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='addr' type-id='type-id-4' visibility='default' filepath='include/linux/scatterlist.h' line='416' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='length' type-id='type-id-81' visibility='default' filepath='include/linux/scatterlist.h' line='417' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='consumed' type-id='type-id-81' visibility='default' filepath='include/linux/scatterlist.h' line='418' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='piter' type-id='type-id-348' visibility='default' filepath='include/linux/scatterlist.h' line='419' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='__offset' type-id='type-id-11' visibility='default' filepath='include/linux/scatterlist.h' line='422' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='480'>
          <var-decl name='__remaining' type-id='type-id-11' visibility='default' filepath='include/linux/scatterlist.h' line='423' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='__flags' type-id='type-id-11' visibility='default' filepath='include/linux/scatterlist.h' line='424' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='sg_page_iter' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/scatterlist.h' line='349' column='1' id='type-id-348'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='sg' type-id='type-id-34' visibility='default' filepath='include/linux/scatterlist.h' line='350' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='sg_pgoffset' type-id='type-id-11' visibility='default' filepath='include/linux/scatterlist.h' line='351' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='__nents' type-id='type-id-11' visibility='default' filepath='include/linux/scatterlist.h' line='354' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='__pg_advance' type-id='type-id-12' visibility='default' filepath='include/linux/scatterlist.h' line='355' column='1'/>
        </data-member>
      </class-decl>
      <pointer-type-def type-id='type-id-347' size-in-bits='64' id='type-id-349'/>
      <function-decl name='sg_nents' mangled-name='sg_nents' filepath='include/linux/scatterlist.h' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sg_nents'>
        <parameter type-id='type-id-34'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='sg_miter_start' mangled-name='sg_miter_start' filepath='include/linux/scatterlist.h' line='427' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sg_miter_start'>
        <parameter type-id='type-id-349'/>
        <parameter type-id='type-id-34'/>
        <parameter type-id='type-id-11'/>
        <parameter type-id='type-id-11'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='sg_miter_next' mangled-name='sg_miter_next' filepath='include/linux/scatterlist.h' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sg_miter_next'>
        <parameter type-id='type-id-349'/>
        <return type-id='type-id-350'/>
      </function-decl>
      <function-decl name='sg_miter_stop' mangled-name='sg_miter_stop' filepath='include/linux/scatterlist.h' line='431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sg_miter_stop'>
        <parameter type-id='type-id-349'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='crypto/crypto_engine.c' language='LANG_C89'>

      <array-type-def dimensions='1' type-id='type-id-351' size-in-bits='240' id='type-id-352'>
        <subrange length='30' type-id='type-id-6' id='type-id-353'/>

      </array-type-def>
      <class-decl name='rtattr' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-354'/>
      <class-decl name='seq_file' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-355'/>
      <class-decl name='crypto_engine' size-in-bits='1536' is-struct='yes' visibility='default' filepath='include/crypto/engine.h' line='48' column='1' id='type-id-356'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='name' type-id='type-id-352' visibility='default' filepath='include/crypto/engine.h' line='49' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='240'>
          <var-decl name='idling' type-id='type-id-177' visibility='default' filepath='include/crypto/engine.h' line='50' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='248'>
          <var-decl name='busy' type-id='type-id-177' visibility='default' filepath='include/crypto/engine.h' line='51' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='running' type-id='type-id-177' visibility='default' filepath='include/crypto/engine.h' line='52' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='264'>
          <var-decl name='cur_req_prepared' type-id='type-id-177' visibility='default' filepath='include/crypto/engine.h' line='53' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='list' type-id='type-id-9' visibility='default' filepath='include/crypto/engine.h' line='55' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='queue_lock' type-id='type-id-96' visibility='default' filepath='include/crypto/engine.h' line='56' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='queue' type-id='type-id-357' visibility='default' filepath='include/crypto/engine.h' line='57' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='dev' type-id='type-id-143' visibility='default' filepath='include/crypto/engine.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='rt' type-id='type-id-177' visibility='default' filepath='include/crypto/engine.h' line='60' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='prepare_crypt_hardware' type-id='type-id-358' visibility='default' filepath='include/crypto/engine.h' line='62' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='unprepare_crypt_hardware' type-id='type-id-358' visibility='default' filepath='include/crypto/engine.h' line='63' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='kworker' type-id='type-id-359' visibility='default' filepath='include/crypto/engine.h' line='65' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='pump_requests' type-id='type-id-360' visibility='default' filepath='include/crypto/engine.h' line='66' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='priv_data' type-id='type-id-4' visibility='default' filepath='include/crypto/engine.h' line='68' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='cur_req' type-id='type-id-57' visibility='default' filepath='include/crypto/engine.h' line='69' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='crypto_queue' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/crypto/algapi.h' line='78' column='1' id='type-id-357'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='list' type-id='type-id-9' visibility='default' filepath='include/crypto/algapi.h' line='79' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='backlog' type-id='type-id-361' visibility='default' filepath='include/crypto/algapi.h' line='80' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='qlen' type-id='type-id-11' visibility='default' filepath='include/crypto/algapi.h' line='82' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='224'>
          <var-decl name='max_qlen' type-id='type-id-11' visibility='default' filepath='include/crypto/algapi.h' line='83' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='include/linux/crypto.h' line='597' column='1' id='type-id-362'>
        <data-member access='private'>
          <var-decl name='ablkcipher' type-id='type-id-30' visibility='default' filepath='include/linux/crypto.h' line='598' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='blkcipher' type-id='type-id-38' visibility='default' filepath='include/linux/crypto.h' line='599' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='cipher' type-id='type-id-44' visibility='default' filepath='include/linux/crypto.h' line='600' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='compress' type-id='type-id-46' visibility='default' filepath='include/linux/crypto.h' line='601' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='crypto_instance' size-in-bits='5120' is-struct='yes' visibility='default' filepath='include/crypto/algapi.h' line='49' column='1' id='type-id-363'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='alg' type-id='type-id-8' visibility='default' filepath='include/crypto/algapi.h' line='50' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4096'>
          <var-decl name='tmpl' type-id='type-id-364' visibility='default' filepath='include/crypto/algapi.h' line='52' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4160'>
          <var-decl name='list' type-id='type-id-268' visibility='default' filepath='include/crypto/algapi.h' line='53' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5120'>
          <var-decl name='__ctx' type-id='type-id-5' visibility='default' filepath='include/crypto/algapi.h' line='55' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='crypto_template' size-in-bits='1472' is-struct='yes' visibility='default' filepath='include/crypto/algapi.h' line='58' column='1' id='type-id-365'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='list' type-id='type-id-9' visibility='default' filepath='include/crypto/algapi.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='instances' type-id='type-id-179' visibility='default' filepath='include/crypto/algapi.h' line='60' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='module' type-id='type-id-20' visibility='default' filepath='include/crypto/algapi.h' line='61' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='alloc' type-id='type-id-366' visibility='default' filepath='include/crypto/algapi.h' line='63' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='free' type-id='type-id-367' visibility='default' filepath='include/crypto/algapi.h' line='64' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='create' type-id='type-id-368' visibility='default' filepath='include/crypto/algapi.h' line='65' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='name' type-id='type-id-14' visibility='default' filepath='include/crypto/algapi.h' line='67' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__1' size-in-bits='512' is-anonymous='yes' visibility='default' filepath='include/linux/crypto.h' line='478' column='1' id='type-id-369'>
        <data-member access='private'>
          <var-decl name='ablkcipher' type-id='type-id-21' visibility='default' filepath='include/linux/crypto.h' line='479' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='blkcipher' type-id='type-id-48' visibility='default' filepath='include/linux/crypto.h' line='480' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='cipher' type-id='type-id-49' visibility='default' filepath='include/linux/crypto.h' line='481' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='compress' type-id='type-id-50' visibility='default' filepath='include/linux/crypto.h' line='482' column='1'/>
        </data-member>
      </union-decl>
      <pointer-type-def type-id='type-id-356' size-in-bits='64' id='type-id-370'/>
      <pointer-type-def type-id='type-id-363' size-in-bits='64' id='type-id-371'/>
      <pointer-type-def type-id='type-id-372' size-in-bits='64' id='type-id-366'/>
      <pointer-type-def type-id='type-id-365' size-in-bits='64' id='type-id-364'/>
      <pointer-type-def type-id='type-id-373' size-in-bits='64' id='type-id-358'/>
      <pointer-type-def type-id='type-id-374' size-in-bits='64' id='type-id-368'/>
      <pointer-type-def type-id='type-id-375' size-in-bits='64' id='type-id-376'/>
      <pointer-type-def type-id='type-id-377' size-in-bits='64' id='type-id-378'/>
      <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-379'/>
      <pointer-type-def type-id='type-id-379' size-in-bits='64' id='type-id-380'/>
      <pointer-type-def type-id='type-id-355' size-in-bits='64' id='type-id-381'/>
      <pointer-type-def type-id='type-id-382' size-in-bits='64' id='type-id-383'/>
      <pointer-type-def type-id='type-id-384' size-in-bits='64' id='type-id-385'/>
      <pointer-type-def type-id='type-id-386' size-in-bits='64' id='type-id-367'/>
      <pointer-type-def type-id='type-id-387' size-in-bits='64' id='type-id-388'/>
      <function-decl name='_dev_info' mangled-name='_dev_info' filepath='include/linux/device.h' line='1441' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_dev_info'>
        <parameter type-id='type-id-389'/>
        <parameter type-id='type-id-25'/>
        <parameter is-variadic='yes'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='devm_kmalloc' mangled-name='devm_kmalloc' filepath='include/linux/device.h' line='686' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='devm_kmalloc'>
        <parameter type-id='type-id-143'/>
        <parameter type-id='type-id-92'/>
        <parameter type-id='type-id-11'/>
        <return type-id='type-id-4'/>
      </function-decl>
      <function-decl name='crypto_transfer_ablkcipher_request_to_engine' mangled-name='crypto_transfer_ablkcipher_request_to_engine' filepath='crypto/crypto_engine.c' line='228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='crypto_transfer_ablkcipher_request_to_engine'>
        <parameter type-id='type-id-370' name='engine' filepath='crypto/crypto_engine.c' line='228' column='1'/>
        <parameter type-id='type-id-51' name='req' filepath='crypto/crypto_engine.c' line='229' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='crypto_finalize_ablkcipher_request' mangled-name='crypto_finalize_ablkcipher_request' filepath='crypto/crypto_engine.c' line='295' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='crypto_finalize_ablkcipher_request'>
        <parameter type-id='type-id-370' name='engine' filepath='crypto/crypto_engine.c' line='295' column='1'/>
        <parameter type-id='type-id-51' name='req' filepath='crypto/crypto_engine.c' line='296' column='1'/>
        <parameter type-id='type-id-12' name='err' filepath='crypto/crypto_engine.c' line='296' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='crypto_engine_start' mangled-name='crypto_engine_start' filepath='crypto/crypto_engine.c' line='364' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='crypto_engine_start'>
        <parameter type-id='type-id-370' name='engine' filepath='crypto/crypto_engine.c' line='364' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='crypto_engine_alloc_init' mangled-name='crypto_engine_alloc_init' filepath='crypto/crypto_engine.c' line='431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='crypto_engine_alloc_init'>
        <parameter type-id='type-id-143' name='dev' filepath='crypto/crypto_engine.c' line='431' column='1'/>
        <parameter type-id='type-id-177' name='rt' filepath='crypto/crypto_engine.c' line='431' column='1'/>
        <return type-id='type-id-370'/>
      </function-decl>
      <function-decl name='crypto_engine_exit' mangled-name='crypto_engine_exit' filepath='crypto/crypto_engine.c' line='478' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='crypto_engine_exit'>
        <parameter type-id='type-id-370' name='engine' filepath='crypto/crypto_engine.c' line='478' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-type size-in-bits='64' id='type-id-372'>
        <parameter type-id='type-id-380'/>
        <return type-id='type-id-371'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-373'>
        <parameter type-id='type-id-370'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-374'>
        <parameter type-id='type-id-364'/>
        <parameter type-id='type-id-380'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-375'>
        <parameter type-id='type-id-36'/>
        <parameter type-id='type-id-10'/>
        <parameter type-id='type-id-10'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-377'>
        <parameter type-id='type-id-390'/>
        <parameter type-id='type-id-29'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-382'>
        <parameter type-id='type-id-29'/>
        <return type-id='type-id-11'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-384'>
        <parameter type-id='type-id-29'/>
        <parameter type-id='type-id-10'/>
        <parameter type-id='type-id-10'/>
        <return type-id='type-id-11'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-386'>
        <parameter type-id='type-id-371'/>
        <return type-id='type-id-74'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-387'>
        <parameter type-id='type-id-381'/>
        <parameter type-id='type-id-29'/>
        <return type-id='type-id-74'/>
      </function-type>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='crypto/rsa-pkcs1pad.c' language='LANG_C89'>
      <function-decl name='sg_nents_for_len' mangled-name='sg_nents_for_len' filepath='include/linux/scatterlist.h' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sg_nents_for_len'>
        <parameter type-id='type-id-34'/>
        <parameter type-id='type-id-137'/>
        <return type-id='type-id-12'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='crypto/scatterwalk.c' language='LANG_C89'>
      <function-decl name='scatterwalk_map_and_copy' mangled-name='scatterwalk_map_and_copy' filepath='crypto/scatterwalk.c' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='scatterwalk_map_and_copy'>
        <parameter type-id='type-id-4' name='buf' filepath='crypto/scatterwalk.c' line='60' column='1'/>
        <parameter type-id='type-id-34' name='sg' filepath='crypto/scatterwalk.c' line='60' column='1'/>
        <parameter type-id='type-id-11' name='start' filepath='crypto/scatterwalk.c' line='61' column='1'/>
        <parameter type-id='type-id-11' name='nbytes' filepath='crypto/scatterwalk.c' line='61' column='1'/>
        <parameter type-id='type-id-12' name='out' filepath='crypto/scatterwalk.c' line='61' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/base/bus.c' language='LANG_C89'>
      <function-decl name='bus_find_device_by_name' mangled-name='bus_find_device_by_name' filepath='drivers/base/bus.c' line='372' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bus_find_device_by_name'>
        <parameter type-id='type-id-391' name='bus' filepath='drivers/base/bus.c' line='372' column='1'/>
        <parameter type-id='type-id-143' name='start' filepath='drivers/base/bus.c' line='373' column='1'/>
        <parameter type-id='type-id-25' name='name' filepath='drivers/base/bus.c' line='373' column='1'/>
        <return type-id='type-id-143'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/base/devres.c' language='LANG_C89'>
      <typedef-decl name='dr_release_t' type-id='type-id-392' filepath='include/linux/device.h' line='642' column='1' id='type-id-393'/>
      <function-decl name='__devres_alloc_node' mangled-name='__devres_alloc_node' filepath='drivers/base/devres.c' line='120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__devres_alloc_node'>
        <parameter type-id='type-id-393' name='release' filepath='drivers/base/devres.c' line='120' column='1'/>
        <parameter type-id='type-id-81' name='size' filepath='drivers/base/devres.c' line='120' column='1'/>
        <parameter type-id='type-id-151' name='gfp' filepath='drivers/base/devres.c' line='120' column='1'/>
        <parameter type-id='type-id-12' name='nid' filepath='drivers/base/devres.c' line='120' column='1'/>
        <parameter type-id='type-id-25' name='name' filepath='drivers/base/devres.c' line='121' column='1'/>
        <return type-id='type-id-4'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/base/platform.c' language='LANG_C89'>
      <function-decl name='platform_device_add_data' mangled-name='platform_device_add_data' filepath='drivers/base/platform.c' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='platform_device_add_data'>
        <parameter type-id='type-id-394' name='pdev' filepath='drivers/base/platform.c' line='320' column='1'/>
        <parameter type-id='type-id-4' name='data' filepath='drivers/base/platform.c' line='320' column='1'/>
        <parameter type-id='type-id-81' name='size' filepath='drivers/base/platform.c' line='321' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='__platform_driver_register' mangled-name='__platform_driver_register' filepath='drivers/base/platform.c' line='628' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__platform_driver_register'>
        <parameter type-id='type-id-395' name='drv' filepath='drivers/base/platform.c' line='628' column='1'/>
        <parameter type-id='type-id-20' name='owner' filepath='drivers/base/platform.c' line='629' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/base/power/runtime.c' language='LANG_C89'>
      <function-decl name='__pm_runtime_idle' mangled-name='__pm_runtime_idle' filepath='drivers/base/power/runtime.c' line='963' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__pm_runtime_idle'>
        <parameter type-id='type-id-143' name='dev' filepath='drivers/base/power/runtime.c' line='963' column='1'/>
        <parameter type-id='type-id-12' name='rpmflags' filepath='drivers/base/power/runtime.c' line='963' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='__pm_runtime_resume' mangled-name='__pm_runtime_resume' filepath='drivers/base/power/runtime.c' line='1026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__pm_runtime_resume'>
        <parameter type-id='type-id-143' name='dev' filepath='drivers/base/power/runtime.c' line='1026' column='1'/>
        <parameter type-id='type-id-12' name='rpmflags' filepath='drivers/base/power/runtime.c' line='1026' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='__pm_runtime_disable' mangled-name='__pm_runtime_disable' filepath='drivers/base/power/runtime.c' line='1243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__pm_runtime_disable'>
        <parameter type-id='type-id-143' name='dev' filepath='drivers/base/power/runtime.c' line='1243' column='1'/>
        <parameter type-id='type-id-177' name='check_resume' filepath='drivers/base/power/runtime.c' line='1243' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/char/hw_random/core.c' language='LANG_C89'>
      <class-decl name='hwrng' size-in-bits='960' is-struct='yes' visibility='default' filepath='include/linux/hw_random.h' line='38' column='1' id='type-id-396'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='name' type-id='type-id-25' visibility='default' filepath='include/linux/hw_random.h' line='39' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='init' type-id='type-id-397' visibility='default' filepath='include/linux/hw_random.h' line='40' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='cleanup' type-id='type-id-398' visibility='default' filepath='include/linux/hw_random.h' line='41' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='data_present' type-id='type-id-399' visibility='default' filepath='include/linux/hw_random.h' line='42' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='data_read' type-id='type-id-400' visibility='default' filepath='include/linux/hw_random.h' line='43' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='read' type-id='type-id-401' visibility='default' filepath='include/linux/hw_random.h' line='44' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='priv' type-id='type-id-92' visibility='default' filepath='include/linux/hw_random.h' line='45' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='quality' type-id='type-id-169' visibility='default' filepath='include/linux/hw_random.h' line='46' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='list' type-id='type-id-9' visibility='default' filepath='include/linux/hw_random.h' line='49' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='ref' type-id='type-id-402' visibility='default' filepath='include/linux/hw_random.h' line='50' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='cleanup_done' type-id='type-id-282' visibility='default' filepath='include/linux/hw_random.h' line='51' column='1'/>
        </data-member>
      </class-decl>
      <pointer-type-def type-id='type-id-396' size-in-bits='64' id='type-id-403'/>
      <pointer-type-def type-id='type-id-404' size-in-bits='64' id='type-id-397'/>
      <pointer-type-def type-id='type-id-405' size-in-bits='64' id='type-id-399'/>
      <pointer-type-def type-id='type-id-406' size-in-bits='64' id='type-id-400'/>
      <pointer-type-def type-id='type-id-407' size-in-bits='64' id='type-id-401'/>
      <pointer-type-def type-id='type-id-408' size-in-bits='64' id='type-id-398'/>
      <function-decl name='hwrng_register' mangled-name='hwrng_register' filepath='drivers/char/hw_random/core.c' line='457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hwrng_register'>
        <parameter type-id='type-id-403' name='rng' filepath='drivers/char/hw_random/core.c' line='457' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='hwrng_unregister' mangled-name='hwrng_unregister' filepath='drivers/char/hw_random/core.c' line='517' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hwrng_unregister'>
        <parameter type-id='type-id-403' name='rng' filepath='drivers/char/hw_random/core.c' line='517' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-type size-in-bits='64' id='type-id-404'>
        <parameter type-id='type-id-403' name='rng'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-405'>
        <parameter type-id='type-id-403'/>
        <parameter type-id='type-id-12'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-406'>
        <parameter type-id='type-id-403'/>
        <parameter type-id='type-id-230'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-407'>
        <parameter type-id='type-id-403'/>
        <parameter type-id='type-id-4'/>
        <parameter type-id='type-id-81'/>
        <parameter type-id='type-id-177'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-408'>
        <parameter type-id='type-id-403'/>
        <return type-id='type-id-74'/>
      </function-type>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/cpufreq/cpufreq.c' language='LANG_C89'>
      <class-decl name='clk' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-409'/>
      <class-decl name='cpufreq_stats' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-410'/>
      <class-decl name='cpufreq_driver' size-in-bits='1472' is-struct='yes' visibility='default' filepath='include/linux/cpufreq.h' line='266' column='1' id='type-id-411'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='name' type-id='type-id-412' visibility='default' filepath='include/linux/cpufreq.h' line='267' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='flags' type-id='type-id-54' visibility='default' filepath='include/linux/cpufreq.h' line='268' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='driver_data' type-id='type-id-4' visibility='default' filepath='include/linux/cpufreq.h' line='269' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='init' type-id='type-id-413' visibility='default' filepath='include/linux/cpufreq.h' line='272' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='verify' type-id='type-id-413' visibility='default' filepath='include/linux/cpufreq.h' line='273' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='setpolicy' type-id='type-id-413' visibility='default' filepath='include/linux/cpufreq.h' line='276' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='target' type-id='type-id-414' visibility='default' filepath='include/linux/cpufreq.h' line='282' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='target_index' type-id='type-id-415' visibility='default' filepath='include/linux/cpufreq.h' line='285' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='fast_switch' type-id='type-id-416' visibility='default' filepath='include/linux/cpufreq.h' line='287' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='resolve_freq' type-id='type-id-416' visibility='default' filepath='include/linux/cpufreq.h' line='296' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='get_intermediate' type-id='type-id-416' visibility='default' filepath='include/linux/cpufreq.h' line='314' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='target_intermediate' type-id='type-id-415' visibility='default' filepath='include/linux/cpufreq.h' line='316' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='get' type-id='type-id-417' visibility='default' filepath='include/linux/cpufreq.h' line='320' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='bios_limit' type-id='type-id-418' visibility='default' filepath='include/linux/cpufreq.h' line='323' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='exit' type-id='type-id-413' visibility='default' filepath='include/linux/cpufreq.h' line='325' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='stop_cpu' type-id='type-id-419' visibility='default' filepath='include/linux/cpufreq.h' line='326' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='suspend' type-id='type-id-413' visibility='default' filepath='include/linux/cpufreq.h' line='327' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='resume' type-id='type-id-413' visibility='default' filepath='include/linux/cpufreq.h' line='328' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='ready' type-id='type-id-419' visibility='default' filepath='include/linux/cpufreq.h' line='331' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='attr' type-id='type-id-420' visibility='default' filepath='include/linux/cpufreq.h' line='333' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='boost_enabled' type-id='type-id-177' visibility='default' filepath='include/linux/cpufreq.h' line='336' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='set_boost' type-id='type-id-421' visibility='default' filepath='include/linux/cpufreq.h' line='337' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='cpufreq_policy' size-in-bits='3200' is-struct='yes' visibility='default' filepath='include/linux/cpufreq.h' line='65' column='1' id='type-id-422'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='cpus' type-id='type-id-261' visibility='default' filepath='include/linux/cpufreq.h' line='67' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='related_cpus' type-id='type-id-261' visibility='default' filepath='include/linux/cpufreq.h' line='68' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='real_cpus' type-id='type-id-261' visibility='default' filepath='include/linux/cpufreq.h' line='69' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='shared_type' type-id='type-id-11' visibility='default' filepath='include/linux/cpufreq.h' line='71' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='224'>
          <var-decl name='cpu' type-id='type-id-11' visibility='default' filepath='include/linux/cpufreq.h' line='73' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='clk' type-id='type-id-423' visibility='default' filepath='include/linux/cpufreq.h' line='75' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='cpuinfo' type-id='type-id-424' visibility='default' filepath='include/linux/cpufreq.h' line='76' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='416'>
          <var-decl name='min' type-id='type-id-11' visibility='default' filepath='include/linux/cpufreq.h' line='78' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='max' type-id='type-id-11' visibility='default' filepath='include/linux/cpufreq.h' line='79' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='480'>
          <var-decl name='cur' type-id='type-id-11' visibility='default' filepath='include/linux/cpufreq.h' line='80' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='restore_freq' type-id='type-id-11' visibility='default' filepath='include/linux/cpufreq.h' line='82' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='544'>
          <var-decl name='suspend_freq' type-id='type-id-11' visibility='default' filepath='include/linux/cpufreq.h' line='83' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='policy' type-id='type-id-11' visibility='default' filepath='include/linux/cpufreq.h' line='85' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='608'>
          <var-decl name='last_policy' type-id='type-id-11' visibility='default' filepath='include/linux/cpufreq.h' line='86' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='governor' type-id='type-id-425' visibility='default' filepath='include/linux/cpufreq.h' line='87' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='governor_data' type-id='type-id-4' visibility='default' filepath='include/linux/cpufreq.h' line='88' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='last_governor' type-id='type-id-412' visibility='default' filepath='include/linux/cpufreq.h' line='89' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='update' type-id='type-id-108' visibility='default' filepath='include/linux/cpufreq.h' line='91' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='user_policy' type-id='type-id-426' visibility='default' filepath='include/linux/cpufreq.h' line='94' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='freq_table' type-id='type-id-427' visibility='default' filepath='include/linux/cpufreq.h' line='95' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='freq_table_sorted' type-id='type-id-428' visibility='default' filepath='include/linux/cpufreq.h' line='96' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='policy_list' type-id='type-id-9' visibility='default' filepath='include/linux/cpufreq.h' line='98' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='kobj' type-id='type-id-197' visibility='default' filepath='include/linux/cpufreq.h' line='99' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='kobj_unregister' type-id='type-id-282' visibility='default' filepath='include/linux/cpufreq.h' line='100' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2240'>
          <var-decl name='rwsem' type-id='type-id-97' visibility='default' filepath='include/linux/cpufreq.h' line='110' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2560'>
          <var-decl name='fast_switch_possible' type-id='type-id-177' visibility='default' filepath='include/linux/cpufreq.h' line='120' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2568'>
          <var-decl name='fast_switch_enabled' type-id='type-id-177' visibility='default' filepath='include/linux/cpufreq.h' line='121' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2592'>
          <var-decl name='transition_delay_us' type-id='type-id-11' visibility='default' filepath='include/linux/cpufreq.h' line='128' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2624'>
          <var-decl name='dvfs_possible_from_any_cpu' type-id='type-id-177' visibility='default' filepath='include/linux/cpufreq.h' line='137' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2656'>
          <var-decl name='cached_target_freq' type-id='type-id-11' visibility='default' filepath='include/linux/cpufreq.h' line='140' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2688'>
          <var-decl name='cached_resolved_idx' type-id='type-id-12' visibility='default' filepath='include/linux/cpufreq.h' line='141' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2720'>
          <var-decl name='transition_ongoing' type-id='type-id-177' visibility='default' filepath='include/linux/cpufreq.h' line='144' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2752'>
          <var-decl name='transition_lock' type-id='type-id-96' visibility='default' filepath='include/linux/cpufreq.h' line='145' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2816'>
          <var-decl name='transition_wait' type-id='type-id-279' visibility='default' filepath='include/linux/cpufreq.h' line='146' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3008'>
          <var-decl name='transition_task' type-id='type-id-104' visibility='default' filepath='include/linux/cpufreq.h' line='147' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3072'>
          <var-decl name='stats' type-id='type-id-429' visibility='default' filepath='include/linux/cpufreq.h' line='150' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3136'>
          <var-decl name='driver_data' type-id='type-id-4' visibility='default' filepath='include/linux/cpufreq.h' line='153' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='cpufreq_cpuinfo' size-in-bits='96' is-struct='yes' visibility='default' filepath='include/linux/cpufreq.h' line='52' column='1' id='type-id-424'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='max_freq' type-id='type-id-11' visibility='default' filepath='include/linux/cpufreq.h' line='53' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='min_freq' type-id='type-id-11' visibility='default' filepath='include/linux/cpufreq.h' line='54' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='transition_latency' type-id='type-id-11' visibility='default' filepath='include/linux/cpufreq.h' line='57' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='cpufreq_governor' size-in-bits='832' is-struct='yes' visibility='default' filepath='include/linux/cpufreq.h' line='500' column='1' id='type-id-430'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='name' type-id='type-id-412' visibility='default' filepath='include/linux/cpufreq.h' line='501' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='init' type-id='type-id-413' visibility='default' filepath='include/linux/cpufreq.h' line='502' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='exit' type-id='type-id-419' visibility='default' filepath='include/linux/cpufreq.h' line='503' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='start' type-id='type-id-413' visibility='default' filepath='include/linux/cpufreq.h' line='504' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='stop' type-id='type-id-419' visibility='default' filepath='include/linux/cpufreq.h' line='505' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='limits' type-id='type-id-419' visibility='default' filepath='include/linux/cpufreq.h' line='506' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='show_setspeed' type-id='type-id-431' visibility='default' filepath='include/linux/cpufreq.h' line='507' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='store_setspeed' type-id='type-id-415' visibility='default' filepath='include/linux/cpufreq.h' line='509' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='dynamic_switching' type-id='type-id-177' visibility='default' filepath='include/linux/cpufreq.h' line='512' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='governor_list' type-id='type-id-9' visibility='default' filepath='include/linux/cpufreq.h' line='513' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='owner' type-id='type-id-20' visibility='default' filepath='include/linux/cpufreq.h' line='514' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='cpufreq_user_policy' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/linux/cpufreq.h' line='60' column='1' id='type-id-426'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='min' type-id='type-id-11' visibility='default' filepath='include/linux/cpufreq.h' line='61' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='max' type-id='type-id-11' visibility='default' filepath='include/linux/cpufreq.h' line='62' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='cpufreq_frequency_table' size-in-bits='96' is-struct='yes' visibility='default' filepath='include/linux/cpufreq.h' line='576' column='1' id='type-id-432'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='flags' type-id='type-id-11' visibility='default' filepath='include/linux/cpufreq.h' line='577' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='driver_data' type-id='type-id-11' visibility='default' filepath='include/linux/cpufreq.h' line='578' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='frequency' type-id='type-id-11' visibility='default' filepath='include/linux/cpufreq.h' line='579' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='cpufreq_table_sorting' filepath='include/linux/cpufreq.h' line='39' column='1' id='type-id-428'>
        <underlying-type type-id='type-id-215'/>
        <enumerator name='CPUFREQ_TABLE_UNSORTED' value='0'/>
        <enumerator name='CPUFREQ_TABLE_SORTED_ASCENDING' value='1'/>
        <enumerator name='CPUFREQ_TABLE_SORTED_DESCENDING' value='2'/>
      </enum-decl>
      <class-decl name='freq_attr' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/cpufreq.h' line='235' column='1' id='type-id-433'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='attr' type-id='type-id-434' visibility='default' filepath='include/linux/cpufreq.h' line='236' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='show' type-id='type-id-431' visibility='default' filepath='include/linux/cpufreq.h' line='237' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='store' type-id='type-id-435' visibility='default' filepath='include/linux/cpufreq.h' line='238' column='1'/>
        </data-member>
      </class-decl>
      <pointer-type-def type-id='type-id-409' size-in-bits='64' id='type-id-423'/>
      <pointer-type-def type-id='type-id-411' size-in-bits='64' id='type-id-436'/>
      <pointer-type-def type-id='type-id-432' size-in-bits='64' id='type-id-427'/>
      <pointer-type-def type-id='type-id-430' size-in-bits='64' id='type-id-425'/>
      <pointer-type-def type-id='type-id-422' size-in-bits='64' id='type-id-437'/>
      <pointer-type-def type-id='type-id-410' size-in-bits='64' id='type-id-429'/>
      <pointer-type-def type-id='type-id-433' size-in-bits='64' id='type-id-438'/>
      <pointer-type-def type-id='type-id-438' size-in-bits='64' id='type-id-420'/>
      <pointer-type-def type-id='type-id-439' size-in-bits='64' id='type-id-413'/>
      <pointer-type-def type-id='type-id-440' size-in-bits='64' id='type-id-415'/>
      <pointer-type-def type-id='type-id-441' size-in-bits='64' id='type-id-414'/>
      <pointer-type-def type-id='type-id-442' size-in-bits='64' id='type-id-418'/>
      <pointer-type-def type-id='type-id-443' size-in-bits='64' id='type-id-431'/>
      <pointer-type-def type-id='type-id-444' size-in-bits='64' id='type-id-435'/>
      <pointer-type-def type-id='type-id-445' size-in-bits='64' id='type-id-416'/>
      <pointer-type-def type-id='type-id-446' size-in-bits='64' id='type-id-417'/>
      <pointer-type-def type-id='type-id-447' size-in-bits='64' id='type-id-419'/>
      <function-decl name='cpufreq_register_driver' mangled-name='cpufreq_register_driver' filepath='drivers/cpufreq/cpufreq.c' line='2493' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cpufreq_register_driver'>
        <parameter type-id='type-id-436' name='driver_data' filepath='drivers/cpufreq/cpufreq.c' line='2493' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='cpufreq_unregister_driver' mangled-name='cpufreq_unregister_driver' filepath='drivers/cpufreq/cpufreq.c' line='2586' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cpufreq_unregister_driver'>
        <parameter type-id='type-id-436' name='driver' filepath='drivers/cpufreq/cpufreq.c' line='2586' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-type size-in-bits='64' id='type-id-439'>
        <parameter type-id='type-id-437'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-440'>
        <parameter type-id='type-id-437'/>
        <parameter type-id='type-id-11'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-441'>
        <parameter type-id='type-id-437'/>
        <parameter type-id='type-id-11'/>
        <parameter type-id='type-id-11'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-442'>
        <parameter type-id='type-id-12'/>
        <parameter type-id='type-id-73'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-443'>
        <parameter type-id='type-id-437'/>
        <parameter type-id='type-id-182'/>
        <return type-id='type-id-448'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-444'>
        <parameter type-id='type-id-437'/>
        <parameter type-id='type-id-25'/>
        <parameter type-id='type-id-81'/>
        <return type-id='type-id-448'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-445'>
        <parameter type-id='type-id-437'/>
        <parameter type-id='type-id-11'/>
        <return type-id='type-id-11'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-446'>
        <parameter type-id='type-id-11'/>
        <return type-id='type-id-11'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-447'>
        <parameter type-id='type-id-437'/>
        <return type-id='type-id-74'/>
      </function-type>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/dma-buf/dma-buf.c' language='LANG_C89'>
      <function-decl name='reservation_object_wait_timeout_rcu' mangled-name='reservation_object_wait_timeout_rcu' filepath='include/linux/reservation.h' line='283' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='reservation_object_wait_timeout_rcu'>
        <parameter type-id='type-id-449'/>
        <parameter type-id='type-id-350'/>
        <parameter type-id='type-id-350'/>
        <parameter type-id='type-id-92'/>
        <return type-id='type-id-132'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/dma-buf/dma-fence-array.c' language='LANG_C89'>
      <function-decl name='dma_fence_match_context' mangled-name='dma_fence_match_context' filepath='drivers/dma-buf/dma-fence-array.c' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dma_fence_match_context'>
        <parameter type-id='type-id-450' name='fence' filepath='drivers/dma-buf/dma-fence-array.c' line='166' column='1'/>
        <parameter type-id='type-id-90' name='context' filepath='drivers/dma-buf/dma-fence-array.c' line='166' column='1'/>
        <return type-id='type-id-177'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/dma-buf/dma-fence.c' language='LANG_C89'>
      <function-decl name='dma_fence_signal_locked' mangled-name='dma_fence_signal_locked' filepath='drivers/dma-buf/dma-fence.c' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dma_fence_signal_locked'>
        <parameter type-id='type-id-450' name='fence' filepath='drivers/dma-buf/dma-fence.c' line='102' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='dma_fence_release' mangled-name='dma_fence_release' filepath='drivers/dma-buf/dma-fence.c' line='217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dma_fence_release'>
        <parameter type-id='type-id-451' name='kref' filepath='drivers/dma-buf/dma-fence.c' line='217' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/dma-buf/reservation.c' language='LANG_C89'>
      <function-decl name='reservation_object_reserve_shared' mangled-name='reservation_object_reserve_shared' filepath='drivers/dma-buf/reservation.c' line='69' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='reservation_object_reserve_shared'>
        <parameter type-id='type-id-449' name='obj' filepath='drivers/dma-buf/reservation.c' line='69' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='reservation_object_add_shared_fence' mangled-name='reservation_object_add_shared_fence' filepath='drivers/dma-buf/reservation.c' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='reservation_object_add_shared_fence'>
        <parameter type-id='type-id-449' name='obj' filepath='drivers/dma-buf/reservation.c' line='226' column='1'/>
        <parameter type-id='type-id-450' name='fence' filepath='drivers/dma-buf/reservation.c' line='227' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='reservation_object_add_excl_fence' mangled-name='reservation_object_add_excl_fence' filepath='drivers/dma-buf/reservation.c' line='248' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='reservation_object_add_excl_fence'>
        <parameter type-id='type-id-449' name='obj' filepath='drivers/dma-buf/reservation.c' line='248' column='1'/>
        <parameter type-id='type-id-450' name='fence' filepath='drivers/dma-buf/reservation.c' line='249' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='reservation_object_copy_fences' mangled-name='reservation_object_copy_fences' filepath='drivers/dma-buf/reservation.c' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='reservation_object_copy_fences'>
        <parameter type-id='type-id-449' name='dst' filepath='drivers/dma-buf/reservation.c' line='287' column='1'/>
        <parameter type-id='type-id-449' name='src' filepath='drivers/dma-buf/reservation.c' line='288' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='reservation_object_test_signaled_rcu' mangled-name='reservation_object_test_signaled_rcu' filepath='drivers/dma-buf/reservation.c' line='590' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='reservation_object_test_signaled_rcu'>
        <parameter type-id='type-id-449' name='obj' filepath='drivers/dma-buf/reservation.c' line='590' column='1'/>
        <parameter type-id='type-id-177' name='test_all' filepath='drivers/dma-buf/reservation.c' line='591' column='1'/>
        <return type-id='type-id-177'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/firmware/efi/libstub/arm-stub.c' language='LANG_C89'>
      <type-decl name='char' size-in-bits='8' id='type-id-351'/>
      <type-decl name='unsigned long int' size-in-bits='64' id='type-id-92'/>
      <type-decl name='void' id='type-id-74'/>
      <pointer-type-def type-id='type-id-351' size-in-bits='64' id='type-id-182'/>
      <qualified-type-def type-id='type-id-351' const='yes' id='type-id-452'/>
      <pointer-type-def type-id='type-id-452' size-in-bits='64' id='type-id-25'/>
      <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-4'/>
      <function-decl name='strstr' mangled-name='strstr' filepath='include/linux/string.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strstr'>
        <parameter type-id='type-id-25'/>
        <parameter type-id='type-id-25'/>
        <return type-id='type-id-182'/>
      </function-decl>
      <function-decl name='memcpy' mangled-name='memcpy' filepath='arch/arm64/include/asm/string.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy'>
        <parameter type-id='type-id-4'/>
        <parameter type-id='type-id-4'/>
        <parameter type-id='type-id-92'/>
        <return type-id='type-id-4'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/firmware/efi/libstub/efi-stub-helper.c' language='LANG_C89'>
      <function-decl name='strlen' mangled-name='strlen' filepath='arch/arm64/include/asm/string.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlen'>
        <parameter type-id='type-id-25'/>
        <return type-id='type-id-92'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/gnss/core.c' language='LANG_C89'>
      <array-type-def dimensions='1' type-id='type-id-150' size-in-bits='infinite' id='type-id-453'>
        <subrange length='infinite' type-id='type-id-6' id='type-id-7'/>

      </array-type-def>
      <class-decl name='gnss_device' size-in-bits='8576' is-struct='yes' visibility='default' filepath='include/linux/gnss.h' line='36' column='1' id='type-id-454'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='dev' type-id='type-id-176' visibility='default' filepath='include/linux/gnss.h' line='37' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6208'>
          <var-decl name='cdev' type-id='type-id-455' visibility='default' filepath='include/linux/gnss.h' line='38' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7040'>
          <var-decl name='id' type-id='type-id-12' visibility='default' filepath='include/linux/gnss.h' line='39' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7072'>
          <var-decl name='type' type-id='type-id-456' visibility='default' filepath='include/linux/gnss.h' line='41' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7104'>
          <var-decl name='flags' type-id='type-id-92' visibility='default' filepath='include/linux/gnss.h' line='42' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7168'>
          <var-decl name='rwsem' type-id='type-id-97' visibility='default' filepath='include/linux/gnss.h' line='44' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7488'>
          <var-decl name='ops' type-id='type-id-457' visibility='default' filepath='include/linux/gnss.h' line='45' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7552'>
          <var-decl name='count' type-id='type-id-11' visibility='default' filepath='include/linux/gnss.h' line='46' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='31'>
          <var-decl name='disconnected' type-id='type-id-11' visibility='default' filepath='include/linux/gnss.h' line='47' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7616'>
          <var-decl name='read_mutex' type-id='type-id-280' visibility='default' filepath='include/linux/gnss.h' line='49' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7872'>
          <var-decl name='read_fifo' type-id='type-id-458' visibility='default' filepath='include/linux/gnss.h' line='50' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8064'>
          <var-decl name='read_queue' type-id='type-id-279' visibility='default' filepath='include/linux/gnss.h' line='51' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8256'>
          <var-decl name='write_mutex' type-id='type-id-280' visibility='default' filepath='include/linux/gnss.h' line='53' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8512'>
          <var-decl name='write_buf' type-id='type-id-182' visibility='default' filepath='include/linux/gnss.h' line='54' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='gnss_type' filepath='include/linux/gnss.h' line='21' column='1' id='type-id-456'>
        <underlying-type type-id='type-id-215'/>
        <enumerator name='GNSS_TYPE_NMEA' value='0'/>
        <enumerator name='GNSS_TYPE_SIRF' value='1'/>
        <enumerator name='GNSS_TYPE_UBX' value='2'/>
        <enumerator name='GNSS_TYPE_COUNT' value='3'/>
      </enum-decl>
      <class-decl name='gnss_operations' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/gnss.h' line='29' column='1' id='type-id-459'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='open' type-id='type-id-460' visibility='default' filepath='include/linux/gnss.h' line='30' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='close' type-id='type-id-461' visibility='default' filepath='include/linux/gnss.h' line='31' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='write_raw' type-id='type-id-462' visibility='default' filepath='include/linux/gnss.h' line='32' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kfifo' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/kfifo.h' line='97' column='1' id='type-id-458'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='' type-id='type-id-463' visibility='default' filepath='include/linux/kfifo.h' line='97' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='buf' type-id='type-id-453' visibility='default' filepath='include/linux/kfifo.h' line='97' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__' size-in-bits='192' is-anonymous='yes' visibility='default' filepath='include/linux/kfifo.h' line='97' column='1' id='type-id-463'>
        <data-member access='private'>
          <var-decl name='kfifo' type-id='type-id-464' visibility='default' filepath='include/linux/kfifo.h' line='97' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='type' type-id='type-id-465' visibility='default' filepath='include/linux/kfifo.h' line='97' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='const_type' type-id='type-id-466' visibility='default' filepath='include/linux/kfifo.h' line='97' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='rectype' type-id='type-id-467' visibility='default' filepath='include/linux/kfifo.h' line='97' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='ptr' type-id='type-id-4' visibility='default' filepath='include/linux/kfifo.h' line='97' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='ptr_const' type-id='type-id-4' visibility='default' filepath='include/linux/kfifo.h' line='97' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='__kfifo' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/kfifo.h' line='58' column='1' id='type-id-464'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='in' type-id='type-id-11' visibility='default' filepath='include/linux/kfifo.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='out' type-id='type-id-11' visibility='default' filepath='include/linux/kfifo.h' line='60' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='mask' type-id='type-id-11' visibility='default' filepath='include/linux/kfifo.h' line='61' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='esize' type-id='type-id-11' visibility='default' filepath='include/linux/kfifo.h' line='62' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='data' type-id='type-id-4' visibility='default' filepath='include/linux/kfifo.h' line='63' column='1'/>
        </data-member>
      </class-decl>
      <pointer-type-def type-id='type-id-468' size-in-bits='64' id='type-id-467'/>
      <qualified-type-def type-id='type-id-459' const='yes' id='type-id-469'/>
      <pointer-type-def type-id='type-id-469' size-in-bits='64' id='type-id-457'/>
      <pointer-type-def type-id='type-id-454' size-in-bits='64' id='type-id-470'/>
      <pointer-type-def type-id='type-id-471' size-in-bits='64' id='type-id-460'/>
      <pointer-type-def type-id='type-id-472' size-in-bits='64' id='type-id-462'/>
      <pointer-type-def type-id='type-id-473' size-in-bits='64' id='type-id-461'/>
      <function-decl name='gnss_allocate_device' mangled-name='gnss_allocate_device' filepath='drivers/gnss/core.c' line='224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnss_allocate_device'>
        <parameter type-id='type-id-143' name='parent' filepath='drivers/gnss/core.c' line='224' column='1'/>
        <return type-id='type-id-470'/>
      </function-decl>
      <function-decl name='gnss_put_device' mangled-name='gnss_put_device' filepath='drivers/gnss/core.c' line='277' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnss_put_device'>
        <parameter type-id='type-id-470' name='gdev' filepath='drivers/gnss/core.c' line='277' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='gnss_register_device' mangled-name='gnss_register_device' filepath='drivers/gnss/core.c' line='283' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnss_register_device'>
        <parameter type-id='type-id-470' name='gdev' filepath='drivers/gnss/core.c' line='283' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='gnss_deregister_device' mangled-name='gnss_deregister_device' filepath='drivers/gnss/core.c' line='301' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnss_deregister_device'>
        <parameter type-id='type-id-470' name='gdev' filepath='drivers/gnss/core.c' line='301' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='gnss_insert_raw' mangled-name='gnss_insert_raw' filepath='drivers/gnss/core.c' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnss_insert_raw'>
        <parameter type-id='type-id-470' name='gdev' filepath='drivers/gnss/core.c' line='320' column='1'/>
        <parameter type-id='type-id-466' name='buf' filepath='drivers/gnss/core.c' line='320' column='1'/>
        <parameter type-id='type-id-81' name='count' filepath='drivers/gnss/core.c' line='321' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-type size-in-bits='64' id='type-id-471'>
        <parameter type-id='type-id-470'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-472'>
        <parameter type-id='type-id-470'/>
        <parameter type-id='type-id-466'/>
        <parameter type-id='type-id-81'/>
        <return type-id='type-id-12'/>
      </function-type>
      <function-type size-in-bits='64' id='type-id-473'>
        <parameter type-id='type-id-470'/>
        <return type-id='type-id-74'/>
      </function-type>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/gpio/gpiolib.c' language='LANG_C89'>
      <function-decl name='bus_unregister' mangled-name='bus_unregister' filepath='include/linux/device.h' line='158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bus_unregister'>
        <parameter type-id='type-id-391'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/gpu/drm/bridge/panel.c' language='LANG_C89'>
      <function-decl name='drm_connector_init' mangled-name='drm_connector_init' filepath='include/drm/drm_connector.h' line='1082' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_connector_init'>
        <parameter type-id='type-id-474'/>
        <parameter type-id='type-id-475'/>
        <parameter type-id='type-id-476'/>
        <parameter type-id='type-id-12'/>
        <return type-id='type-id-12'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/gpu/drm/drm_atomic.c' language='LANG_C89'>
      <class-decl name='sync_file' size-in-bits='832' is-struct='yes' visibility='default' filepath='include/linux/sync_file.h' line='35' column='1' id='type-id-477'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='file' type-id='type-id-106' visibility='default' filepath='include/linux/sync_file.h' line='36' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='user_name' type-id='type-id-478' visibility='default' filepath='include/linux/sync_file.h' line='44' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='wq' type-id='type-id-279' visibility='default' filepath='include/linux/sync_file.h' line='49' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='flags' type-id='type-id-92' visibility='default' filepath='include/linux/sync_file.h' line='50' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='fence' type-id='type-id-450' visibility='default' filepath='include/linux/sync_file.h' line='52' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='cb' type-id='type-id-479' visibility='default' filepath='include/linux/sync_file.h' line='53' column='1'/>
        </data-member>
      </class-decl>
      <pointer-type-def type-id='type-id-477' size-in-bits='64' id='type-id-480'/>
      <function-decl name='sync_file_get_fence' mangled-name='sync_file_get_fence' filepath='include/linux/sync_file.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sync_file_get_fence'>
        <parameter type-id='type-id-12'/>
        <return type-id='type-id-450'/>
      </function-decl>
      <function-decl name='sync_file_create' mangled-name='sync_file_create' filepath='include/linux/sync_file.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sync_file_create'>
        <parameter type-id='type-id-450'/>
        <return type-id='type-id-480'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/gpu/drm/drm_atomic_helper.c' language='LANG_C89'>
      <class-decl name='drm_fb_helper' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-481'/>
      <pointer-type-def type-id='type-id-481' size-in-bits='64' id='type-id-482'/>
      <function-decl name='drm_atomic_helper_commit_planes' mangled-name='drm_atomic_helper_commit_planes' filepath='include/drm/drm_atomic_helper.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_atomic_helper_commit_planes'>
        <parameter type-id='type-id-474'/>
        <parameter type-id='type-id-483'/>
        <parameter type-id='type-id-11'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='drm_atomic_helper_commit_hw_done' mangled-name='drm_atomic_helper_commit_hw_done' filepath='include/drm/drm_atomic_helper.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_atomic_helper_commit_hw_done'>
        <parameter type-id='type-id-483'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='drm_atomic_helper_cleanup_planes' mangled-name='drm_atomic_helper_cleanup_planes' filepath='include/drm/drm_atomic_helper.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_atomic_helper_cleanup_planes'>
        <parameter type-id='type-id-474'/>
        <parameter type-id='type-id-483'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='drm_crtc_send_vblank_event' mangled-name='drm_crtc_send_vblank_event' filepath='include/drm/drm_vblank.h' line='202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_crtc_send_vblank_event'>
        <parameter type-id='type-id-484'/>
        <parameter type-id='type-id-485'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='drm_mode_config_reset' mangled-name='drm_mode_config_reset' filepath='include/drm/drm_mode_config.h' line='856' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_mode_config_reset'>
        <parameter type-id='type-id-474'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='dma_fence_wait_timeout' mangled-name='dma_fence_wait_timeout' filepath='include/linux/dma-fence.h' line='509' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dma_fence_wait_timeout'>
        <parameter type-id='type-id-450'/>
        <parameter type-id='type-id-350'/>
        <parameter type-id='type-id-132'/>
        <return type-id='type-id-132'/>
      </function-decl>
      <function-decl name='drm_atomic_helper_check' mangled-name='drm_atomic_helper_check' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='887' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_atomic_helper_check'>
        <parameter type-id='type-id-474' name='dev' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='887' column='1'/>
        <parameter type-id='type-id-483' name='state' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='888' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='drm_atomic_helper_commit_modeset_disables' mangled-name='drm_atomic_helper_commit_modeset_disables' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='1165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_atomic_helper_commit_modeset_disables'>
        <parameter type-id='type-id-474' name='dev' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='1165' column='1'/>
        <parameter type-id='type-id-483' name='old_state' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='1166' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='drm_atomic_helper_commit_modeset_enables' mangled-name='drm_atomic_helper_commit_modeset_enables' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='1211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_atomic_helper_commit_modeset_enables'>
        <parameter type-id='type-id-474' name='dev' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='1211' column='1'/>
        <parameter type-id='type-id-483' name='old_state' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='1212' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='drm_atomic_helper_wait_for_vblanks' mangled-name='drm_atomic_helper_wait_for_vblanks' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='1349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_atomic_helper_wait_for_vblanks'>
        <parameter type-id='type-id-474' name='dev' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='1349' column='1'/>
        <parameter type-id='type-id-483' name='old_state' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='1350' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='drm_atomic_helper_commit' mangled-name='drm_atomic_helper_commit' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='1662' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_atomic_helper_commit'>
        <parameter type-id='type-id-474' name='dev' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='1662' column='1'/>
        <parameter type-id='type-id-483' name='state' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='1663' column='1'/>
        <parameter type-id='type-id-177' name='nonblock' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='1664' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='drm_atomic_helper_update_plane' mangled-name='drm_atomic_helper_update_plane' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='2710' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_atomic_helper_update_plane'>
        <parameter type-id='type-id-486' name='plane' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='2710' column='1'/>
        <parameter type-id='type-id-484' name='crtc' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='2711' column='1'/>
        <parameter type-id='type-id-487' name='fb' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='2712' column='1'/>
        <parameter type-id='type-id-12' name='crtc_x' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='2713' column='1'/>
        <parameter type-id='type-id-12' name='crtc_y' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='2713' column='1'/>
        <parameter type-id='type-id-11' name='crtc_w' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='2714' column='1'/>
        <parameter type-id='type-id-11' name='crtc_h' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='2714' column='1'/>
        <parameter type-id='type-id-488' name='src_x' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='2715' column='1'/>
        <parameter type-id='type-id-488' name='src_y' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='2715' column='1'/>
        <parameter type-id='type-id-488' name='src_w' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='2716' column='1'/>
        <parameter type-id='type-id-488' name='src_h' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='2716' column='1'/>
        <parameter type-id='type-id-489' name='ctx' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='2717' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='drm_atomic_helper_disable_plane' mangled-name='drm_atomic_helper_disable_plane' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='2767' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_atomic_helper_disable_plane'>
        <parameter type-id='type-id-486' name='plane' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='2767' column='1'/>
        <parameter type-id='type-id-489' name='ctx' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='2768' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='drm_atomic_helper_set_config' mangled-name='drm_atomic_helper_set_config' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='2904' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_atomic_helper_set_config'>
        <parameter type-id='type-id-490' name='set' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='2904' column='1'/>
        <parameter type-id='type-id-489' name='ctx' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='2905' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='drm_atomic_helper_shutdown' mangled-name='drm_atomic_helper_shutdown' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='3109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_atomic_helper_shutdown'>
        <parameter type-id='type-id-474' name='dev' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='3109' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='drm_atomic_helper_page_flip' mangled-name='drm_atomic_helper_page_flip' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='3343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_atomic_helper_page_flip'>
        <parameter type-id='type-id-484' name='crtc' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='3343' column='1'/>
        <parameter type-id='type-id-487' name='fb' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='3344' column='1'/>
        <parameter type-id='type-id-485' name='event' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='3345' column='1'/>
        <parameter type-id='type-id-488' name='flags' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='3346' column='1'/>
        <parameter type-id='type-id-489' name='ctx' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='3347' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='drm_atomic_helper_connector_reset' mangled-name='drm_atomic_helper_connector_reset' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='3726' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_atomic_helper_connector_reset'>
        <parameter type-id='type-id-475' name='connector' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='3726' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='drm_atomic_helper_connector_duplicate_state' mangled-name='drm_atomic_helper_connector_duplicate_state' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='3769' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_atomic_helper_connector_duplicate_state'>
        <parameter type-id='type-id-475' name='connector' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='3769' column='1'/>
        <return type-id='type-id-491'/>
      </function-decl>
      <function-decl name='drm_atomic_helper_connector_destroy_state' mangled-name='drm_atomic_helper_connector_destroy_state' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='3898' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_atomic_helper_connector_destroy_state'>
        <parameter type-id='type-id-475' name='connector' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='3898' column='1'/>
        <parameter type-id='type-id-491' name='state' filepath='drivers/gpu/drm/drm_atomic_helper.c' line='3899' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/gpu/drm/drm_bufs.c' language='LANG_C89'>
      <class-decl name='drm_hash_item' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/drm/drm_hashtab.h' line='42' column='1' id='type-id-492'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='head' type-id='type-id-268' visibility='default' filepath='include/drm/drm_hashtab.h' line='43' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='key' type-id='type-id-92' visibility='default' filepath='include/drm/drm_hashtab.h' line='44' column='1'/>
        </data-member>
      </class-decl>
      <pointer-type-def type-id='type-id-492' size-in-bits='64' id='type-id-493'/>
      <pointer-type-def type-id='type-id-494' size-in-bits='64' id='type-id-495'/>
      <function-decl name='drm_ht_insert_item' mangled-name='drm_ht_insert_item' filepath='include/drm/drm_hashtab.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_ht_insert_item'>
        <parameter type-id='type-id-495'/>
        <parameter type-id='type-id-493'/>
        <return type-id='type-id-12'/>
      </function-decl>
      <function-decl name='drm_ht_just_insert_please' mangled-name='drm_ht_just_insert_please' filepath='include/drm/drm_hashtab.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_ht_just_insert_please'>
        <parameter type-id='type-id-495'/>
        <parameter type-id='type-id-493'/>
        <parameter type-id='type-id-92'/>
        <parameter type-id='type-id-12'/>
        <parameter type-id='type-id-12'/>
        <parameter type-id='type-id-92'/>
        <return type-id='type-id-12'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/gpu/drm/drm_cache.c' language='LANG_C89'>
      <function-decl name='drm_clflush_pages' mangled-name='drm_clflush_pages' filepath='drivers/gpu/drm/drm_cache.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_clflush_pages'>
        <parameter type-id='type-id-140' name='pages' filepath='drivers/gpu/drm/drm_cache.c' line='81' column='1'/>
        <parameter type-id='type-id-92' name='num_pages' filepath='drivers/gpu/drm/drm_cache.c' line='81' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/gpu/drm/drm_connector.c' language='LANG_C89'>
      <function-decl name='drm_connector_attach_edid_property' mangled-name='drm_connector_attach_edid_property' filepath='include/drm/drm_connector.h' line='1086' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_connector_attach_edid_property'>
        <parameter type-id='type-id-475'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='drm_connector_unregister' mangled-name='drm_connector_unregister' filepath='include/drm/drm_connector.h' line='1088' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_connector_unregister'>
        <parameter type-id='type-id-475'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='drm_connector_cleanup' mangled-name='drm_connector_cleanup' filepath='drivers/gpu/drm/drm_connector.c' line='387' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_connector_cleanup'>
        <parameter type-id='type-id-475' name='connector' filepath='drivers/gpu/drm/drm_connector.c' line='387' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='drm_connector_register' mangled-name='drm_connector_register' filepath='drivers/gpu/drm/drm_connector.c' line='444' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_connector_register'>
        <parameter type-id='type-id-475' name='connector' filepath='drivers/gpu/drm/drm_connector.c' line='444' column='1'/>
        <return type-id='type-id-12'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/gpu/drm/drm_crtc.c' language='LANG_C89'>
      <class-decl name='drm_encoder' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-496'/>
      <union-decl name='__anonymous_union__1' size-in-bits='256' is-anonymous='yes' visibility='default' filepath='include/drm/drm_vblank.h' line='57' column='1' id='type-id-497'>
        <data-member access='private'>
          <var-decl name='base' type-id='type-id-498' visibility='default' filepath='include/drm/drm_vblank.h' line='61' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='vbl' type-id='type-id-499' visibility='default' filepath='include/drm/drm_vblank.h' line='71' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='seq' type-id='type-id-500' visibility='default' filepath='include/drm/drm_vblank.h' line='76' column='1'/>
        </data-member>
      </union-decl>
      <pointer-type-def type-id='type-id-496' size-in-bits='64' id='type-id-501'/>
      <pointer-type-def type-id='type-id-502' size-in-bits='64' id='type-id-503'/>
      <function-decl name='dma_fence_init' mangled-name='dma_fence_init' filepath='include/linux/dma-fence.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dma_fence_init'>
        <parameter type-id='type-id-450'/>
        <parameter type-id='type-id-504'/>
        <parameter type-id='type-id-503'/>
        <parameter type-id='type-id-137'/>
        <parameter type-id='type-id-11'/>
        <return type-id='type-id-74'/>
      </function-decl>
      <function-decl name='dma_fence_context_alloc' mangled-name='dma_fence_context_alloc' filepath='include/linux/dma-fence.h' line='544' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dma_fence_context_alloc'>
        <parameter type-id='type-id-11'/>
        <return type-id='type-id-137'/>
      </function-decl>
      <function-decl name='drm_crtc_cleanup' mangled-name='drm_crtc_cleanup' filepath='drivers/gpu/drm/drm_crtc.c' line='354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='drm_crtc_cleanup'>
        <parameter type-id='type-id-484' name='crtc' filepath='drivers/gpu/drm/drm_crtc.c' line='354' column='1'/>
        <return type-id='type-id-74'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/gpu/drm/drm_crtc_helper.c' language='LANG_C89'>


      <array-type-def dimensions='1' type-id='type-id-505' size-in-bits='256' id='type-id-506'>
        <subrange length='4' type-id='type-id-6' id='type-id-160'/>

      </array-type-def>
      <array-type-def dimensions='1' type-id='type-id-507' size-in-bits='112' id='type-id-508'>
        <subrange length='14' type-id='type-id-6' id='type-id-509'/>

      </array-type-def>
      <array-type-def dimensions='1' type-id='type-id-507' size-in-bits='32' id='type-id-510'>
        <subrange length='4' type-id='type-id-6' id='type-id-160'/>

      </array-type-def>
      <array-type-def dimensions='1' type-id='type-id-177' size-in-bits='16' id='type-id-511'>
        <subrange length='2' type-id='type-id-6' id='type-id-237'/>

      </array-type-def>
      <array-type-def dimensions='1' type-id='type-id-351' size-in-bits='480' id='type-id-512'>
        <subrange length='60' type-id='type-id-6' id='type-id-513'/>

      </array-type-def>
      <class-decl name='__va_list' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-514'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='__stack' type-id='type-id-4' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='__gr_top' type-id='type-id-4' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='__vr_top' type-id='type-id-4' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='__gr_offs' type-id='type-id-12' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='224'>
          <var-decl name='__vr_offs' type-id='type-id-12' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='agp_bridge_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-515'/>
      <class-decl name='dma_buf' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-516'/>
      <class-decl name='dma_buf_attachment' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-517'/>
      <class-decl name='drm_device_dma' size-in-bits='7744' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-518'/>
      <class-decl name='drm_gem_object' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-519'/>
      <class-decl name='drm_local_map' size-in-bits='320' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-520'/>
      <class-decl name='drm_master' size-in-bits='1792' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-521'/>
      <class-decl name='drm_sg_mem' size-in-bits='320' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-522'/>
      <class-decl name='drm_vma_offset_manager' size-in-bits='1920' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-523'/>
      <class-decl name='drm_writeback_job' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-524'/>
      <class-decl name='irq_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-525'/>
      <class-decl name='irq_domain_chip_generic' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-526'/>
      <class-decl name='reservation_object' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-527'/>
      <array-type-def dimensions='1' type-id='type-id-528' size-in-bits='256' id='type-id-529'>
        <subrange length='4' type-id='type-id-6' id='type-id-160'/>

      </array-type-def>
      <array-type-def dimensions='1' type-id='type-id-530' size-in-bits='1536' id='type-id-531'>
        <subrange length='24' type-id='type-id-6' id='type-id-532'/>

      </array-type-def>
      <typedef-decl name='__builtin_va_list' type-id='type-id-514' id='type-id-533'/>
      <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='544' id='type-id-534'>
        <subrange length='17' type-id='type-id-6' id='type-id-535'/>

      </array-type-def>
      <array-type-def dimensions='1' type-id='type-id-488' size-in-bits='320' id='type-id-536'>
        <subrange length='10' type-id='type-id-6' id='type-id-537'/>

      </array-type-def>
      <array-type-def dimensions='1' type-id='type-id-488' size-in-bits='96' id='type-id-538'>
        <subrange length='3' type-id='type-id-6' id='type-id-240'/>

      </array-type-def>
      <array-type-def dimensions='1' type-id='type-id-539' size-in-bits='1536' id='type-id-540'>
        <subrange length='24' type-id='type-id-6' id='type-id-532'/>

      </array-type-def>
      <array-type-def dimensions='1' type-id='type-id-541' size-in-bits='1024' id='type-id-542'>
        <subrange length='128' type-id='type-id-6' id='type-id-543'/>

      </array-type-def>
      <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='128' id='type-id-544'>
        <subrange length='4' type-id='type-id-6' id='type-id-160'/>

      </array-type-def>
      <class-decl name='drm_crtc' size-in-bits='9792' is-struct='yes' visibility='default' filepath='include/drm/drm_crtc.h' line='816' column='1' id='type-id-545'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='dev' type-id='type-id-474' visibility='default' filepath='include/drm/drm_crtc.h' line='818' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='port' type-id='type-id-546' visibility='default' filepath='include/drm/drm_crtc.h' line='820' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='head' type-id='type-id-9' visibility='default' filepath='include/drm/drm_crtc.h' line='828' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='name' type-id='type-id-182' visibility='default' filepath='include/drm/drm_crtc.h' line='831' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='mutex' type-id='type-id-547' visibility='default' filepath='include/drm/drm_crtc.h' line='843' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='base' type-id='type-id-548' visibility='default' filepath='include/drm/drm_crtc.h' line='846' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='primary' type-id='type-id-486' visibility='default' filepath='include/drm/drm_crtc.h' line='855' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='cursor' type-id='type-id-486' visibility='default' filepath='include/drm/drm_crtc.h' line='864' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='index' type-id='type-id-11' visibility='default' filepath='include/drm/drm_crtc.h' line='870' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1184'>
          <var-decl name='cursor_x' type-id='type-id-12' visibility='default' filepath='include/drm/drm_crtc.h' line='879' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='cursor_y' type-id='type-id-12' visibility='default' filepath='include/drm/drm_crtc.h' line='887' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1248'>
          <var-decl name='enabled' type-id='type-id-177' visibility='default' filepath='include/drm/drm_crtc.h' line='897' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='mode' type-id='type-id-549' visibility='default' filepath='include/drm/drm_crtc.h' line='907' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3200'>
          <var-decl name='hwmode' type-id='type-id-549' visibility='default' filepath='include/drm/drm_crtc.h' line='922' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5120'>
          <var-decl name='x' type-id='type-id-12' visibility='default' filepath='include/drm/drm_crtc.h' line='931' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5152'>
          <var-decl name='y' type-id='type-id-12' visibility='default' filepath='include/drm/drm_crtc.h' line='939' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5184'>
          <var-decl name='funcs' type-id='type-id-550' visibility='default' filepath='include/drm/drm_crtc.h' line='942' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5248'>
          <var-decl name='gamma_size' type-id='type-id-488' visibility='default' filepath='include/drm/drm_crtc.h' line='948' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5312'>
          <var-decl name='gamma_store' type-id='type-id-551' visibility='default' filepath='include/drm/drm_crtc.h' line='954' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5376'>
          <var-decl name='helper_private' type-id='type-id-552' visibility='default' filepath='include/drm/drm_crtc.h' line='957' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5440'>
          <var-decl name='properties' type-id='type-id-553' visibility='default' filepath='include/drm/drm_crtc.h' line='960' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8576'>
          <var-decl name='state' type-id='type-id-554' visibility='default' filepath='include/drm/drm_crtc.h' line='975' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8640'>
          <var-decl name='commit_list' type-id='type-id-9' visibility='default' filepath='include/drm/drm_crtc.h' line='992' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8768'>
          <var-decl name='commit_lock' type-id='type-id-96' visibility='default' filepath='include/drm/drm_crtc.h' line='999' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8832'>
          <var-decl name='crc' type-id='type-id-555' visibility='default' filepath='include/drm/drm_crtc.h' line='1015' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9408'>
          <var-decl name='fence_context' type-id='type-id-11' visibility='default' filepath='include/drm/drm_crtc.h' line='1022' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9440'>
          <var-decl name='fence_lock' type-id='type-id-96' visibility='default' filepath='include/drm/drm_crtc.h' line='1029' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9472'>
          <var-decl name='fence_seqno' type-id='type-id-92' visibility='default' filepath='include/drm/drm_crtc.h' line='1036' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9536'>
          <var-decl name='timeline_name' type-id='type-id-478' visibility='default' filepath='include/drm/drm_crtc.h' line='1043' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='drm_device' size-in-bits='13312' is-struct='yes' visibility='default' filepath='include/drm/drm_device.h' line='31' column='1' id='type-id-556'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='legacy_dev_list' type-id='type-id-9' visibility='default' filepath='include/drm/drm_device.h' line='32' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='if_version' type-id='type-id-12' visibility='default' filepath='include/drm/drm_device.h' line='33' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='ref' type-id='type-id-402' visibility='default' filepath='include/drm/drm_device.h' line='37' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='dev' type-id='type-id-143' visibility='default' filepath='include/drm/drm_device.h' line='38' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='driver' type-id='type-id-557' visibility='default' filepath='include/drm/drm_device.h' line='39' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='dev_private' type-id='type-id-4' visibility='default' filepath='include/drm/drm_device.h' line='40' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='primary' type-id='type-id-558' visibility='default' filepath='include/drm/drm_device.h' line='41' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='render' type-id='type-id-558' visibility='default' filepath='include/drm/drm_device.h' line='42' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='registered' type-id='type-id-177' visibility='default' filepath='include/drm/drm_device.h' line='43' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='master' type-id='type-id-559' visibility='default' filepath='include/drm/drm_device.h' line='46' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='unplugged' type-id='type-id-177' visibility='default' filepath='include/drm/drm_device.h' line='54' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='anon_inode' type-id='type-id-560' visibility='default' filepath='include/drm/drm_device.h' line='56' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='unique' type-id='type-id-182' visibility='default' filepath='include/drm/drm_device.h' line='57' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='struct_mutex' type-id='type-id-280' visibility='default' filepath='include/drm/drm_device.h' line='62' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='master_mutex' type-id='type-id-280' visibility='default' filepath='include/drm/drm_device.h' line='63' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='open_count' type-id='type-id-12' visibility='default' filepath='include/drm/drm_device.h' line='68' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1376'>
          <var-decl name='buf_lock' type-id='type-id-96' visibility='default' filepath='include/drm/drm_device.h' line='69' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='buf_use' type-id='type-id-12' visibility='default' filepath='include/drm/drm_device.h' line='70' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1440'>
          <var-decl name='buf_alloc' type-id='type-id-94' visibility='default' filepath='include/drm/drm_device.h' line='71' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='filelist_mutex' type-id='type-id-280' visibility='default' filepath='include/drm/drm_device.h' line='74' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1728'>
          <var-decl name='filelist' type-id='type-id-9' visibility='default' filepath='include/drm/drm_device.h' line='75' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1856'>
          <var-decl name='filelist_internal' type-id='type-id-9' visibility='default' filepath='include/drm/drm_device.h' line='82' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='clientlist_mutex' type-id='type-id-280' visibility='default' filepath='include/drm/drm_device.h' line='89' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2240'>
          <var-decl name='clientlist' type-id='type-id-9' visibility='default' filepath='include/drm/drm_device.h' line='96' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2368'>
          <var-decl name='maplist' type-id='type-id-9' visibility='default' filepath='include/drm/drm_device.h' line='100' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2496'>
          <var-decl name='map_hash' type-id='type-id-494' visibility='default' filepath='include/drm/drm_device.h' line='101' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2624'>
          <var-decl name='ctxlist' type-id='type-id-9' visibility='default' filepath='include/drm/drm_device.h' line='105' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2752'>
          <var-decl name='ctxlist_mutex' type-id='type-id-280' visibility='default' filepath='include/drm/drm_device.h' line='106' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3008'>
          <var-decl name='ctx_idr' type-id='type-id-561' visibility='default' filepath='include/drm/drm_device.h' line='108' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3200'>
          <var-decl name='vmalist' type-id='type-id-9' visibility='default' filepath='include/drm/drm_device.h' line='110' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3328'>
          <var-decl name='dma' type-id='type-id-562' visibility='default' filepath='include/drm/drm_device.h' line='116' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3392'>
          <var-decl name='context_flag' type-id='type-id-563' visibility='default' filepath='include/drm/drm_device.h' line='122' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3456'>
          <var-decl name='last_context' type-id='type-id-12' visibility='default' filepath='include/drm/drm_device.h' line='123' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3488'>
          <var-decl name='irq_enabled' type-id='type-id-177' visibility='default' filepath='include/drm/drm_device.h' line='133' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3520'>
          <var-decl name='irq' type-id='type-id-12' visibility='default' filepath='include/drm/drm_device.h' line='134' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3552'>
          <var-decl name='vblank_disable_immediate' type-id='type-id-177' visibility='default' filepath='include/drm/drm_device.h' line='149' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3584'>
          <var-decl name='vblank' type-id='type-id-564' visibility='default' filepath='include/drm/drm_device.h' line='159' column='1'/>
