share/man/man4/man4.hppa/astro.4
.\"	$OpenBSD: astro.4,v 1.3 2007/05/31 19:19:54 jmc Exp $
.\"
.\" Copyright (c) 2007 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt ASTRO 4 hppa
.Os
.Sh NAME
.Nm astro
.Nd Astro Memory and I/O controller
.Sh SYNOPSIS
.Cd "astro* at mainbus?"
.Cd "elroy* at astro?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Astro memory and I/O controller used
on systems with PA-8500 and later 64-bit CPUs.
It functions as a bridge from the Runway bus to
up to 8 I/O ropes that connect to Elroy chips.
Astro contains an IOMMU and provides support for cache coherent DMA.
.Sh SEE ALSO
.Xr cpu 4 ,
.Xr elroy 4 ,
.Xr intro 4 ,
.Xr runway 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.2 .
