share/man/man4/man4.hppa/phantomas.4
.\"	$OpenBSD: phantomas.4,v 1.10 2020/12/22 10:33:34 tobias Exp $
.\"
.\" Copyright (c) 2002 Michael Shalayeff
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF MIND,
.\" USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: December 22 2020 $
.Dt PHANTOMAS 4 hppa
.Os
.Sh NAME
.Nm phantomas
.Nd Phantom PseudoBC GSC+ Port
.Sh SYNOPSIS
.Cd "phantomas0 at mainbus?"
.Cd "dino* at phantomas?"
.Cd "lasi* at phantomas?"
.Cd "sti* at phantomas?"
.Cd "wax* at phantomas?"
.Sh DESCRIPTION
The Phantom bus converter is used to connect
various devices and controllers
to the system bus,
where the processor
and memory are located.
Currently the following are connected:
the
.Xr sti 4
graphics interface;
the
.Xr lasi 4
and
.Xr wax 4
bus host adapters for
.Xr gsc 4 ;
and the
.Xr dino 4
PCI bridge.
.Sh SEE ALSO
.Xr dino 4 ,
.Xr gsc 4 ,
.Xr intro 4 ,
.Xr lasi 4 ,
.Xr sti 4 ,
.Xr wax 4
.Sh HISTORY
The
.Nm
driver
appeared in
.Ox 3.3 .
