/*-
 * SPDX-License-Identifier: BSD-2-Clause-FreeBSD
 *
 * Copyright (c) 2004-2005 HighPoint Technologies, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 *
 * $FreeBSD$
 */

#ifndef HPT_INTF_H
#define HPT_INTF_H
#pragma pack(1)


#define HPT_IOCTL_SET_ARRAY_STATE           HPT_CTL_CODE(15)
#define HPT_IOCTL_SET_ARRAY_INFO            HPT_CTL_CODE(16)
#define HPT_IOCTL_SET_DEVICE_INFO           HPT_CTL_CODE(17)
#define HPT_IOCTL_RESCAN_DEVICES            HPT_CTL_CODE(18)
#define HPT_IOCTL_GET_DRIVER_CAPABILITIES   HPT_CTL_CODE(19)
#define HPT_IOCTL_GET_601_INFO              HPT_CTL_CODE(20)
#define HPT_IOCTL_SET_601_INFO              HPT_CTL_CODE(21)
#define HPT_IOCTL_LOCK_DEVICE               HPT_CTL_CODE(22)
#define HPT_IOCTL_UNLOCK_DEVICE             HPT_CTL_CODE(23)
#define HPT_IOCTL_IDE_PASS_THROUGH          HPT_CTL_CODE(24)
#define HPT_IOCTL_VERIFY_DATA_BLOCK         HPT_CTL_CODE(25)
#define HPT_IOCTL_INITIALIZE_DATA_BLOCK     HPT_CTL_CODE(26)
#define HPT_IOCTL_ADD_DEDICATED_SPARE       HPT_CTL_CODE(27)
#define HPT_IOCTL_DEVICE_IO_EX              HPT_CTL_CODE(28)
#define HPT_IOCTL_SET_BOOT_MARK             HPT_CTL_CODE(29)
#define HPT_IOCTL_QUERY_REMOVE              HPT_CTL_CODE(30)
#define HPT_IOCTL_REMOVE_DEVICES            HPT_CTL_CODE(31)
#define HPT_IOCTL_CREATE_ARRAY_V2           HPT_CTL_CODE(32)
#define HPT_IOCTL_GET_DEVICE_INFO_V2        HPT_CTL_CODE(33)
#define HPT_IOCTL_SET_DEVICE_INFO_V2        HPT_CTL_CODE(34)
#define HPT_IOCTL_REBUILD_DATA_BLOCK_V2     HPT_CTL_CODE(35)
#define HPT_IOCTL_VERIFY_DATA_BLOCK_V2      HPT_CTL_CODE(36)
#define HPT_IOCTL_INITIALIZE_DATA_BLOCK_V2  HPT_CTL_CODE(37)
#define HPT_IOCTL_LOCK_DEVICE_V2            HPT_CTL_CODE(38)
#define HPT_IOCTL_DEVICE_IO_V2              HPT_CTL_CODE(39)
#define HPT_IOCTL_DEVICE_IO_EX_V2           HPT_CTL_CODE(40)

#define HPT_IOCTL_I2C_TRANSACTION           HPT_CTL_CODE(48)
#define HPT_IOCTL_GET_PARAMETER_LIST        HPT_CTL_CODE(49)
#define HPT_IOCTL_GET_PARAMETER             HPT_CTL_CODE(50)
#define HPT_IOCTL_SET_PARAMETER             HPT_CTL_CODE(51)

/* Windows only */
#define HPT_IOCTL_GET_CONTROLLER_IDS        HPT_CTL_CODE(100)
#define HPT_IOCTL_GET_DCB                   HPT_CTL_CODE(101)
#define	HPT_IOCTL_EPROM_IO                  HPT_CTL_CODE(102)
#define	HPT_IOCTL_GET_CONTROLLER_VENID      HPT_CTL_CODE(103)

/************************************************************************
 * shared data structures
 ************************************************************************/

/*
 * Chip Type
 */
#define CHIP_TYPE_HPT366      1
#define CHIP_TYPE_HPT368      2
#define CHIP_TYPE_HPT370      3
#define CHIP_TYPE_HPT370A     4
#define CHIP_TYPE_HPT370B     5
#define CHIP_TYPE_HPT374      6
#define CHIP_TYPE_HPT372      7
#define CHIP_TYPE_HPT372A     8
#define CHIP_TYPE_HPT302      9
#define CHIP_TYPE_HPT371      10
#define CHIP_TYPE_HPT372N     11
#define CHIP_TYPE_HPT302N     12
#define CHIP_TYPE_HPT371N     13
#define CHIP_TYPE_SI3112A     14
#define CHIP_TYPE_ICH5        15
#define CHIP_TYPE_ICH5R       16

/*
 * Chip Flags
 */
#define CHIP_SUPPORT_ULTRA_66   0x20
#define CHIP_SUPPORT_ULTRA_100  0x40
#define CHIP_HPT3XX_DPLL_MODE   0x80
#define CHIP_SUPPORT_ULTRA_133  0x01
#define CHIP_SUPPORT_ULTRA_150  0x02

typedef struct _DRIVER_CAPABILITIES {
	DWORD dwSize;

	UCHAR MaximumControllers;           /* maximum controllers the driver can support */
	UCHAR SupportCrossControllerRAID;   /* 1-support, 0-not support */
	UCHAR MinimumBlockSizeShift;        /* minimum block size shift */
	UCHAR MaximumBlockSizeShift;        /* maximum block size shift */

	UCHAR SupportDiskModeSetting;
	UCHAR SupportSparePool;
	UCHAR MaximumArrayNameLength;
	/* only one byte left here! */
#ifdef __BIG_ENDIAN_BITFIELD
	UCHAR reserved: 4;
	UCHAR SupportHotSwap: 1;
	UCHAR HighPerformanceRAID1: 1;
	UCHAR RebuildProcessInDriver: 1;
	UCHAR SupportDedicatedSpare: 1;
#else 
	UCHAR SupportDedicatedSpare: 1; /* call hpt_add_dedicated_spare() for dedicated spare. */
	UCHAR RebuildProcessInDriver: 1; /* Windows only. used by mid layer for rebuild control. */
	UCHAR HighPerformanceRAID1: 1; /* Support RAID1.5 */
	UCHAR SupportHotSwap: 1;
	UCHAR reserved: 4;
#endif

	/* SupportedRAIDTypes is an array of bytes, one of each is an array type.
	 * Only non-zero values is valid. Bit0-3 represents the lower(child) level RAID type;
	 * bit4-7 represents the top level. i.e.
	 *     RAID 0/1 is (AT_RAID1<<4) | AT_RAID0
	 *     RAID 5/0 is (AT_RAID0<<4) | AT_RAID5
	 */
	UCHAR SupportedRAIDTypes[16];
	/* maximum members in an array corresponding to SupportedRAIDTypes */
	UCHAR MaximumArrayMembers[16];
}
DRIVER_CAPABILITIES, *PDRIVER_CAPABILITIES;

/*
 * Controller information.
 */
typedef struct _CONTROLLER_INFO {
	UCHAR ChipType;                     /* chip type */
	UCHAR InterruptLevel;               /* IRQ level */
	UCHAR NumBuses;                     /* bus count */
	UCHAR ChipFlags;

	UCHAR szProductID[MAX_NAME_LENGTH]; /* product name */
	UCHAR szVendorID[MAX_NAME_LENGTH];  /* vender name */

} CONTROLLER_INFO, *PCONTROLLER_INFO;

/*
 * Channel information.
 */
typedef struct _CHANNEL_INFO {
	ULONG       IoPort;         /* IDE Base Port Address */
	ULONG       ControlPort;    /* IDE Control Port Address */

	DEVICEID    Devices[2];     /* device connected to this channel */

} CHANNEL_INFO, *PCHANNEL_INFO;

/*
 * time represented in DWORD format
 */
#ifndef __KERNEL__
typedef struct _TIME_RECORD {
   UINT        seconds:6;      /* 0 - 59 */
   UINT        minutes:6;      /* 0 - 59 */
   UINT        month:4;        /* 1 - 12 */
   UINT        hours:6;        /* 0 - 59 */
   UINT        day:5;          /* 1 - 31 */
   UINT        year:5;         /* 0=2000, 31=2031 */
} TIME_RECORD;
#endif

/*
 * Array information.
 */
typedef struct _HPT_ARRAY_INFO {
	UCHAR       Name[MAX_ARRAYNAME_LEN];/* array name */
	UCHAR       Description[64];        /* array description */
	UCHAR       CreateManager[16];      /* who created it */
	TIME_RECORD CreateTime;             /* when created it */

	UCHAR       ArrayType;              /* array type */
	UCHAR       BlockSizeShift;         /* stripe size */
	UCHAR       nDisk;                  /* member count: Number of ID in Members[] */
	UCHAR       reserved;

	DWORD       Flags;                  /* working flags, see ARRAY_FLAG_XXX */
	DWORD       Members[MAX_ARRAY_MEMBERS_V1];  /* member array/disks */

	/*
	 * rebuilding progress, xx.xx% = sprintf(s, "%.2f%%", RebuildingProgress/100.0);
	 * only valid if rebuilding is done by driver code.
	 * Member Flags will have ARRAY_FLAG_REBUILDING set at this case.
	 * Verify operation use same fields below, the only difference is
	 * ARRAY_FLAG_VERIFYING is set.
	 */
	DWORD       RebuildingProgress;
	DWORD       RebuiltSectors; /* rebuilding point (LBA) for single member */

} HPT_ARRAY_INFO, *PHPT_ARRAY_INFO;  /*LDX modify ARRAY_INFO TO HPT_ARRAY_INFO to avoid compiling error in Windows*/

#if HPT_INTERFACE_VERSION>=0x01010000
typedef struct _LBA64 {
#ifdef __BIG_ENDIAN_BITFIELD
	DWORD hi32;
	DWORD lo32;
#else 
	DWORD lo32;
	DWORD hi32;
#endif
}
LBA64;
typedef struct _HPT_ARRAY_INFO_V2 {
	UCHAR       Name[MAX_ARRAYNAME_LEN];/* array name */
	UCHAR       Description[64];        /* array description */
	UCHAR       CreateManager[16];      /* who created it */
	TIME_RECORD CreateTime;             /* when created it */

	UCHAR       ArrayType;              /* array type */
	UCHAR       BlockSizeShift;         /* stripe size */
	UCHAR       nDisk;                  /* member count: Number of ID in Members[] */
	UCHAR       reserved;

	DWORD       Flags;                  /* working flags, see ARRAY_FLAG_XXX */
	DWORD       Members[MAX_ARRAY_MEMBERS_V2];  /* member array/disks */

	DWORD       RebuildingProgress;
	LBA64       RebuiltSectors; /* rebuilding point (LBA) for single member */
	
	DWORD       reserve4[4];

} HPT_ARRAY_INFO_V2, *PHPT_ARRAY_INFO_V2;
#endif

/*
 * ATA/ATAPI Device identify data without the Reserved4.
 */
#ifndef __KERNEL__
typedef struct _IDENTIFY_DATA2 {
	USHORT GeneralConfiguration;            /* 00 00 */
	USHORT NumberOfCylinders;               /* 02  1 */
	USHORT Reserved1;                       /* 04  2 */
	USHORT NumberOfHeads;                   /* 06  3 */
	USHORT UnformattedBytesPerTrack;        /* 08  4 */
	USHORT UnformattedBytesPerSector;       /* 0A  5 */
	USHORT SectorsPerTrack;                 /* 0C  6 */
	USHORT VendorUnique1[3];                /* 0E  7-9 */
	USHORT SerialNumber[10];                /* 14  10-19 */
	USHORT BufferType;                      /* 28  20 */
	USHORT BufferSectorSize;                /* 2A  21 */
	USHORT NumberOfEccBytes;                /* 2C  22 */
	USHORT FirmwareRevision[4];             /* 2E  23-26 */
	USHORT ModelNumber[20];                 /* 36  27-46 */
	UCHAR  MaximumBlockTransfer;            /* 5E  47 */
	UCHAR  VendorUnique2;                   /* 5F */
	USHORT DoubleWordIo;                    /* 60  48 */
	USHORT Capabilities;                    /* 62  49 */
	USHORT Reserved2;                       /* 64  50 */
	UCHAR  VendorUnique3;                   /* 66  51 */
	UCHAR  PioCycleTimingMode;              /* 67 */
	UCHAR  VendorUnique4;                   /* 68  52 */
	UCHAR  DmaCycleTimingMode;              /* 69 */
	USHORT TranslationFieldsValid:1;        /* 6A  53 */
	USHORT Reserved3:15;
	USHORT NumberOfCurrentCylinders;        /* 6C  54 */
	USHORT NumberOfCurrentHeads;            /* 6E  55 */
	USHORT CurrentSectorsPerTrack;          /* 70  56 */
	ULONG  CurrentSectorCapacity;           /* 72  57-58 */
	USHORT CurrentMultiSectorSetting;       /*     59 */
	ULONG  UserAddressableSectors;          /*     60-61 */
	USHORT SingleWordDMASupport : 8;        /*     62 */
	USHORT SingleWordDMAActive : 8;
	USHORT MultiWordDMASupport : 8;         /*     63 */
	USHORT MultiWordDMAActive : 8;
	USHORT AdvancedPIOModes : 8;            /*     64 */
	USHORT Reserved4 : 8;
	USHORT MinimumMWXferCycleTime;          /*     65 */
	USHORT RecommendedMWXferCycleTime;      /*     66 */
	USHORT MinimumPIOCycleTime;             /*     67 */
	USHORT MinimumPIOCycleTimeIORDY;        /*     68 */
	USHORT Reserved5[2];                    /*     69-70 */
	USHORT ReleaseTimeOverlapped;           /*     71 */
	USHORT ReleaseTimeServiceCommand;       /*     72 */
	USHORT MajorRevision;                   /*     73 */
	USHORT MinorRevision;                   /*     74 */
/*    USHORT Reserved6[14];                   //     75-88 */
} IDENTIFY_DATA2, *PIDENTIFY_DATA2;
#endif

/*
 * physical device information.
 * IdentifyData.ModelNumber[] is byte-swapped from the original identify data.
 */
typedef struct _DEVICE_INFO {
	UCHAR   ControllerId;           /* controller id */
	UCHAR   PathId;                 /* bus */
	UCHAR   TargetId;               /* id */
	UCHAR   DeviceModeSetting;      /* Current Data Transfer mode: 0-4 PIO 0-4 */
									/* 5-7 MW DMA0-2, 8-13 UDMA0-5             */
	UCHAR   DeviceType;             /* device type */
	UCHAR   UsableMode;             /* highest usable mode */
	
	UCHAR   ReadAheadSupported: 1;
	UCHAR   ReadAheadEnabled: 1;
	UCHAR   WriteCacheSupported: 1;
	UCHAR   WriteCacheEnabled: 1;
	UCHAR   TCQSupported: 1;
	UCHAR   TCQEnabled: 1;
	UCHAR   NCQSupported: 1;
	UCHAR   NCQEnabled: 1;
	UCHAR   reserved;

	DWORD   Flags;                  /* working flags, see DEVICE_FLAG_XXX */

	IDENTIFY_DATA2 IdentifyData;    /* Identify Data of this device */

} DEVICE_INFO, *PDEVICE_INFO;

/*
 * HPT601 information
 */
#define HPT601_INFO_DEVICEID      1
#define HPT601_INFO_TEMPERATURE   2
#define HPT601_INFO_FANSTATUS     4
#define HPT601_INFO_BEEPERCONTROL 8
#define HPT601_INFO_LED1CONTROL   0x10
#define HPT601_INFO_LED2CONTROL   0x20
#define HPT601_INFO_POWERSTATUS   0x40

typedef struct _HPT601_INFO {
	WORD ValidFields;       /* mark valid fields below */
	WORD DeviceId;          /* 0x5A3E */
	WORD Temperature;       /* Read: temperature sensor value. Write: temperature limit */
	WORD FanStatus;         /* Fan status */
	WORD BeeperControl;     /* bit4: beeper control bit. bit0-3: frequency bits */
	WORD LED1Control;       /* bit4: twinkling control bit. bit0-3: frequency bits */
	WORD LED2Control;       /* bit4: twinkling control bit. bit0-3: frequency bits */
	WORD PowerStatus;       /* 1: has power 2: no power */
} HPT601_INFO, *PHPT601_INFO;

/*
 * Logical device information.
 * Union of ArrayInfo and DeviceInfo.
 * Common properties will be put in logical device information.
 */
typedef struct _LOGICAL_DEVICE_INFO {
	UCHAR       Type;                   /* LDT_ARRAY or LDT_DEVICE */
	UCHAR       reserved[3];

	DWORD       Capacity;               /* array capacity */
	DEVICEID    ParentArray;

	union {
		HPT_ARRAY_INFO array;
		DEVICE_INFO device;
	} u;

} LOGICAL_DEVICE_INFO, *PLOGICAL_DEVICE_INFO;

