usr.sbin/mksuncd/mksuncd.1
.\"	$OpenBSD: mksuncd.1,v 1.4 2011/12/25 18:22:01 schwarze Exp $
.\"
.\" Copyright (c) 2001 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: December 25 2011 $
.Dt MKSUNCD 1 sparc64
.Os
.Sh NAME
.Nm mksuncd
.Nd add a bootable UFS partition to a filesystem image
.Sh SYNOPSIS
.Nm mksuncd
.Ar partition-letter
.Ar isofile
.Ar ufsfile
.Sh DESCRIPTION
The
.Nm
utility adds the file
.Ar ufsfile
to the end of
.Ar isofile .
.Ar ufsfile
is assumed to be a bootable filesystem image and
.Ar isofile
is assumed to be something like an ISO 9660 filesystem.
A Sun-style disklabel is expected to already be present
at the beginning of
.Ar isofile ,
and
.Nm
will update that label so that the partition (a-h) given by
.Ar partition-letter
points to
.Ar ufsfile
within
.Ar isofile .
.Pp
Based on the label in
.Ar isofile ,
that file is padded so that added files are always on cylinder boundaries.
This is a requirement of the PROM.
.Sh BUGS
This program is not endian or type safe.
It makes several assumptions about both based on its
SPARC bias.
