/*
 * Copyright 2008-2012 Freescale Semiconductor Inc.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *     * Redistributions of source code must retain the above copyright
 *       notice, this list of conditions and the following disclaimer.
 *     * Redistributions in binary form must reproduce the above copyright
 *       notice, this list of conditions and the following disclaimer in the
 *       documentation and/or other materials provided with the distribution.
 *     * Neither the name of Freescale Semiconductor nor the
 *       names of its contributors may be used to endorse or promote products
 *       derived from this software without specific prior written permission.
 *
 *
 * ALTERNATIVELY, this software may be distributed under the terms of the
 * GNU General Public License ("GPL") as published by the Free Software
 * Foundation, either version 2 of that License or (at your option) any
 * later version.
 *
 * THIS SOFTWARE IS PROVIDED BY Freescale Semiconductor ``AS IS'' AND ANY
 * EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL Freescale Semiconductor BE LIABLE FOR ANY
 * DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES

#define IPGIFG_MIN_IFG_ENFORCEMENT_SHIFT	8

#define IPGIFG_NON_BACK_TO_BACK_IPG_1	0x7F000000
#define IPGIFG_NON_BACK_TO_BACK_IPG_2	0x007F0000
#define IPGIFG_MIN_IFG_ENFORCEMENT	0x0000FF00
#define IPGIFG_BACK_TO_BACK_IPG		0x0000007F

#define HAFDUP_ALT_BEB			0x00080000
#define HAFDUP_BP_NO_BACKOFF		0x00040000
#define HAFDUP_NO_BACKOFF		0x00020000
#define HAFDUP_EXCESS_DEFER		0x00010000
#define HAFDUP_COLLISION_WINDOW		0x000003ff

#define HAFDUP_ALTERNATE_BEB_TRUNCATION_SHIFT	20
#define HAFDUP_RETRANSMISSION_MAX_SHIFT		12
#define HAFDUP_RETRANSMISSION_MAX		0x0000f000

#define NUM_OF_HASH_REGS	8 /* Number of hash table registers */

/* CAR1/2 bits */
#define DTSEC_CAR1_TR64		0x80000000
#define DTSEC_CAR1_TR127	0x40000000
#define DTSEC_CAR1_TR255	0x20000000
#define DTSEC_CAR1_TR511	0x10000000
#define DTSEC_CAR1_TRK1		0x08000000
#define DTSEC_CAR1_TRMAX	0x04000000
#define DTSEC_CAR1_TRMGV	0x02000000

#define DTSEC_CAR1_RBYT		0x00010000
#define DTSEC_CAR1_RPKT		0x00008000
#define DTSEC_CAR1_RFCS		0x00004000
#define DTSEC_CAR1_RMCA		0x00002000
#define DTSEC_CAR1_RBCA		0x00001000
#define DTSEC_CAR1_RXCF		0x00000800
#define DTSEC_CAR1_RXPF		0x00000400
#define DTSEC_CAR1_RXUO		0x00000200
#define DTSEC_CAR1_RALN		0x00000100
#define DTSEC_CAR1_RFLR		0x00000080
#define DTSEC_CAR1_RCDE		0x00000040
#define DTSEC_CAR1_RCSE		0x00000020
#define DTSEC_CAR1_RUND		0x00000010
#define DTSEC_CAR1_ROVR		0x00000008
#define DTSEC_CAR1_RFRG		0x00000004
#define DTSEC_CAR1_RJBR		0x00000002
#define DTSEC_CAR1_RDRP		0x00000001

#define DTSEC_CAR2_TJBR		0x00080000
#define DTSEC_CAR2_TFCS		0x00040000
#define DTSEC_CAR2_TXCF		0x00020000
#define DTSEC_CAR2_TOVR		0x00010000
#define DTSEC_CAR2_TUND		0x00008000
#define DTSEC_CAR2_TFRG		0x00004000
#define DTSEC_CAR2_TBYT		0x00002000
#define DTSEC_CAR2_TPKT		0x00001000
#define DTSEC_CAR2_TMCA		0x00000800
#define DTSEC_CAR2_TBCA		0x00000400
#define DTSEC_CAR2_TXPF		0x00000200
#define DTSEC_CAR2_TDFR		0x00000100
#define DTSEC_CAR2_TEDF		0x00000080
#define DTSEC_CAR2_TSCL		0x00000040
#define DTSEC_CAR2_TMCL		0x00000020
#define DTSEC_CAR2_TLCL		0x00000010
#define DTSEC_CAR2_TXCL		0x00000008
#define DTSEC_CAR2_TNCL		0x00000004
#define DTSEC_CAR2_TDRP		0x00000001

#define CAM1_ERRORS_ONLY \
	(DTSEC_CAR1_RXPF | DTSEC_CAR1_RALN | DTSEC_CAR1_RFLR \
	| DTSEC_CAR1_RCDE | DTSEC_CAR1_RCSE | DTSEC_CAR1_RUND \
	| DTSEC_CAR1_ROVR | DTSEC_CAR1_RFRG | DTSEC_CAR1_RJBR \
	| DTSEC_CAR1_RDRP)

#define CAM2_ERRORS_ONLY (DTSEC_CAR2_TFCS | DTSEC_CAR2_TXPF | DTSEC_CAR2_TDRP)

/*
 * Group of dTSEC specific counters relating to the standard RMON MIB Group 1
 * (or Ethernet) statistics.
 */
#define CAM1_MIB_GRP_1 \
	(DTSEC_CAR1_RDRP | DTSEC_CAR1_RBYT | DTSEC_CAR1_RPKT | DTSEC_CAR1_RMCA\
	| DTSEC_CAR1_RBCA | DTSEC_CAR1_RALN | DTSEC_CAR1_RUND | DTSEC_CAR1_ROVR\
	| DTSEC_CAR1_RFRG | DTSEC_CAR1_RJBR \
	| DTSEC_CAR1_TR64 | DTSEC_CAR1_TR127 | DTSEC_CAR1_TR255 \
	| DTSEC_CAR1_TR511 | DTSEC_CAR1_TRMAX)

#define CAM2_MIB_GRP_1 (DTSEC_CAR2_TNCL | DTSEC_CAR2_TDRP)

/* memory map */

struct dtsec_regs {
	/* dTSEC General Control and Status Registers */
	uint32_t tsec_id;	/* 0x000 ETSEC_ID register */
	uint32_t tsec_id2;	/* 0x004 ETSEC_ID2 register */
	uint32_t ievent;	/* 0x008 Interrupt event register */
	uint32_t imask;		/* 0x00C Interrupt mask register */
	uint32_t reserved0010[1];
	uint32_t ecntrl;	/* 0x014 E control register */
	uint32_t ptv;		/* 0x018 Pause time value register */
	uint32_t tbipa;		/* 0x01C TBI PHY address register */
	uint32_t tmr_ctrl;	/* 0x020 Time-stamp Control register */
	uint32_t tmr_pevent;	/* 0x024 Time-stamp event register */
	uint32_t tmr_pemask;	/* 0x028 Timer event mask register */
	uint32_t reserved002c[5];
	uint32_t tctrl;		/* 0x040 Transmit control register */
	uint32_t reserved0044[3];
	uint32_t rctrl;		/* 0x050 Receive control register */
	uint32_t reserved0054[11];
	uint32_t igaddr[8]; 	/* 0x080-0x09C Individual/group address */
	uint32_t gaddr[8];	/* 0x0A0-0x0BC Group address registers 0-7 */
	uint32_t reserved00c0[16];
	uint32_t maccfg1;		/* 0x100 MAC configuration #1 */
	uint32_t maccfg2;		/* 0x104 MAC configuration #2 */
	uint32_t ipgifg;		/* 0x108 IPG/IFG */
	uint32_t hafdup;		/* 0x10C Half-duplex */
	uint32_t maxfrm;		/* 0x110 Maximum frame */
	uint32_t reserved0114[10];
	uint32_t ifstat;		/* 0x13C Interface status */
	uint32_t macstnaddr1;		/* 0x140 Station Address,part 1 */
	uint32_t macstnaddr2;		/* 0x144 Station Address,part 2  */
	struct {
	    uint32_t exact_match1; /* octets 1-4 */
	    uint32_t exact_match2; /* octets 5-6 */
	} macaddr[15];	/* 0x148-0x1BC mac exact match addresses 1-15 */
	uint32_t reserved01c0[16];
	uint32_t tr64;	/* 0x200 transmit and receive 64 byte frame counter */
	uint32_t tr127;	/* 0x204 transmit and receive 65 to 127 byte frame
			 * counter */
	uint32_t tr255;	/* 0x208 transmit and receive 128 to 255 byte frame
			 * counter */
	uint32_t tr511;	/* 0x20C transmit and receive 256 to 511 byte frame
			 * counter */
	uint32_t tr1k;	/* 0x210 transmit and receive 512 to 1023 byte frame
			 * counter */
	uint32_t trmax;	/* 0x214 transmit and receive 1024 to 1518 byte frame
			 * counter */
	uint32_t trmgv;	/* 0x218 transmit and receive 1519 to 1522 byte good
			 * VLAN frame count */
	uint32_t rbyt;	/* 0x21C receive byte counter */
	uint32_t rpkt;	/* 0x220 receive packet counter */
	uint32_t rfcs;	/* 0x224 receive FCS error counter */
	uint32_t rmca;	/* 0x228 RMCA receive multicast packet counter */
	uint32_t rbca;	/* 0x22C receive broadcast packet counter */
	uint32_t rxcf;	/* 0x230 receive control frame packet counter */
	uint32_t rxpf;	/* 0x234 receive pause frame packet counter */
	uint32_t rxuo;	/* 0x238 receive unknown OP code counter */
	uint32_t raln;	/* 0x23C receive alignment error counter */
	uint32_t rflr;	/* 0x240 receive frame length error counter */
	uint32_t rcde;	/* 0x244 receive code error counter */
	uint32_t rcse;	/* 0x248 receive carrier sense error counter */
	uint32_t rund;	/* 0x24C receive undersize packet counter */
	uint32_t rovr;	/* 0x250 receive oversize packet counter */
	uint32_t rfrg;	/* 0x254 receive fragments counter */
	uint32_t rjbr;	/* 0x258 receive jabber counter */
	uint32_t rdrp;	/* 0x25C receive drop */
	uint32_t tbyt;	/* 0x260 transmit byte counter */
	uint32_t tpkt;	/* 0x264 transmit packet counter */
	uint32_t tmca;	/* 0x268 transmit multicast packet counter */
	uint32_t tbca;	/* 0x26C transmit broadcast packet counter */
	uint32_t txpf;	/* 0x270 transmit pause control frame counter */
	uint32_t tdfr;	/* 0x274 transmit deferral packet counter */
	uint32_t tedf;	/* 0x278 transmit excessive deferral packet counter */
	uint32_t tscl;	/* 0x27C transmit single collision packet counter */
	uint32_t tmcl;	/* 0x280 transmit multiple collision packet counter */
	uint32_t tlcl;	/* 0x284 transmit late collision packet counter */
	uint32_t txcl;	/* 0x288 transmit excessive collision packet counter */
	uint32_t tncl;	/* 0x28C transmit total collision counter */
	uint32_t reserved0290[1];
	uint32_t tdrp;	/* 0x294 transmit drop frame counter */
	uint32_t tjbr;	/* 0x298 transmit jabber frame counter */
	uint32_t tfcs;	/* 0x29C transmit FCS error counter */
	uint32_t txcf;	/* 0x2A0 transmit control frame counter */
	uint32_t tovr;	/* 0x2A4 transmit oversize frame counter */
	uint32_t tund;	/* 0x2A8 transmit undersize frame counter */
	uint32_t tfrg;	/* 0x2AC transmit fragments frame counter */
	uint32_t car1;	/* 0x2B0 carry register one register* */
	uint32_t car2;	/* 0x2B4 carry register two register* */
	uint32_t cam1;	/* 0x2B8 carry register one mask register */
	uint32_t cam2;	/* 0x2BC carry register two mask register */
	uint32_t reserved02c0[848];
};

/**
 * struct dtsec_mib_grp_1_counters - MIB counter overflows
 *
 * @tr64:	Transmit and Receive 64 byte frame count.  Increment for each
 *		good or bad frame, of any type, transmitted or received, which
 *		is 64 bytes in length.
 * @tr127:	Transmit and Receive 65 to 127 byte frame count.  Increments for
 *		each good or bad frame of any type, transmitted or received,
 *		which is 65-127 bytes in length.
 * @tr255:	Transmit and Receive 128 to 255 byte frame count.  Increments
 *		for each good or bad frame, of any type, transmitted or
 *		received, which is 128-255 bytes in length.
 * @tr511:	Transmit and Receive 256 to 511 byte frame count.  Increments
 *		for each good or bad frame, of any type, transmitted or
 *		received, which is 256-511 bytes in length.
 * @tr1k:	Transmit and Receive 512 to 1023 byte frame count.  Increments
 *		for each good or bad frame, of any type, transmitted or
