/*
 * Copyright 2013 Freescale Semiconductor Inc.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *     * Redistributions of source code must retain the above copyright
 *       notice, this list of conditions and the following disclaimer.
 *     * Redistributions in binary form must reproduce the above copyright
 *       notice, this list of conditions and the following disclaimer in the
 *       documentation and/or other materials provided with the distribution.
 *     * Neither the name of Freescale Semiconductor nor the
 *       names of its contributors may be used to endorse or promote products
 *       derived from this software without specific prior written permission.
 *
 *
 * ALTERNATIVELY, this software may be distributed under the terms of the
 * GNU General Public License ("GPL") as published by the Free Software
 * Foundation, either version 2 of that License or (at your option) any
 * later version.
 *
 * THIS SOFTWARE IS PROVIDED BY Freescale Semiconductor ``AS IS'' AND ANY
 * EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL Freescale Semiconductor BE LIABLE FOR ANY
 * DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
 * ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef __FSL_FMAN_H
#define __FSL_FMAN_H

#include "common/general.h"

struct fman_ext_pool_params {
	uint8_t                 id;    /**< External buffer pool id */
	uint16_t                size;  /**< External buffer pool buffer size */
};

struct fman_ext_pools {
	uint8_t num_pools_used;        /**< Number of pools use by this port */
	struct fman_ext_pool_params *ext_buf_pool;
					/**< Parameters for each port */
};

struct fman_backup_bm_pools {
	uint8_t		 num_backup_pools; /**< Number of BM backup pools -
					must be smaller than the total number
					of pools defined for the specified
					port.*/
	uint8_t		*pool_ids;      /**< numOfBackupPools pool id's,
					specifying which pools should be used
					only as backup. Pool id's specified
					here must be a subset of the pools
					used by the specified port.*/
};

/**************************************************************************//**
 @Description   A structure for defining BM pool depletion criteria
*//***************************************************************************/
struct fman_buf_pool_depletion {
	bool buf_pool_depletion_enabled;
	bool pools_grp_mode_enable;    /**< select mode in which pause frames
					will be sent after a number of pools
					(all together!) are depleted */
	uint8_t num_pools;             /**< the number of depleted pools that
					will invoke pause frames transmission.
					*/
	bool *pools_to_consider;       /**< For each pool, TRUE if it should be
					considered for depletion (Note - this
					pool must be used by this port!). */
	bool single_pool_mode_enable;  /**< select mode in which pause frames
					will be sent after a single-pool
					is depleted; */
	bool *pools_to_consider_for_single_mode;
				       /**< For each pool, TRUE if it should be
					considered for depletion (Note - this
					pool must be used by this port!) */
	bool has_pfc_priorities;
	bool *pfc_priorities_en;       /**< This field is used by the MAC as
					the Priority Enable Vector in the PFC
					frame which is transmitted */
};

/**************************************************************************//**
 @Description   Enum for defining port DMA swap mode
*//***************************************************************************/
enum fman_dma_swap_option {
	FMAN_DMA_NO_SWP,           /**< No swap, transfer data as is.*/
	FMAN_DMA_SWP_PPC_LE,       /**< The transferred data should be swapped
					in PowerPc Little Endian mode. */
	FMAN_DMA_SWP_BE            /**< The transferred data should be swapped
					in Big Endian mode */
};

/**************************************************************************//**
 @Description   Enum for defining port DMA cache attributes
*//***************************************************************************/
enum fman_dma_cache_option {
	FMAN_DMA_NO_STASH = 0,     /**< Cacheable, no Allocate (No Stashing) */
	FMAN_DMA_STASH = 1         /**< Cacheable and Allocate (Stashing on) */
};

typedef struct t_FmPrsResult fm_prs_result_t;
typedef enum e_EnetMode enet_mode_t;
typedef t_Handle handle_t;

struct fman_revision_info {
	uint8_t         majorRev;               /**< Major revision */
	uint8_t         minorRev;               /**< Minor revision */
};

/* sizes */
#define CAPWAP_FRAG_EXTRA_SPACE                 32
#define OFFSET_UNITS                            16
#define MAX_INT_OFFSET                          240
#define MAX_IC_SIZE                             256
#define MAX_EXT_OFFSET                          496
#define MAX_EXT_BUFFER_OFFSET                   511

/**************************************************************************
 @Description       Memory Mapped Registers
***************************************************************************/
#define FMAN_LIODN_TBL	64	/* size of LIODN table */

struct fman_fpm_regs {
	uint32_t fmfp_tnc;	/**< FPM TNUM Control 0x00 */
	uint32_t fmfp_prc;	/**< FPM Port_ID FmCtl Association 0x04 */
	uint32_t fmfp_brkc;		/**< FPM Breakpoint Control 0x08 */
	uint32_t fmfp_mxd;	/**< FPM Flush Control 0x0c */
	uint32_t fmfp_dist1;	/**< FPM Dispatch Thresholds1 0x10 */
	uint32_t fmfp_dist2;	/**< FPM Dispatch Thresholds2 0x14 */
	uint32_t fm_epi;	/**< FM Error Pending Interrupts 0x18 */
	uint32_t fm_rie;	/**< FM Error Interrupt Enable 0x1c */
	uint32_t fmfp_fcev[4];	/**< FPM FMan-Controller Event 1-4 0x20-0x2f */
	uint32_t res0030[4];	/**< res 0x30 - 0x3f */
	uint32_t fmfp_cee[4];	/**< PM FMan-Controller Event 1-4 0x40-0x4f */
	uint32_t res0050[4];	/**< res 0x50-0x5f */
	uint32_t fmfp_tsc1;	/**< FPM TimeStamp Control1 0x60 */
	uint32_t fmfp_tsc2;	/**< FPM TimeStamp Control2 0x64 */
	uint32_t fmfp_tsp;	/**< FPM Time Stamp 0x68 */
	uint32_t fmfp_tsf;	/**< FPM Time Stamp Fraction 0x6c */
	uint32_t fm_rcr;	/**< FM Rams Control 0x70 */
	uint32_t fmfp_extc;	/**< FPM External Requests Control 0x74 */
	uint32_t fmfp_ext1;	/**< FPM External Requests Config1 0x78 */
	uint32_t fmfp_ext2;	/**< FPM External Requests Config2 0x7c */
	uint32_t fmfp_drd[16];	/**< FPM Data_Ram Data 0-15 0x80 - 0xbf */
	uint32_t fmfp_dra;	/**< FPM Data Ram Access 0xc0 */
	uint32_t fm_ip_rev_1;	/**< FM IP Block Revision 1 0xc4 */
	uint32_t fm_ip_rev_2;	/**< FM IP Block Revision 2 0xc8 */
	uint32_t fm_rstc;	/**< FM Reset Command 0xcc */
	uint32_t fm_cld;	/**< FM Classifier Debug 0xd0 */
	uint32_t fm_npi;	/**< FM Normal Pending Interrupts 0xd4 */
	uint32_t fmfp_exte;	/**< FPM External Requests Enable 0xd8 */
	uint32_t fmfp_ee;	/**< FPM Event & Mask 0xdc */
	uint32_t fmfp_cev[4];	/**< FPM CPU Event 1-4 0xe0-0xef */
	uint32_t res00f0[4];	/**< res 0xf0-0xff */
	uint32_t fmfp_ps[64];	/**< FPM Port Status 0x100-0x1ff */
	uint32_t fmfp_clfabc;	/**< FPM CLFABC 0x200 */
	uint32_t fmfp_clfcc;	/**< FPM CLFCC 0x204 */
	uint32_t fmfp_clfaval;	/**< FPM CLFAVAL 0x208 */
	uint32_t fmfp_clfbval;	/**< FPM CLFBVAL 0x20c */
	uint32_t fmfp_clfcval;	/**< FPM CLFCVAL 0x210 */
	uint32_t fmfp_clfamsk;	/**< FPM CLFAMSK 0x214 */
	uint32_t fmfp_clfbmsk;	/**< FPM CLFBMSK 0x218 */
	uint32_t fmfp_clfcmsk;	/**< FPM CLFCMSK 0x21c */
	uint32_t fmfp_clfamc;	/**< FPM CLFAMC 0x220 */
	uint32_t fmfp_clfbmc;	/**< FPM CLFBMC 0x224 */
	uint32_t fmfp_clfcmc;	/**< FPM CLFCMC 0x228 */
	uint32_t fmfp_decceh;	/**< FPM DECCEH 0x22c */
	uint32_t res0230[116];	/**< res 0x230 - 0x3ff */
	uint32_t fmfp_ts[128];	/**< 0x400: FPM Task Status 0x400 - 0x5ff */
	uint32_t res0600[0x400 - 384];
};

struct fman_bmi_regs {
	uint32_t fmbm_init; /**< BMI Initialization 0x00 */
	uint32_t fmbm_cfg1; /**< BMI Configuration 1 0x04 */
	uint32_t fmbm_cfg2; /**< BMI Configuration 2 0x08 */
	uint32_t res000c[5]; /**< 0x0c - 0x1f */
	uint32_t fmbm_ievr; /**< Interrupt Event Register 0x20 */
	uint32_t fmbm_ier; /**< Interrupt Enable Register 0x24 */
	uint32_t fmbm_ifr; /**< Interrupt Force Register 0x28 */
	uint32_t res002c[5]; /**< 0x2c - 0x3f */
	uint32_t fmbm_arb[8]; /**< BMI Arbitration 0x40 - 0x5f */
	uint32_t res0060[12]; /**<0x60 - 0x8f */
	uint32_t fmbm_dtc[3]; /**< Debug Trap Counter 0x90 - 0x9b */
	uint32_t res009c; /**< 0x9c */
	uint32_t fmbm_dcv[3][4]; /**< Debug Compare val 0xa0-0xcf */
	uint32_t fmbm_dcm[3][4]; /**< Debug Compare Mask 0xd0-0xff */
	uint32_t fmbm_gde; /**< BMI Global Debug Enable 0x100 */
	uint32_t fmbm_pp[63]; /**< BMI Port Parameters 0x104 - 0x1ff */
	uint32_t res0200; /**< 0x200 */
	uint32_t fmbm_pfs[63]; /**< BMI Port FIFO Size 0x204 - 0x2ff */
	uint32_t res0300; /**< 0x300 */
	uint32_t fmbm_spliodn[63]; /**< Port Partition ID 0x304 - 0x3ff */
};

struct fman_qmi_regs {
	uint32_t fmqm_gc; /**< General Configuration Register 0x00 */
	uint32_t res0004; /**< 0x04 */
	uint32_t fmqm_eie; /**< Error Interrupt Event Register 0x08 */
	uint32_t fmqm_eien; /**< Error Interrupt Enable Register 0x0c */
	uint32_t fmqm_eif; /**< Error Interrupt Force Register 0x10 */
	uint32_t fmqm_ie; /**< Interrupt Event Register 0x14 */
	uint32_t fmqm_ien; /**< Interrupt Enable Register 0x18 */
	uint32_t fmqm_if; /**< Interrupt Force Register 0x1c */
	uint32_t fmqm_gs; /**< Global Status Register 0x20 */
	uint32_t fmqm_ts; /**< Task Status Register 0x24 */
	uint32_t fmqm_etfc; /**< Enqueue Total Frame Counter 0x28 */
	uint32_t fmqm_dtfc; /**< Dequeue Total Frame Counter 0x2c */
	uint32_t fmqm_dc0; /**< Dequeue Counter 0 0x30 */
	uint32_t fmqm_dc1; /**< Dequeue Counter 1 0x34 */
	uint32_t fmqm_dc2; /**< Dequeue Counter 2 0x38 */
	uint32_t fmqm_dc3; /**< Dequeue Counter 3 0x3c */
	uint32_t fmqm_dfdc; /**< Dequeue FQID from Default Counter 0x40 */
	uint32_t fmqm_dfcc; /**< Dequeue FQID from Context Counter 0x44 */
	uint32_t fmqm_dffc; /**< Dequeue FQID from FD Counter 0x48 */
	uint32_t fmqm_dcc; /**< Dequeue Confirm Counter 0x4c */
	uint32_t res0050[7]; /**< 0x50 - 0x6b */
	uint32_t fmqm_tapc; /**< Tnum Aging Period Control 0x6c */
	uint32_t fmqm_dmcvc; /**< Dequeue MAC Command Valid Counter 0x70 */
	uint32_t fmqm_difdcc; /**< Dequeue Invalid FD Command Counter 0x74 */
	uint32_t fmqm_da1v; /**< Dequeue A1 Valid Counter 0x78 */
	uint32_t res007c; /**< 0x7c */
	uint32_t fmqm_dtc; /**< 0x80 Debug Trap Counter 0x80 */
	uint32_t fmqm_efddd; /**< 0x84 Enqueue Frame desc Dynamic dbg 0x84 */
	uint32_t res0088[2]; /**< 0x88 - 0x8f */
	struct {
		uint32_t fmqm_dtcfg1; /**< 0x90 dbg trap cfg 1 Register 0x00 */
		uint32_t fmqm_dtval1; /**< Debug Trap Value 1 Register 0x04 */
		uint32_t fmqm_dtm1; /**< Debug Trap Mask 1 Register 0x08 */
		uint32_t fmqm_dtc1; /**< Debug Trap Counter 1 Register 0x0c */
		uint32_t fmqm_dtcfg2; /**< dbg Trap cfg 2 Register 0x10 */
		uint32_t fmqm_dtval2; /**< Debug Trap Value 2 Register 0x14 */
		uint32_t fmqm_dtm2; /**< Debug Trap Mask 2 Register 0x18 */
		uint32_t res001c; /**< 0x1c */
	} dbg_traps[3]; /**< 0x90 - 0xef */
	uint8_t res00f0[0x400 - 0xf0]; /**< 0xf0 - 0x3ff */
};

struct fman_dma_regs {
	uint32_t fmdmsr; /**< FM DMA status register 0x00 */
	uint32_t fmdmmr; /**< FM DMA mode register 0x04 */
	uint32_t fmdmtr; /**< FM DMA bus threshold register 0x08 */
	uint32_t fmdmhy; /**< FM DMA bus hysteresis register 0x0c */
	uint32_t fmdmsetr; /**< FM DMA SOS emergency Threshold Register 0x10 */
	uint32_t fmdmtah; /**< FM DMA transfer bus address high reg 0x14 */
	uint32_t fmdmtal; /**< FM DMA transfer bus address low reg 0x18 */
	uint32_t fmdmtcid; /**< FM DMA transfer bus communication ID reg 0x1c */
	uint32_t fmdmra; /**< FM DMA bus internal ram address register 0x20 */
	uint32_t fmdmrd; /**< FM DMA bus internal ram data register 0x24 */
	uint32_t fmdmwcr; /**< FM DMA CAM watchdog counter value 0x28 */
	uint32_t fmdmebcr; /**< FM DMA CAM base in MURAM register 0x2c */
	uint32_t fmdmccqdr; /**< FM DMA CAM and CMD Queue Debug reg 0x30 */
	uint32_t fmdmccqvr1; /**< FM DMA CAM and CMD Queue Value reg #1 0x34 */
	uint32_t fmdmccqvr2; /**< FM DMA CAM and CMD Queue Value reg #2 0x38 */
	uint32_t fmdmcqvr3; /**< FM DMA CMD Queue Value register #3 0x3c */
	uint32_t fmdmcqvr4; /**< FM DMA CMD Queue Value register #4 0x40 */
	uint32_t fmdmcqvr5; /**< FM DMA CMD Queue Value register #5 0x44 */
	uint32_t fmdmsefrc; /**< FM DMA Semaphore Entry Full Reject Cntr 0x48 */
	uint32_t fmdmsqfrc; /**< FM DMA Semaphore Queue Full Reject Cntr 0x4c */
	uint32_t fmdmssrc; /**< FM DMA Semaphore SYNC Reject Counter 0x50 */
	uint32_t fmdmdcr;  /**< FM DMA Debug Counter 0x54 */
	uint32_t fmdmemsr; /**< FM DMA Emergency Smoother Register 0x58 */
	uint32_t res005c; /**< 0x5c */
	uint32_t fmdmplr[FMAN_LIODN_TBL / 2]; /**< DMA LIODN regs 0x60-0xdf */
	uint32_t res00e0[0x400 - 56];
};

struct fman_rg {
	struct fman_fpm_regs *fpm_rg;
	struct fman_dma_regs *dma_rg;
	struct fman_bmi_regs *bmi_rg;
	struct fman_qmi_regs *qmi_rg;
};

enum fman_dma_cache_override {
	E_FMAN_DMA_NO_CACHE_OR = 0, /**< No override of the Cache field */
	E_FMAN_DMA_NO_STASH_DATA, /**< No data stashing in system level cache */
	E_FMAN_DMA_MAY_STASH_DATA, /**< Stashing allowed in sys level cache */
	E_FMAN_DMA_STASH_DATA /**< Stashing performed in system level cache */
};

enum fman_dma_aid_mode {
	E_FMAN_DMA_AID_OUT_PORT_ID = 0,           /**< 4 LSB of PORT_ID */
	E_FMAN_DMA_AID_OUT_TNUM                   /**< 4 LSB of TNUM */
};

enum fman_dma_dbg_cnt_mode {
	E_FMAN_DMA_DBG_NO_CNT = 0, /**< No counting */
	E_FMAN_DMA_DBG_CNT_DONE, /**< Count DONE commands */
	E_FMAN_DMA_DBG_CNT_COMM_Q_EM, /**< command Q emergency signal */
