share/man/man4/man4.amd64/efifb.4
.\"	$OpenBSD: efifb.4,v 1.2 2015/08/31 15:28:39 jmc Exp $
.\"
.\" Copyright (c) 2015 YASUOKA Masahiko <yasuoka@yasuoka.net>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.\" The following requests are required for all man pages.
.\"
.Dd $Mdocdate: August 31 2015 $
.Dt EFIFB 4 amd64
.Os
.Sh NAME
.Nm efifb
.Nd EFI frame buffer
.Sh SYNOPSIS
.Cd "efifb* at mainbus?"
.Cd "wsdisplay* at efifb?"
.Sh DESCRIPTION
The
.Nm
driver supports the frame buffer passed from UEFI,
the Unified Extensible Firmware Interface.
.Pp
The
.Nm
driver interfaces the frame buffer with the
.Xr wscons 4
console framework.
It does not provide direct device driver entry points
but makes its functions available via the internal
.Xr wsdisplay 4
interface.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr mainbus 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
