share/man/man4/man4.arm64/aplcpu.4
.\"	$OpenBSD: aplcpu.4,v 1.2 2022/02/20 20:01:04 jmc Exp $
.\"
.\" Copyright (c) 2022 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: February 20 2022 $
.Dt APLCPU 4 arm64
.Os
.Sh NAME
.Nm aplcpu
.Nd Apple CPU power states
.Sh SYNOPSIS
.Cd "aplcpu* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for managing the CPU power states on Apple
SoCs.
These power states can be set to reduce power usage and extend battery
life through the
.Va hw.setperf
.Xr sysctl 2
mechanism.
.Sh SEE ALSO
.Xr sysctl 2 ,
.Xr intro 4 ,
.Xr apmd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.1 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
