share/man/man4/man4.arm64/aplmca.4
.\"	$OpenBSD: aplmca.4,v 1.3 2022/08/06 10:51:30 jsg Exp $
.\"
.\" Copyright (c) 2022 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 6 2022 $
.Dt APLMCA 4 arm64
.Os
.Sh NAME
.Nm aplmca
.Nd Apple MCA controller
.Sh SYNOPSIS
.Cd "aplmca* at fdt?"
.Sh DESCRIPTION
.Nm
is a driver for the MCA controller integrated on
various Apple SoCs.
This controller serializes audio data streams received from the
.Xr apldma 4
DMA controller and sends these out as I2S/TDM streams on the audio
interfaces of the SoCs.
.Sh SEE ALSO
.Xr aplaudio 4 ,
.Xr apldma 4 ,
.Xr aplnco 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.2 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
