share/man/man4/man4.arm64/aplsmc.4
.\"	$OpenBSD: aplsmc.4,v 1.3 2023/06/22 15:29:05 tobhe Exp $
.\"
.\" Copyright (c) 2021 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: June 22 2023 $
.Dt APLSMC 4 arm64
.Os
.Sh NAME
.Nm aplsmc
.Nd Apple System Management Controller (SMC)
.Sh SYNOPSIS
.Cd "aplsmc* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the System Management Controller (SMC)
found on various Apple SoCs.
The driver provides a collection of current, fan, power, temperature,
voltage, lid position and battery information sensors.
.Pp
Sensor values are made available through the
.Xr sysctl 8
interface.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.1 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
