share/man/man4/man4.arm64/rpipwm.4
.\"	$OpenBSD: rpipwm.4,v 1.1 2025/09/17 10:56:34 kettenis Exp $
.\"
.\" Copyright (c) 2025 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 17 2025 $
.Dt RPIPWM 4 arm64
.Os
.Sh NAME
.Nm rpipwm
.Nd Raspberry Pi RP1 PWM controller
.Sh SYNOPSIS
.Cd "rpipwm* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the PWM controllers integrated on the RP1
chip found on the Raspberry Pi 5.
.Sh SEE ALSO
.Xr intro 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 7.8 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Marcus Glocker Aq Mt mglocker@openbsd.org
and
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
