usr.sbin/ypserv/mknetid/mknetid.8
.\"	$OpenBSD: mknetid.8,v 1.16 2013/07/16 11:13:34 schwarze Exp $
.\"
.\" Copyright (c) 1996 Mats O Jansson <moj@stacken.kth.se>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: July 16 2013 $
.Dt MKNETID 8
.Os
.Sh NAME
.Nm mknetid
.Nd generate a YP map of group and domain memberships
.Sh SYNOPSIS
.Nm mknetid
.Bk -words
.Op Fl q
.Op Fl d Ar domain
.Op Fl g Ar groupfile
.Op Fl h Ar hostfile
.Op Fl m Ar netidfile
.Op Fl P Ar master.passwdfile
.Op Fl p Ar passwdfile
.Ek
.Sh DESCRIPTION
The
.Nm
utility combines information from the
.Xr passwd 5 ,
.Xr group 5 ,
.Xr hosts 5 ,
and
.Xr netid 5
files, printing it in
.Xr netid 5
format to the standard output.
If the
.Xr passwd 5
file is not available, the
.Xr master.passwd 5
file is used instead.
The
.Xr netid 5
file is optional and does not need to exist.
.Pp
The most common application is to pass the output to
.Xr makedbm 8
in order to create a
.Pa netid.byname
map for the
.Xr yp 8
subsystem.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl d Ar domain
Use
.Ar domain
instead of the default
.Xr domainname 1 .
.It Fl g Ar groupfile
Use
.Ar groupfile
instead of
.Pa /etc/group .
.It Fl h Ar hostfile
Use
.Ar hostfile
instead of
.Pa /etc/hosts .
.It Fl m Ar netidfile
Use
.Ar netidfile
instead of
.Pa /etc/netid .
.It Fl P Ar master.passwdfile
Use
.Ar master.passwdfile
instead of
.Pa /etc/master.passwd .
.It Fl p Ar passwdfile
Use
.Ar passwdfile
instead of
.Pa /etc/passwd .
.It Fl q
Keep quiet about multiple occurrences of a user ID.
Ignore all but the first.
.El
.Sh FILES
.Bl -tag -width /etc/master.passwd -compact
.It Pa /etc/passwd
.It Pa /etc/master.passwd
.It Pa /etc/group
.It Pa /etc/hosts
.It Pa /etc/netid
.El
.Sh SEE ALSO
.Xr domainname 1 ,
.Xr group 5 ,
.Xr hosts 5 ,
.Xr netid 5 ,
.Xr passwd 5 ,
.Xr Makefile.yp 8
.Sh AUTHORS
.An Mats O Jansson Aq Mt moj@stacken.kth.se
