share/man/man4/man4.sparc64/audioce.4
.\"     $OpenBSD: audioce.4,v 1.9 2020/05/17 05:48:39 ratchov Exp $
.\"
.\" Copyright (c) 2001 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 17 2020 $
.Dt AUDIOCE 4 sparc64
.Os
.Sh NAME
.Nm audioce
.Nd SPARC64 EBus CS4231 audio device
.Sh SYNOPSIS
.Cd "audioce* at ebus?"
.Cd "audio* at audioce?"
.Sh DESCRIPTION
The
.Nm
device uses the
.Tn Crystal Semiconductor
CS4231A
Parallel Interface, Multimedia Audio Codec
chip to implement the audio device interface described in
.Xr audio 4 .
This device is found onboard on some PCI/EBus based sparc64 models.
.Pp
The
.Nm
has a maximum precision of 16 bits and has both stereo and monoaural outputs.
.Sh MIXER INTERFACE
The
.Xr audio 4
interface for
.Nm
provides the following controls:
.Bl -tag -width "outputs.monitor.mute"
.It Cm outputs.dac
Specifies the attenuation of DAC output.
A value of
.Ql 255
represents 0 dB attenuation.
.It Cm outputs.dac.mute
Specifies whether DAC output is muted.
.It Cm outputs.output
Specifies the set of enabled output ports.
The output ports are:
.Ql line ,
the line output jack,
.Ql hp ,
the low impedance headphone jack, and
.Ql spkr ,
the internal speaker.
Note: Not all systems support disabling the headphone and line output ports.
.It Cm inputs.cd
Specifies the gain applied to CD audio input.
A value of
.Ql 191
represents 0 dB.
.It Cm inputs.cd.mute
Specifies whether CD audio input is muted.
.It Cm inputs.line
Specifies the gain applied to line input.
A value of
.Ql 191
represents 0 dB.
.It Cm inputs.line.mute
Specifies whether line input is muted.
.It Cm outputs.monitor
Specifies the attenuation of ADC to DAC output.
A value of
.Ql 255
represents 0 dB.
.It Cm outputs.monitor.mute
Specifies whether ADC to DAC output is muted.
.It Cm record.volume
Specifies ADC input gain.
A value of
.Ql 0
represents 0 dB.
.It Cm record.source
Specifies the active input port for the ADC.
The following are valid ADC input ports:
.Ql line ,
line input,
.Ql cd ,
CD input,
.Ql mic ,
microphone input, and
.Ql mixerout ,
post-mixer output as heard on the output ports.
.It Cm record.mic_preamp
Specifies whether an additional +20 dB gain is
applied to the ADC's microphone input.
.El
.Sh SEE ALSO
.Xr ioctl 2 ,
.Xr audio 4 ,
.Xr ebus 4 ,
.Xr intro 4
.Sh HISTORY
.Ox
support for
.Nm
first appeared in
.Ox 3.0 .
