share/man/man4/man4.sparc64/clock.4
.\"     $OpenBSD: clock.4,v 1.9 2018/06/18 06:06:52 jmc Exp $
.\"
.\" Copyright (c) 2004 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: June 18 2018 $
.Dt CLOCK 4 sparc64
.Os
.Sh NAME
.Nm clock ,
.Nm rtc
.Nd real-time clock
.Sh SYNOPSIS
.Cd "clock* at sbus?"
.Cd "clock* at ebus?"
.Cd "clock0 at fhc0"
.Cd "rtc* at ebus?"
.Sh DESCRIPTION
The
.Nm
device provides support for the real-time clocks based
on the following chips:
.Pp
.Bl -bullet -offset indent -compact
.It
Mostek MK48T02
.It
Mostek MK48T08
.It
Mostek MK48T18
.It
Mostek MK48T59
.El
.Pp
The
.Nm rtc
device provides support for the real-time clock based
on the following chips:
.Pp
.Bl -bullet -offset indent -compact
.It
Dallas/Maxim Semiconductor DS1287
.It
Acer Labs M5819
.It
Acer Labs M5823
.It
Texas Instruments BQ4802
.El
.Sh SEE ALSO
.Xr ebus 4 ,
.Xr fhc 4 ,
.Xr intro 4 ,
.Xr sbus 4
