share/man/man4/man4.sparc64/cmp.4
.\"     $OpenBSD: cmp.4,v 1.5 2013/07/16 16:05:49 schwarze Exp $
.\"
.\" Copyright (c) 2008 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 16 2013 $
.Dt CMP 4 sparc64
.Os
.Sh NAME
.Nm cmp
.Nd chip multi-threading processor
.Sh SYNOPSIS
.Cd "cmp* at mainbus0"
.Cd "cmp* at ssm?"
.Cd "cpu* at cmp?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the chip multi-threading processors such as the
Sun UltraSPARC IV and Fujitsu SPARC64 VI processors.
It is not a physical device as such, but an abstraction to attach
individual CPU cores.
.Sh SEE ALSO
.\".Xr cpu 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.4 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
