share/man/man4/man4.sparc64/comms.4
.\"	$OpenBSD: comms.4,v 1.1 2009/05/20 18:22:32 miod Exp $
.\"
.\" Copyright (c) 2009 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.Dd $Mdocdate: May 20 2009 $
.Dt COMMS 4 sparc64
.Os
.Sh NAME
.Nm comms
.Nd serial mouse driver
.Sh SYNOPSIS
.Cd "comms* at ebus?"
.Cd "wsmouse* at comms?"
.Sh DESCRIPTION
The
.Nm
driver provides support for Sun serial mice, connected to
.Nm comkbd
serial keyboards.
.Sh SEE ALSO
.Xr com 4 ,
.Xr comkbd 4 ,
.Xr ebus 4 ,
.Xr intro 4 ,
.Xr wsmouse 4
