share/man/man4/man4.sparc64/vldc.4
.\"     $OpenBSD: vldc.4,v 1.3 2015/11/21 08:04:20 jmc Exp $
.\"
.\" Copyright (c) 2012 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: November 21 2015 $
.Dt VLDC 4 sparc64
.Os
.Sh NAME
.Nm vldc ,
.Nm vldcp
.Nd virtual channel driver
.Sh SYNOPSIS
.Cd "vldc* at cbus?"
.Cd "vldcp* at vldc?"
.Sh DESCRIPTION
The
.Nm
driver provides access to services provided over virtual channels provided by
the UltraSPARC Hypervisor as found on sun4v systems.
Examples of such services are the Hypervisor Control Interface and the
Variable Configuration domain service.
.Sh SEE ALSO
.Xr cbus 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.3 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
