share/man/man4/man4.sparc64/vnet.4
.\"     $OpenBSD: vnet.4,v 1.4 2013/07/16 16:05:50 schwarze Exp $
.\"
.\" Copyright (c) 2009 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 16 2013 $
.Dt VNET 4 sparc64
.Os
.Sh NAME
.Nm vnet
.Nd virtual network interface
.Sh SYNOPSIS
.Cd "vnet* at cbus?"
.Cd "vnet* at vsw?"
.Sh DESCRIPTION
The
.Nm
driver provides a network interface using the services provided by the
UltraSPARC Hypervisor as found on sun4v systems.
It connects to a virtual switch (vsw) device or virtual network (vnet)
device in another logical domain using a logical domain channel
provided by the hypervisor.
.Pp
The
.Nm
driver supports version 1.0 of the vNet protocol.
.Pp
The
.Nm
driver supports the following media types:
.Bl -tag -width autoselect
.It autoselect
Enable autoselection of the media type and options.
The driver always uses the fastest available speed and the media
options provided by the underlying host of the virtual machine.
.El
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
.Sh SEE ALSO
.Xr arp 4 ,
.Xr cbus 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr vsw 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.5 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
