/*
 * Copyright (C) 2008-2009 QUALCOMM Incorporated.
 */

#include <linux/delay.h>
#include <linux/types.h>
#include <linux/i2c.h>
#include <linux/uaccess.h>
#include <linux/miscdevice.h>
#include <media/msm_camera.h>
#include <mach/gpio.h>
#include <mach/camera.h>
#include "s5k3e2fx.h"

#define S5K3E2FX_REG_MODEL_ID   0x0000
#define S5K3E2FX_MODEL_ID   		0x3E2F

/* PLL Registers */
#define REG_PRE_PLL_CLK_DIV       		0x0305
#define REG_PLL_MULTIPLIER_MSB    		0x0306
#define REG_PLL_MULTIPLIER_LSB    		0x0307
#define REG_VT_PIX_CLK_DIV        		0x0301
#define REG_VT_SYS_CLK_DIV        		0x0303
#define REG_OP_PIX_CLK_DIV        		0x0309
#define REG_OP_SYS_CLK_DIV        		0x030B

/* Data Format Registers */
#define REG_CCP_DATA_FORMAT_MSB   		0x0112
#define REG_CCP_DATA_FORMAT_LSB   		0x0113

/* Output Size */
#define REG_X_OUTPUT_SIZE_MSB     		0x034C
#define REG_X_OUTPUT_SIZE_LSB     		0x034D
#define REG_Y_OUTPUT_SIZE_MSB     		0x034E
#define REG_Y_OUTPUT_SIZE_LSB     		0x034F

/* Binning */
#define REG_X_EVEN_INC            		0x0381
#define REG_X_ODD_INC             		0x0383
#define REG_Y_EVEN_INC            		0x0385
#define REG_Y_ODD_INC             		0x0387
/*Reserved register */
#define REG_BINNING_ENABLE        		0x3014

/* Frame Fotmat */
#define REG_FRAME_LENGTH_LINES_MSB		0x0340
#define REG_FRAME_LENGTH_LINES_LSB		0x0341
#define REG_LINE_LENGTH_PCK_MSB   		0x0342
#define REG_LINE_LENGTH_PCK_LSB   		0x0343

/* MSR setting */
/* Reserved registers */
#define REG_SHADE_CLK_ENABLE      		0x30AC
#define REG_SEL_CCP               		0x30C4
#define REG_VPIX                  		0x3024
#define REG_CLAMP_ON              		0x3015
#define REG_OFFSET                		0x307E

/* CDS timing settings */
/* Reserved registers */
#define REG_LD_START              		0x3000
#define REG_LD_END                		0x3001
#define REG_SL_START              		0x3002
#define REG_SL_END                		0x3003
#define REG_RX_START              		0x3004
#define REG_S1_START              		0x3005
#define REG_S1_END                		0x3006
#define REG_S1S_START             		0x3007
#define REG_S1S_END               		0x3008
#define REG_S3_START              		0x3009
#define REG_S3_END                		0x300A
#define REG_CMP_EN_START          		0x300B
#define REG_CLP_SL_START          		0x300C
#define REG_CLP_SL_END            		0x300D
#define REG_OFF_START             		0x300E
#define REG_RMP_EN_START          		0x300F
#define REG_TX_START              		0x3010
#define REG_TX_END                		0x3011
#define REG_STX_WIDTH             		0x3012
#define REG_TYPE1_AF_ENABLE       		0x3130
#define DRIVER_ENABLED            		0x0001
#define AUTO_START_ENABLED        		0x0010
#define REG_NEW_POSITION          		0x3131
#define REG_3152_RESERVED         		0x3152
#define REG_315A_RESERVED         		0x315A
#define REG_ANALOGUE_GAIN_CODE_GLOBAL_MSB 0x0204
#define REG_ANALOGUE_GAIN_CODE_GLOBAL_LSB 0x0205
#define REG_FINE_INTEGRATION_TIME     		0x0200
#define REG_COARSE_INTEGRATION_TIME   		0x0202
#define REG_COARSE_INTEGRATION_TIME_LSB   0x0203

/* Mode select register */
#define S5K3E2FX_REG_MODE_SELECT  		0x0100
#define S5K3E2FX_MODE_SELECT_STREAM 		0x01   /* start streaming */
#define S5K3E2FX_MODE_SELECT_SW_STANDBY 0x00   /* software standby */
#define S5K3E2FX_REG_SOFTWARE_RESET   0x0103
#define S5K3E2FX_SOFTWARE_RESET     		0x01
#define REG_TEST_PATTERN_MODE     		0x0601

struct reg_struct {
	uint8_t pre_pll_clk_div;               /* 0x0305 */
	uint8_t pll_multiplier_msb;            /* 0x0306 */
	uint8_t pll_multiplier_lsb;            /* 0x0307 */
	uint8_t vt_pix_clk_div;                /* 0x0301 */
	uint8_t vt_sys_clk_div;                /* 0x0303 */
	uint8_t op_pix_clk_div;                /* 0x0309 */
	uint8_t op_sys_clk_div;                /* 0x030B */
	uint8_t ccp_data_format_msb;           /* 0x0112 */
	uint8_t ccp_data_format_lsb;           /* 0x0113 */
	uint8_t x_output_size_msb;             /* 0x034C */
	uint8_t x_output_size_lsb;             /* 0x034D */
	uint8_t y_output_size_msb;             /* 0x034E */
	uint8_t y_output_size_lsb;             /* 0x034F */
	uint8_t x_even_inc;                    /* 0x0381 */
	uint8_t x_odd_inc;                     /* 0x0383 */
	uint8_t y_even_inc;                    /* 0x0385 */
	uint8_t y_odd_inc;                     /* 0x0387 */
	uint8_t binning_enable;                /* 0x3014 */
	uint8_t frame_length_lines_msb;        /* 0x0340 */
	uint8_t frame_length_lines_lsb;        /* 0x0341 */
	uint8_t line_length_pck_msb;           /* 0x0342 */
	uint8_t line_length_pck_lsb;           /* 0x0343 */
	uint8_t shade_clk_enable ;             /* 0x30AC */
	uint8_t sel_ccp;                       /* 0x30C4 */
	uint8_t vpix;                          /* 0x3024 */
	uint8_t clamp_on;                      /* 0x3015 */
	uint8_t offset;                        /* 0x307E */
	uint8_t ld_start;                      /* 0x3000 */
	uint8_t ld_end;                        /* 0x3001 */
	uint8_t sl_start;                      /* 0x3002 */
	uint8_t sl_end;                        /* 0x3003 */
	uint8_t rx_start;                      /* 0x3004 */
	uint8_t s1_start;                      /* 0x3005 */
	uint8_t s1_end;                        /* 0x3006 */
	uint8_t s1s_start;                     /* 0x3007 */
	uint8_t s1s_end;                       /* 0x3008 */
	uint8_t s3_start;                      /* 0x3009 */
	uint8_t s3_end;                        /* 0x300A */
	uint8_t cmp_en_start;                  /* 0x300B */
	uint8_t clp_sl_start;                  /* 0x300C */
	uint8_t clp_sl_end;                    /* 0x300D */
	uint8_t off_start;                     /* 0x300E */
	uint8_t rmp_en_start;                  /* 0x300F */
	uint8_t tx_start;                      /* 0x3010 */
	uint8_t tx_end;                        /* 0x3011 */
	uint8_t stx_width;                     /* 0x3012 */
	uint8_t reg_3152_reserved;             /* 0x3152 */
	uint8_t reg_315A_reserved;             /* 0x315A */
	uint8_t analogue_gain_code_global_msb; /* 0x0204 */
	uint8_t analogue_gain_code_global_lsb; /* 0x0205 */
	uint8_t fine_integration_time;         /* 0x0200 */
	uint8_t coarse_integration_time;       /* 0x0202 */
	uint32_t size_h;
	uint32_t blk_l;
	uint32_t size_w;
	uint32_t blk_p;
};

struct reg_struct s5k3e2fx_reg_pat[2] = {
	{ /* Preview */
		0x06,  /* pre_pll_clk_div       REG=0x0305 */
		0x00,  /* pll_multiplier_msb    REG=0x0306 */
		0x88,  /* pll_multiplier_lsb    REG=0x0307 */
		0x0a,  /* vt_pix_clk_div        REG=0x0301 */
		0x01,  /* vt_sys_clk_div        REG=0x0303 */
		0x0a,  /* op_pix_clk_div        REG=0x0309 */
		0x01,  /* op_sys_clk_div        REG=0x030B */
		0x0a,  /* ccp_data_format_msb   REG=0x0112 */
		0x0a,  /* ccp_data_format_lsb   REG=0x0113 */
		0x05,  /* x_output_size_msb     REG=0x034C */
		0x10,  /* x_output_size_lsb     REG=0x034D */
		0x03,  /* y_output_size_msb     REG=0x034E */
		0xcc,  /* y_output_size_lsb     REG=0x034F */

	/* enable binning for preview */
		0x01,  /* x_even_inc             REG=0x0381 */
		0x01,  /* x_odd_inc              REG=0x0383 */
		0x01,  /* y_even_inc             REG=0x0385 */
