share/man/man4/man4.octeon/octrng.4
.\"	$OpenBSD: octrng.4,v 1.5 2020/04/06 00:01:08 pirofti Exp $
.\"
.\" Copyright (c) 2013 Paul Irofti <paul@irofti.net>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.\"
.Dd $Mdocdate: April 6 2020 $
.Dt OCTRNG 4 octeon
.Os
.Sh NAME
.Nm octrng
.Nd octeon random number generator
.Sh SYNOPSIS
.Cd "octrng* at iobus?"
.Sh DESCRIPTION
The
.Nm
driver supports the random number generator found on the CN50XX chip.
.Pp
After the 5 seconds it takes for the device to be initialized, the
.Nm
driver feeds the random subsystem's entropy pool 32 bits of data every
10 milliseconds through the
.Xr enqueue_randomness 9
API.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr arc4random 9
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.5 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Paul Irofti Aq Mt paul@irofti.net .
