share/man/man4/man4.octeon/octsmi.4
.\"	$OpenBSD: octsmi.4,v 1.1 2019/10/01 15:44:32 visa Exp $
.\"
.\" Copyright (c) 2019 Visa Hankala
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: October 1 2019 $
.Dt OCTSMI 4 octeon
.Os
.Sh NAME
.Nm octsmi
.Nd OCTEON system management interface
.Sh SYNOPSIS
.Cd "octsmi* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the OCTEON system management interface.
This interface connects the OCTEON SoC with external Ethernet PHYs.
.Sh SEE ALSO
.Xr cnmac 4 ,
.Xr intro 4 ,
.Xr mii 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.4 .
