share/man/man4/man4.octeon/octxctl.4
.\"	$OpenBSD: octxctl.4,v 1.1 2017/08/01 16:21:54 visa Exp $
.\"
.\" Copyright (c) 2017 Visa Hankala
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 1 2017 $
.Dt OCTXCTL 4 octeon
.Os
.Sh NAME
.Nm octxctl
.Nd OCTEON USB3 controller bridge
.Sh SYNOPSIS
.Cd "octxctl* at fdt?"
.Cd "xhci* at octxctl?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the OCTEON USB3 controller bridge.
The bridge connects the system's I/O bus and a USB3 controller.
.Sh SEE ALSO
.Xr xhci 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.2 .
