share/man/man4/man4.riscv64/mpfclock.4
.\"	$OpenBSD: mpfclock.4,v 1.1 2022/01/05 03:32:43 visa Exp $
.\"
.\" Copyright (c) 2022 Visa Hankala
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: January 5 2022 $
.Dt MPFCLOCK 4 riscv64
.Os
.Sh NAME
.Nm mpfclock
.Nd Microchip PolarFire SoC MSS clock controller
.Sh SYNOPSIS
.Cd "mpfclock* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver controls the clock signals for the integrated components
of PolarFire SoCs.
The driver also provides system reset functionality.
.Sh SEE ALSO
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.1 .
