share/man/man4/man4.riscv64/sfcc.4
.\"	$OpenBSD: sfcc.4,v 1.1 2021/06/18 04:29:09 jsg Exp $
.\"
.\" Copyright (c) 2021 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: June 18 2021 $
.Dt SFCC 4 riscv64
.Os
.Sh NAME
.Nm sfcc
.Nd SiFive L2 cache controller
.Sh SYNOPSIS
.Cd "sfcc* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver supports the SiFive level two cache controller.
