share/man/man4/man4.riscv64/stfpcie.4
.\"	$OpenBSD: stfpcie.4,v 1.1 2023/07/08 10:18:34 kettenis Exp $
.\"
.\" Copyright (c) 2023 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 8 2023 $
.Dt STFPCIE 4 riscv64
.Os
.Sh NAME
.Nm stfpcie
.Nd StarFive JH7110 Host/PCIe bridge
.Sh SYNOPSIS
.Cd "stfpcie* at fdt?"
.Cd "pci* at dwpcie?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the PLDA XpressRICH-AXI PCIe controller,
which is built into the StarFive JH7110 SoC.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4 ,
.Xr stfpciephy 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.4 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
