[
    {
        "PublicDescription": "L1 instruction cache refill. This event counts any instruction fetch which misses in the cache.",
        "EventCode": "0x01",
        "EventName": "L1I_CACHE_REFILL",
        "BriefDescription": "L1 instruction cache refill"
    },
    {
        "PublicDescription": "L1 instruction TLB refill. This event counts any refill of the instruction L1 TLB from the L2 TLB. This includes refills that result in a translation fault.",
        "EventCode": "0x02",
        "EventName": "L1I_TLB_REFILL",
        "BriefDescription": "L1 instruction TLB refill"
    },
    {
        "PublicDescription": "L1 data cache refill. This event counts any load or store operation or page table walk access which causes data to be read from outside the L1, including accesses which do not allocate into L1.",
        "EventCode": "0x03",
        "EventName": "L1D_CACHE_REFILL",
        "BriefDescription": "L1 data cache refill"
    },
    {
        "PublicDescription": "L1 data cache access. This event counts any load or store operation or page table walk access which looks up in the L1 data cache. In particular, any access which could count the L1D_CACHE_REFILL event causes this event to count.",
        "EventCode": "0x04",
        "EventName": "L1D_CACHE",
        "BriefDescription": "L1 data cache access"
    },
    {
        "PublicDescription": "L1 data TLB refill. This event counts any refill of the data L1 TLB from the L2 TLB. This includes refills that result in a translation fault.",
        "EventCode": "0x05",
        "EventName": "L1D_TLB_REFILL",
        "BriefDescription": "L1 data TLB refill"
    },
    {
        "PublicDescription": "Level 1 instruction cache access or Level 0 Macro-op cache access. This event counts any instruction fetch which accesses the L1 instruction cache or L0 Macro-op cache.",
        "EventCode": "0x14",
        "EventName": "L1I_CACHE",
        "BriefDescription": "L1 instruction cache access"
    },
    {
        "PublicDescription": "L1 data cache Write-Back. This event counts any write-back of data from the L1 data cache to L2 or L3. This counts both victim line evictions and snoops, including cache maintenance operations.",
        "EventCode": "0x15",
        "EventName": "L1D_CACHE_WB",
        "BriefDescription": "L1 data cache Write-Back"
    },
    {
        "PublicDescription": "L2 data cache access. This event counts any transaction from L1 which looks up in the L2 cache, and any write-back from the L1 to the L2. Snoops from outside the core and cache maintenance operations are not counted.",
        "EventCode": "0x16",
        "EventName": "L2D_CACHE",
        "BriefDescription": "L2 data cache access"
    },
    {
        "PublicDescription": "L2 data cache refill. This event counts any cacheable transaction from L1 which causes data to be read from outside the core. L2 refills caused by stashes into L2 should not be counted",
        "EventCode": "0x17",
        "EventName": "L2D_CACHE_REFILL",
        "BriefDescription": "L2 data cache refill"
    },
    {
        "PublicDescription": "L2 data cache write-back. This event counts any write-back of data from the L2 cache to outside the core. This includes snoops to the L2 which return data, regardless of whether they cause an invalidation. Invalidations from the L2 which do not write data outside of the core and snoops which return data from the L1 are not counted",
        "EventCode": "0x18",
        "EventName": "L2D_CACHE_WB",
        "BriefDescription": "L2 data cache write-back"
    },
    {
        "PublicDescription": "L2 data cache allocation without refill. This event counts any full cache line write into the L2 cache which does not cause a linefill, including write-backs from L1 to L2 and full-line writes which do not allocate into L1.",
        "EventCode": "0x20",
        "EventName": "L2D_CACHE_ALLOCATE",
        "BriefDescription": "L2 data cache allocation without refill"
    },
    {
        "PublicDescription": "Level 1 data TLB access. This event counts any load or store operation which accesses the data L1 TLB. If both a load and a store are executed on a cycle, this event counts twice. This event counts regardless of whether the MMU is enabled.",
        "EventCode": "0x25",
        "EventName": "L1D_TLB",
        "BriefDescription": "Level 1 data TLB access."
    },
    {
        "PublicDescription": "Level 1 instruction TLB access. This event counts any instruction fetch which accesses the instruction L1 TLB.This event counts regardless of whether the MMU is enabled.",
        "EventCode": "0x26",
        "EventName": "L1I_TLB",
        "BriefDescription": "Level 1 instruction TLB access"
    },
    {
        "PublicDescription": "This event counts any full cache line write into the L3 cache which does not cause a linefill, including write-backs from L2 to L3 and full-line writes which do not allocate into L2",
        "EventCode": "0x29",
        "EventName": "L3D_CACHE_ALLOCATE",
        "BriefDescription": "Allocation without refill"
    },
    {
        "PublicDescription": "Attributable Level 3 unified cache refill. This event counts for any cacheable read transaction returning datafrom the SCU for which the data source was outside the cluster. Transactions such as ReadUnique are counted here as 'read' transactions, even though they can be generated by store instructions.",
        "EventCode": "0x2A",
        "EventName": "L3D_CACHE_REFILL",
        "BriefDescription": "Attributable Level 3 unified cache refill."
    },
    {
        "PublicDescription": "Attributable Level 3 unified cache access. This event counts for any cacheable read transaction returning datafrom the SCU, or for any cacheable write to the SCU.",
        "EventCode": "0x2B",
        "EventName": "L3D_CACHE",
        "BriefDescription": "Attributable Level 3 unified cache access."
    },
    {
        "PublicDescription": "Attributable L2 data or unified TLB refill. This event counts on anyrefill of the L2 TLB, caused by either an instruction or data access.This event does not count if the MMU is disabled.",
        "EventCode": "0x2D",
        "EventName": "L2D_TLB_REFILL",
        "BriefDescription": "Attributable L2 data or unified TLB refill"
    },
    {
        "PublicDescription": "Attributable L2 data or unified TLB access. This event counts on any access to the L2 TLB (caused by a refill of any of the L1 TLBs). This event does not count if the MMU is disabled.",
        "EventCode": "0x2F",
        "EventName": "L2D_TLB",
        "BriefDescription": "Attributable L2 data or unified TLB access"
    },
    {
        "PublicDescription": "Access to data TLB that caused a page table walk. This event counts on any data access which causes L2D_TLB_REFILL to count.",
        "EventCode": "0x34",
        "EventName": "DTLB_WALK",
        "BriefDescription": "Access to data TLB that caused a page table walk."
    },
    {
        "PublicDescription": "Access to instruction TLB that caused a page table walk. This event counts on any instruction access which causes L2D_TLB_REFILL to count.",
        "EventCode": "0x35",
        "EventName": "ITLB_WALK",
        "BriefDescription": "Access to instruction TLB that caused a page table walk."
    },
    {
        "EventCode": "0x36",
        "EventName": "LL_CACHE_RD",
        "BriefDescription": "Last level cache access, read"
    },
    {
        "EventCode": "0x37",
        "EventName": "LL_CACHE_MISS_RD",
        "BriefDescription": "Last level cache miss, read"
    },
    {
        "ArchStdEvent": "L1D_CACHE_INVAL"
    },
    {
        "ArchStdEvent": "L1D_CACHE_RD"
    },
    {
        "ArchStdEvent": "L1D_CACHE_REFILL_INNER"
    },
    {
        "ArchStdEvent": "L1D_CACHE_REFILL_OUTER"
    },
    {
        "ArchStdEvent": "L1D_CACHE_REFILL_RD"
    },
    {
        "ArchStdEvent": "L1D_CACHE_REFILL_WR"
    },
    {
        "ArchStdEvent": "L1D_CACHE_WB_CLEAN"
    },
    {
        "ArchStdEvent": "L1D_CACHE_WB_VICTIM"
    },
    {
        "ArchStdEvent": "L1D_CACHE_WR"
    },
    {
        "ArchStdEvent": "L1D_TLB_RD"
    },
    {
        "ArchStdEvent": "L1D_TLB_REFILL_RD"
    },
    {
        "ArchStdEvent": "L1D_TLB_REFILL_WR"
    },
    {
        "ArchStdEvent": "L1D_TLB_WR"
    },
    {
        "ArchStdEvent": "L2D_CACHE_INVAL"
    },
    {
        "ArchStdEvent": "L2D_CACHE_RD"
    },
    {
        "ArchStdEvent": "L2D_CACHE_REFILL_RD"
    },
    {
        "ArchStdEvent": "L2D_CACHE_REFILL_WR"
    },
    {
        "ArchStdEvent": "L2D_CACHE_WB_CLEAN"
    },
    {
        "ArchStdEvent": "L2D_CACHE_WB_VICTIM"
    },
    {
        "ArchStdEvent": "L2D_CACHE_WR"
    },
    {
        "ArchStdEvent": "L2D_TLB_RD"
    },
    {
        "ArchStdEvent": "L2D_TLB_REFILL_RD"
    },
    {
        "ArchStdEvent": "L2D_TLB_REFILL_WR"
    },
    {
        "ArchStdEvent": "L2D_TLB_WR"
    },
    {
        "ArchStdEvent": "L3D_CACHE_RD"
    }
]
