share/man/man4/man4.loongson/leioc.4
.\"	$OpenBSD: leioc.4,v 1.1 2016/11/17 15:06:16 visa Exp $
.\"
.\" Copyright (c) 2016 Visa Hankala
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: November 17 2016 $
.Dt LEIOC 4 loongson
.Os
.Sh NAME
.Nm leioc
.Nd Loongson 3A low-end IO controller
.Sh SYNOPSIS
.Cd "leioc* at mainbus0"
.Cd "com* at leioc?"
.Sh DESCRIPTION
The
.Nm
driver supports the low-end IO controller present in Loongson 3A CPU packages.
.Pp
The controller provides several IO interfaces:
.Pp
.Bl -dash -compact -offset indent
.It
a conventional
.Xr pci 4
bus
.It
a Low Pin Count
.Pq LPC
bus
.It
a Serial Peripheral Interface
.Pq SPI
bus
.It
16
.Xr gpio 4
pins
.It
two
.Xr com 4
interfaces
.El
.Pp
Currently, only the
.Xr com 4
interfaces are supported by the
.Nm
driver.
.Sh SEE ALSO
.Xr com 4 ,
.Xr mainbus 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.1 .
