share/man/man4/man4.alpha/intro.4
.\"     $OpenBSD: intro.4,v 1.46 2022/03/31 17:27:21 naddy Exp $
.\"     $NetBSD: intro.4,v 1.10 2003/05/06 07:44:54 wiz Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Gregory McGarry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" `AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" Copyright (c) 1983, 1986, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: March 31 2022 $
.Dt INTRO 4 alpha
.Os
.Sh NAME
.Nm intro
.Nd introduction to special files and hardware support
.Sh DESCRIPTION
The manual pages in section 4 describe the special files,
related driver functions, and networking support
available in the system.
In this part of the manual, the SYNOPSIS section of
each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 8
program.
The DIAGNOSTICS section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation;
see
.Xr syslogd 8
for more information.
.Pp
This section contains both devices
which may be configured into the system
and network related information.
The networking support is introduced in
.Xr netintro 4 .
.Sh DEVICE SUPPORT
This section describes the hardware supported on the
Alpha
platform.
Software support for these devices comes in two forms.
A hardware device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then compiled
into the system.
When the resultant system is booted, the autoconfiguration facilities in
the system probe for the device and, if found, enable the software support
for it.
If a device does not respond at autoconfiguration
time, it is not accessible at any time afterwards.
To enable a device which did not autoconfigure,
the system will have to be rebooted.
.Pp
The autoconfiguration system is described in
.Xr autoconf 4 .
A list of the supported hardware and devices is given below.
.Sh SUPPORTED SYSTEMS
.Tn DEC
and
.Tn Compaq
have produced a series of the
.Tn Alpha
.Tn CPU ,
some of which are listed below, along with some systems which contain them.
.Pp
.Qq EV
stands for
.Qq Extended VAX
.Po
or
.Qq Electro Vlassic
.Pc
and the number following is a reference to the
.Tn CMOS
process used to make the chips.
.Qq LCA
stands for Low Cost Alpha, and
.Qq PCA
stands for PC-architecture Alpha.
.Bl -hang -width 9n
.It 21064
.Sy EV4
.Po
100-200
.Tn MHz ,
0.75 micron
.Pc
.Pp
AlphaPC 64
.Pq EB64
.Bl -hang -width 4n
.It Avanti family
.br
Digital's lower-end PCI-based workstations.
.Pp
AlphaStation 200 4/100-166
.Pq Mustang
.br
AlphaStation 400 4/166
.Pq Chinet
.It Pelican family
.br
Low-end
.Tn TURBOchannel
based workstations.
.Pp
DEC 3000/300
.Pq 150 Tn MHz
.Pq Pelican
.br
DEC 3000/300X
.Pq 175 Tn MHz
.Pq Pelican+
.br
DEC 3000/300L
.Pq 100 Tn MHz
.Pq Pelica
.br
DEC 3000/300LX
.Pq 125 Tn MHz
.Pq Pelica+
.It Sandpiper family
.br
High-end
.Tn TURBOchannel
based workstations.
.Pp
DEC 3000/400
.Pq 133 Tn MHz
.Pq Sandpiper
.br
DEC 3000/600
.Pq 175 Tn MHz
.Pq Sandpiper+
.It Flamingo family
.br
High-end
.Tn TURBOchannel
based workstations.
.Pp
DEC 3000/500
.Pq 150 Tn MHz
.Pq Flamingo
.br
DEC 3000/500X
.Pq 200 Tn MHz
.Pq Hot Pink
.br
DEC 3000/800
.Pq 200 Tn MHz
.Pq Flamingo II
.El
.It 21064-A
.Sy EV45
.Po
225-333
.Tn MHz ,
0.50 micron
.Pc
.Pp
DEC 3000/700
.Pq 225 Tn MHz
.Pq Sandpiper45
.br
DEC 3000/900
.Pq 275 Tn MHz
.Pq Flamingo45
.Bl -hang -width 4n
.It Avanti family
.br
Digital's lower-end PCI-based workstations.
.Pp
AlphaStation 200 4/233
.Pq Mustang+
.br
AlphaStation 205 4/133-333
.Pq LX3
.br
AlphaStation 250 4/300
.Pq M3+
.br
AlphaStation 255 4/133-333
.Pq LX3+
.br
AlphaStation 300 4/266
.Pq Melmac
.br
AlphaStation 400 4/233-300
.Pq Avanti
.El
.It 21066
.Sy LCA4
.Po
166-233
.Tn MHz ,
0.75 micron
.Pc
.Bl -hang -width 4n
.It NoName family
.br
Digital's lowest-end family of PCI-based systems.
.Pp
DEC AXPpci33
.Pq NoName
.br
Universal Desktop Box AXPpci166MT
.Pq UDB/Multia
.El
.Pp
21066 evaluation motherboard
.Pq EB66
.It 21066-A
.Sy LCA45
.Po
233
.Tn MHz ,
0.50 micron
.Pc
.Pp
21066-A evaluation motherboard
.Pq EB66+
.It 21068
.Sy LCA4s
.Po
66-233
.Tn MHz ,
0.75 micron
.Pc
.Pp
Universal Desktop Box AXPpci233MT
.Pq UDB/Multia
.It 21164
.Sy EV5
.Po
250-366
.Tn MHz ,
0.50 micron
.Pc
.Bl -hang -width 4n
.It Mikasa family
.br
AlphaServer 1000 5/300
.Pq Pinnacle
.It Noritake family
.br
AlphaServer 1000A 5/300
.Pq Pinnacle
.Pp
21164 evaluation motherboard
.Pq EB164
.El
.It 21164-A
.Sy EV56
.Po
400-766
.Tn MHz ,
0.35 micron, BWX
.Pc
.Bl -hang -width 4n
.It Personal Workstation Pq PWS
.br
PWS 433a/433au
.Pq Miata
.br
PWS 500a/500au
.Pq Miata
.br
PWS 600a/600au
.Pq Miata
.It Mikasa family
.br
AlphaServer 1000 5/333-500
.Pq Primo
.It Noritake family
.br
AlphaServer 1000A 5/333-500
.Pq Primo
.br
AlphaServer 800 5/333-500
.Pq Corelle
.It EB164 family
.br
AlphaPC 164 motherboard
.Pq EB164
.br
AlphaPC 164LX motherboard
.Pq EB164
.El
.Pp
DigitalServer 3300
.Po
rebadged AlphaServer 800 for NT
.Pc
.It 21164-PC
.Sy PCA56
.Po
400-600
.Tn MHz ,
0.35 micron, MVI, no L2 cache
.Pc
.Pp
AlphaPC 164SX motherboard
.Pq EB164
.Pp
PWS 466au
.Pq Miata
.br
PWS 550au
.Pq Miata
.It 21264
.Sy EV6
.Po
450-600
.Tn MHz ,
0.35 micron
.Pc
.Pp
APi UP1000 and UP1100;
AMD 751-based EV6 systems.
.Pp
264DP, XP1000, DS10, DS20
Tsunami-based systems.
.It 21264-A
.Sy EV67
.Po
600-833
.Tn MHz ,
0.28 micron
.Pc
.El
.Sh LIST OF DEVICES
A complete list of available devices is contained within the pages
describing the system buses and controllers.
For example, a PCI device would be listed in the
.Xr pci 4
man page.
The following buses and controllers list these devices:
.Pp
.Bl -tag -width "cardbus(4)XX" -offset 3n -compact
.It Xr eisa 4
introduction to EISA bus support
.It Xr iic 4
Inter IC (I2C) bus
.It Xr isa 4
introduction to ISA bus support
.It Xr onewire 4
1-Wire bus
.It Xr pci 4
introduction to PCI bus support
.It Xr usb 4
introduction to Universal Serial Bus support
.El
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr config 8
.Sh HISTORY
The
Alpha
.Nm intro
first appeared in
.Ox 2.3 .
