libexec/reorder_kernel/bsd.re-config.5
.\"	$OpenBSD: bsd.re-config.5,v 1.3 2025/05/31 10:49:42 kn Exp $
.\"
.\" Copyright (c) 2021 Paul de Weerd <weerd@weirdnet.nl>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 31 2025 $
.Dt BSD.RE-CONFIG 5
.Os
.Sh NAME
.Nm bsd.re-config
.Nd kernel configuration file
.Sh DESCRIPTION
The
.Nm
file contains kernel modification commands in
.Xr config 8
format.
If present, it is used during system startup to configure the kernel
that will be running at the next boot.
It can be used to enable or disable specific devices in the kernel.
.Sh FILES
.Bl -tag -width /etc/bsd.re-config -compact
.It Pa /etc/bsd.re-config
Kernel configuration file.
.El
.Sh EXAMPLES
To enable the
.Xr ipmi 4
driver, add the following line to
.Nm :
.Pp
.Dl enable ipmi
.Sh SEE ALSO
.Xr config 8
