usr.sbin/rpc.lockd/rpc.lockd.8
.\"	$OpenBSD: rpc.lockd.8,v 1.13 2008/06/13 23:56:28 jmc Exp $
.\"
.\" Copyright (c) 1995 A.R.Gordon, andrew.gordon@net-tel.co.uk
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.Dd $Mdocdate: June 13 2008 $
.Dt RPC.LOCKD 8
.Os
.Sh NAME
.Nm rpc.lockd
.Nd NFS file locking daemon
.Sh SYNOPSIS
.Nm rpc.lockd
.Op Fl d Op Ar debug_level
.Op Fl g Ar grace_period
.Sh DESCRIPTION
.Nm rpc.lockd
is a daemon which provides file- and record-locking services in an NFS
environment.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl d Op Ar debug_level
Write debugging information to syslog, recording
all RPC transactions to the daemon.
These messages are logged with level
.Dv LOG_DEBUG
and facility
.Dv LOG_DAEMON .
If
.Ar debug_level
is not specified,
level 1 is assumed, giving one log line per protocol operation.
Higher debug levels can be specified, causing display of operation arguments
and internal operations of the daemon.
.It Fl g Ar grace_period
Specify the grace period, in seconds.
During the grace period
.Nm
only accepts requests from hosts which are reinitialising locks which
existed before the server restart.
The default is 30 seconds.
.El
.Pp
Error conditions are logged to syslog, irrespective of the debug level,
using log level
.Dv LOG_ERR
and facility
.Dv LOG_DAEMON .
.Pp
The
.Nm rpc.lockd
daemon must NOT be invoked by
.Xr inetd 8
because the protocol assumes that the daemon will run from system start time.
Instead, it should be run from
.Xr rc 8
after the network has been started.
.Sh FILES
.Bl -tag -width /usr/include/rpcsvc/nlm_prot.x -compact
.It Pa /usr/include/rpcsvc/nlm_prot.x
RPC protocol specification for the network lock manager protocol.
.El
.Sh SEE ALSO
.Xr syslog 3 ,
.Xr rc 8
.Sh STANDARDS
The implementation is based on the specification in X/Open CAE Specification
C218, "Protocols for X/Open PC Interworking: XNFS, Issue 4", ISBN 1 872630 66 9
.Sh BUGS
The current implementation provides only the server side of the protocol
(i.e., clients running other OS types can establish locks on an
.Ox
fileserver,
but there is currently no means for an
.Ox
client to establish locks).
.Pp
The current implementation serialises lock requests that could be shared.
