/*
 * Misc utility routines for accessing chip-specific features
 * of the BOOKER NCI (non coherent interconnect) based Broadcom chips.
 *
 * Broadcom Proprietary and Confidential. Copyright (C) 2020,
 * All Rights Reserved.
 *
 * This is UNPUBLISHED PROPRIETARY SOURCE CODE of Broadcom;
 * the contents of this file may not be disclosed to third parties,
 * copied or duplicated in any form, in whole or in part, without
 * the prior written permission of Broadcom.
 *
 *
 * <<Broadcom-WL-IPTag/Proprietary:>>
 */

#include <typedefs.h>
#include <hndsoc.h>
#include <sbchipc.h>
#include <pcicfg.h>
#include <pcie_core.h>
#include "siutils_priv.h"
#include <nci.h>
#include <bcmdevs.h>
#include <hndoobr.h>

#define NCI_BAD_REG			0xbbadd000u	/* Bad Register Address */
#define NCI_BAD_INDEX			-1		/* Bad Index */

#define OOBR_BASE_MASK			0x00001FFFu	/* Mask to get Base address of OOBR */
#define EROM1_BASE_MASK			0x00000FFFu	/* Mask to get Base address of EROM1 */

/* Core Info */
#define COREINFO_COREID_MASK		0x00000FFFu	/* Bit-11 to 0 */
#define COREINFO_REV_MASK		0x000FF000u	/* Core Rev Mask */
#define COREINFO_REV_SHIFT		12u		/* Bit-12 */
#define COREINFO_MFG_MASK		0x00F00000u	/* Core Mfg Mask */
#define COREINFO_MFG_SHIFT		20u		/* Bit-20 */
#define COREINFO_BPID_MASK		0x07000000u	/* 26-24 Gives Backplane ID */
#define COREINFO_BPID_SHIFT		24u		/* Bit:26-24 */
#define COREINFO_ISBP_MASK		0x08000000u	/* Is Backplane or Bridge */
#define COREINFO_ISBP_SHIFT		27u		/* Bit:27 */


#define COREINFO_BPID(core_info)	(((core_info) & COREINFO_BPID_MASK) >> COREINFO_BPID_SHIFT)
#define IS_BACKPLANE(core_info)		(((core_info) & COREINFO_ISBP_MASK) >> COREINFO_ISBP_SHIFT)
#define ID_BPID(iface_desc_1)		(((iface_desc_1) & ID_BPID_MASK) >> ID_BPID_SHIFT)
#define IS_BACKPLANE_ID_SAME(core_info, iface_desc_1) \
					(COREINFO_BPID((core_info)) == ID_BPID((iface_desc_1)))

#define NCI_WORD_SIZE			(4u)
#define PCI_ACCESS_SIZE			(4u)

#define NCI_ADDR2NUM(addr)		((uintptr)(addr))
#define NCI_ADD_NUM(addr, size)		(NCI_ADDR2NUM(addr) + (size))
#ifdef DONGLEBUILD
#define NCI_ADD_ADDR(addr, size)	((uint32*)REG_MAP(NCI_ADD_NUM((addr), (size)), 0u))
#else /* !DONGLEBUILD */
#define NCI_ADD_ADDR(addr, size)	((uint32*)(NCI_ADD_NUM((addr), (size))))
#endif /* DONGLEBUILD */
#define NCI_INC_ADDR(addr, size)	((addr) = NCI_ADD_ADDR((addr), (size)))

#define NODE_TYPE_BOOKER		0x0u
#define NODE_TYPE_NIC400		0x1u

#define BP_BOOKER			0x0u
#define BP_NIC400			0x1u
#define BP_APB1				0x2u
#define BP_APB2				0x3u
#define BP_CCI400			0x4u

#define PCIE_WRITE_SIZE			4u

static const char BACKPLANE_ID_NAME[][11] = {
	"BOOKER",
	"NIC400",
	"APB1",
	"APB2",
	"CCI400",
	"\0"
};

#define APB_INF(ifd)	((ID_BPID((ifd).iface_desc_1) == BP_APB1) || \
	(ID_BPID((ifd).iface_desc_1) == BP_APB2))
#define BOOKER_INF(ifd)	(ID_BPID((ifd).iface_desc_1) == BP_BOOKER)
#define NIC_INF(ifd)	(ID_BPID((ifd).iface_desc_1) == BP_NIC400)

/* BOOKER NCI LOG LEVEL */
#define NCI_LOG_LEVEL_ERROR		0x1u
#define NCI_LOG_LEVEL_TRACE		0x2u
#define NCI_LOG_LEVEL_INFO		0x4u
#define NCI_LOG_LEVEL_PRINT		0x8u

#ifndef NCI_DEFAULT_LOG_LEVEL
#define NCI_DEFAULT_LOG_LEVEL	(NCI_LOG_LEVEL_ERROR)
#endif /* NCI_DEFAULT_LOG_LEVEL */

uint32 nci_log_level = NCI_DEFAULT_LOG_LEVEL;

#ifdef DONGLEBUILD
#define NCI_ERROR(args) do { if (nci_log_level & NCI_LOG_LEVEL_ERROR) { printf args; } } while (0u)
#define NCI_TRACE(args) do { if (nci_log_level & NCI_LOG_LEVEL_TRACE) { printf args; } } while (0u)
#define NCI_INFO(args)  do { if (nci_log_level & NCI_LOG_LEVEL_INFO) { printf args; } } while (0u)
#define NCI_PRINT(args) do { if (nci_log_level & NCI_LOG_LEVEL_PRINT) { printf args; } } while (0u)
#else /* !DONGLEBUILD */
#define NCI_KERN_PRINT(...) printk(KERN_ERR __VA_ARGS__)
#define NCI_ERROR(args) do { if (nci_log_level & NCI_LOG_LEVEL_ERROR) \
		{ NCI_KERN_PRINT args; } } while (0u)
#define NCI_TRACE(args) do { if (nci_log_level & NCI_LOG_LEVEL_TRACE) \
		{ NCI_KERN_PRINT args; } } while (0u)
#define NCI_INFO(args)  do { if (nci_log_level & NCI_LOG_LEVEL_INFO) \
		{ NCI_KERN_PRINT args; } } while (0u)
#define NCI_PRINT(args)  do { if (nci_log_level & NCI_LOG_LEVEL_PRINT) \
			{ NCI_KERN_PRINT args; } } while (0u)
#endif /* DONGLEBUILD */

#define NCI_EROM_WORD_SIZEOF		4u
#define NCI_REGS_PER_CORE		2u

#define NCI_EROM1_LEN(erom2base)	(erom2base - GET_EROM1_BASE(erom2base))
#define NCI_NONOOBR_CORES(erom2base)	NCI_EROM1_LEN(erom2base) \
						/(NCI_REGS_PER_CORE * NCI_EROM_WORD_SIZEOF)

/* AXI ID to CoreID + unit mappings */
typedef struct nci_axi_to_coreidx {
	uint coreid;
	uint coreunit;
} nci_axi_to_coreidx_t;

static const nci_axi_to_coreidx_t axi2coreidx_4397[] = {
	{CC_CORE_ID, 0},	 /* 00 Chipcommon */
	{PCIE2_CORE_ID, 0},	/* 01 PCIe */
	{D11_CORE_ID, 0},	/* 02 D11 Main */
	{ARMCR4_CORE_ID, 0},	/* 03 ARM */
	{BT_CORE_ID, 0},	/* 04 BT AHB */
	{D11_CORE_ID, 1},	/* 05 D11 Aux */
	{D11_CORE_ID, 0},	/* 06 D11 Main l1 */
	{D11_CORE_ID, 1},	/* 07 D11 Aux  l1 */
	{D11_CORE_ID, 0},	/* 08 D11 Main l2 */
	{D11_CORE_ID, 1},	/* 09 D11 Aux  l2 */
	{NODEV_CORE_ID, 0},	/* 10 M2M DMA */
	{NODEV_CORE_ID, 0},	/* 11 unused */
	{NODEV_CORE_ID, 0},	/* 12 unused */
	{NODEV_CORE_ID, 0},	/* 13 unused */
	{NODEV_CORE_ID, 0},	/* 14 unused */
	{NODEV_CORE_ID, 0}	/* 15 unused */
};

typedef struct slave_port {
	uint32		adesc;		/**< Address Descriptor 0 */
	uint32		addrl;		/**< Lower Base */
	uint32		addrh;		/**< Upper Base */
	uint32		extaddrl;	/**< Lower Bound */
	uint32		extaddrh;	/**< Ubber Bound */
} slave_port_t;

typedef struct interface_desc {
	slave_port_t	*sp;		/**< Slave Port Addr 0-3 */

	uint32		iface_desc_0;	/**< Interface-0 Descriptor Word0 */
	/* If Node Type 0-Booker xMNI/xSNI address. If Node Type 1-DMP wrapper Address */
	uint32		node_ptr;	/**< Core's Node pointer */

	uint32		iface_desc_1;	/**< Interface Descriptor Word1 */
	uint8		num_addr_reg;	/**< Number of Slave Port Addr (Valid only if master=0) */
	uint8		coretype;	/**< Core Belongs to 0:OOBR 1:Without OOBR */
	uint8		master;		/**< 1:Master 0:Slave */

	uint8		node_type;	/**< 0:Booker , 1:IDM Wrapper, 2-0xf: Reserved */
} interface_desc_t;

typedef struct nci_cores {
	void		*regs;
	/* 2:0-Node type (0-booker,1-IDM Wrapper) 31:3-Interconnect registyer space */
	interface_desc_t *desc;		/**< Interface & Address Descriptors */
	/*
	 * 11:0-CoreID, 19:12-RevID 23:20-MFG 26:24-Backplane ID if
	 * bit 27 is 1 (Core is Backplane or Bridge )
	 */
	uint32		coreinfo;	/**< CoreInfo of each core */
	/*
	 * 11:0 - Offosewt of 1st Interface desc in EROM 15:12 - No.
	 * of interfaces attachedto this core
	 */
	uint32		iface_cfg;	/**< Interface config Reg */
	uint32		dmp_regs_off;	/**< DMP control & DMP status @ 0x48 from coreinfo */
	uint32		coreid;		/**< id of each core */
	uint8		coreunit;	/**< Unit differentiate same coreids */
	uint8		iface_cnt;	/**< no of Interface connected to each core */
	uint8		PAD[2u];
} nci_cores_t;

typedef struct nci_info {
	void		*osh;		/**< osl os handle */
	nci_cores_t	*cores;		/**< Cores Parsed */
	void		*pci_bar_addr;	/**< PCI BAR0 Window */
	uint32		cc_erom2base;	/**< Base of EROM2 from ChipCommon */
	uint32		*erom1base;	/**< Base of EROM1 */
	uint32		*erom2base;	/**< Base of EROM2 */
	uint32		*oobr_base;	/**< Base of OOBR */
	uint16		bustype;	/**< SI_BUS, PCI_BUS */
	uint8		max_cores;	/**< # Max cores indicated by Register */
	uint8		num_cores;	/**< # discovered cores */
	uint8		refcnt;		/**< Allocation reference count  */
	uint8		scan_done;	/**< Set to TRUE when erom scan is done. */
	uint8		PAD[2];
} nci_info_t;

#define NI_IDM_RESET_ENTRY 0x1
#define NI_IDM_RESET_EXIT  0x0

/* AXI Slave Network Interface registers */
typedef volatile struct asni_regs {
	uint32 node_type;	/* 0x000 */
	uint32 node_info;	/* 0x004 */
	uint32 secr_acc;	/* 0x008 */
	uint32 pmusela;		/* 0x00c */
	uint32 pmuselb;		/* 0x010 */
	uint32 PAD[11];
	uint32 node_feat;	/* 0x040 */
	uint32 bursplt;		/* 0x044 */
	uint32 addr_remap;	/* 0x048 */
	uint32 PAD[13];
	uint32 sildbg;		/* 0x080 */
	uint32 qosctl;		/* 0x084 */
	uint32 wdatthrs;	/* 0x088 */
	uint32 arqosovr;	/* 0x08c */
	uint32 awqosovr;	/* 0x090 */
	uint32 atqosot;		/* 0x094 */
	uint32 arqosot;		/* 0x098 */
	uint32 awqosot;		/* 0x09c */
	uint32 axqosot;		/* 0x0a0 */
	uint32 qosrdpk;		/* 0x0a4 */
	uint32 qosrdbur;	/* 0x0a8 */
	uint32 qosrdavg;	/* 0x0ac */
	uint32 qoswrpk;		/* 0x0b0 */
	uint32 qoswrbur;	/* 0x0b4 */
	uint32 qoswravg;	/* 0x0b8 */
	uint32 qoscompk;	/* 0x0bc */
	uint32 qoscombur;	/* 0x0c0 */
	uint32 qoscomavg;	/* 0x0c4 */
	uint32 qosrbbqv;	/* 0x0c8 */
	uint32 qoswrbqv;	/* 0x0cc */
	uint32 qoscombqv;	/* 0x0d0 */
	uint32 PAD[11];
	uint32 idm_device_id;	/* 0x100 */
	uint32 PAD[15];
	uint32 idm_reset_ctrl;	/* 0x140 */
} asni_regs_t;

/* AXI Master Network Interface registers */
typedef volatile struct amni_regs {
	uint32 node_type;		/* 0x000 */
	uint32 node_info;		/* 0x004 */
	uint32 secr_acc;		/* 0x008 */
	uint32 pmusela;			/* 0x00c */
	uint32 pmuselb;			/* 0x010 */
	uint32 PAD[11];
	uint32 node_feat;		/* 0x040 */
	uint32 PAD[15];
	uint32 sildbg;			/* 0x080 */
	uint32 qosacc;			/* 0x084 */
	uint32 PAD[26];
	uint32 interrupt_status;	/* 0x0f0 */
	uint32 interrupt_mask;		/* 0x0f4 */
	uint32 interrupt_status_ns;	/* 0x0f8 */
	uint32 interrupt_mask_ns;	/* 0x0FC */
	uint32 idm_device_id;		/* 0x100 */
	uint32 PAD[15];
	uint32 idm_reset_ctrl;		/* 0x140 */
} amni_regs_t;

#define NCI_SPINWAIT_TIMEOUT		(300u)

/* DMP/io control and DMP/io status */
typedef struct dmp_regs {
	uint32 dmpctrl;
	uint32 dmpstatus;
} dmp_regs_t;

#ifdef _RTE_
static nci_info_t *knci_info = NULL;
#endif /* _RTE_ */

static void nci_save_iface1_reg(interface_desc_t *desc, uint32 iface_desc_1);
static uint32* nci_save_slaveport_addr(nci_info_t *nci,
	interface_desc_t *desc, uint32 *erom2ptr);
static int nci_get_coreunit(nci_cores_t *cores, uint32 numcores, uint cid,
	uint32 iface_desc_1);
static nci_cores_t* nci_initial_parse(nci_info_t *nci, uint32 *erom2ptr, uint32 *core_idx);
static void _nci_setcoreidx_pcie_bus(si_t *sih, volatile void **regs, uint32 curmap,
	uint32 curwrap);
static volatile void *_nci_setcoreidx(si_t *sih, uint coreidx);
static uint32 _nci_get_curwrap(nci_info_t *nci, uint coreidx, uint wrapper_idx);
static uint32 nci_get_curwrap(nci_info_t *nci, uint coreidx);
