/*	$OpenBSD: r92creg.h,v 1.31 2024/09/01 03:14:48 jsg Exp $	*/

/*-
 * Copyright (c) 2010 Damien Bergamini <damien.bergamini@free.fr>
 * Copyright (c) 2015 Stefan Sperling <stsp@openbsd.org>
 *
 * Permission to use, copy, modify, and distribute this software for any
 * purpose with or without fee is hereby granted, provided that the above
 * copyright notice and this permission notice appear in all copies.
 *
 * THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
 * WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
 * ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
 * WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
 * ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
 * OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
 */

#define R92C_MAX_CHAINS	2
#define R92C_MAX_TX_PWR	0x3f
#define R92C_H2C_NBOX	4

/*
 * MAC registers.
 */
/* System Configuration. */
#define R92C_SYS_ISO_CTRL		0x000
#define R92C_SYS_FUNC_EN		0x002
#define R92C_APS_FSMCO			0x004
#define R92C_SYS_CLKR			0x008
#define R92C_AFE_MISC			0x010
#define R92C_SPS0_CTRL			0x011
#define R92C_SYS_SWR_CTRL2		0x014
#define R92C_SPS_OCP_CFG		0x018
#define R92C_RSV_CTRL			0x01c
#define R92C_RF_CTRL			0x01f
#define R92C_LDOA15_CTRL		0x020
#define R92C_LDOV12D_CTRL		0x021
#define R92C_LDOHCI12_CTRL		0x022

#define R92C_USB_SPECIAL_OPTION_AGG_EN		0x08
#define R92C_USB_SPECIAL_OPTION_INT_BULK_SEL	0x10

/* Bits for R92C_USB_EP. */
#define R92C_USB_EP_HQ_M	0x000f
#define R92C_USB_EP_HQ_S	0
#define R92C_USB_EP_NQ_M	0x00f0
#define R92C_USB_EP_NQ_S	4
#define R92C_USB_EP_LQ_M	0x0f00
#define R92C_USB_EP_LQ_S	8

/*
 * Firmware base address.
 */
#define R92C_FW_START_ADDR	0x1000
#define R92C_FW_PAGE_SIZE	4096


/*
 * RF (6052) registers.
 */
#define R92C_RF_AC		0x00
#define R92C_RF_IQADJ_G(i)	(0x01 + (i))
#define R92C_RF_POW_TRSW	0x05
#define R92C_RF_GAIN_RX		0x06
#define R92C_RF_GAIN_TX		0x07
#define R92C_RF_TXM_IDAC	0x08
#define R92C_RF_BS_IQGEN	0x0f
#define R92C_RF_MODE1		0x10
#define R92C_RF_MODE2		0x11
#define R92C_RF_RX_AGC_HP	0x12
#define R92C_RF_TX_AGC		0x13
#define R92C_RF_BIAS		0x14
#define R92C_RF_IPA		0x15
#define R92C_RF_POW_ABILITY	0x17
#define R92C_RF_CHNLBW		0x18
#define R92C_RF_RX_G1		0x1a
#define R92C_RF_RX_G2		0x1b
#define R92C_RF_RX_BB2		0x1c
#define R92C_RF_RX_BB1		0x1d
#define R92C_RF_RCK1		0x1e
#define R92C_RF_RCK2		0x1f
#define R92C_RF_TX_G(i)		(0x20 + (i))
#define R92C_RF_TX_BB1		0x23
#define R92C_RF_T_METER		0x24
#define R92C_RF_SYN_G(i)	(0x25 + (i))
#define R92C_RF_RCK_OS		0x30
#define R92C_RF_TXPA_G(i)	(0x31 + (i))
#define R92E_RF_T_METER		0x42

/* Bits for R92C_RF_AC. */
#define R92C_RF_AC_MODE_M	0x70000
#define R92C_RF_AC_MODE_S	16
#define R92C_RF_AC_MODE_STANDBY	1

/* Bits for R92C_RF_CHNLBW. */
#define R92C_RF_CHNLBW_CHNL_M	0x003ff
#define R92C_RF_CHNLBW_CHNL_S	0
#define R92C_RF_CHNLBW_BW20	0x00400
#define R88E_RF_CHNLBW_BW20	0x00c00
#define R92C_RF_CHNLBW_LCSTART	0x08000


/*
 * CAM entries.
 */
#define R92C_CAM_ENTRY_COUNT	32

#define R92C_CAM_CTL0(entry)	((entry) * 8 + 0)
#define R92C_CAM_CTL1(entry)	((entry) * 8 + 1)
#define R92C_CAM_KEY(entry, i)	((entry) * 8 + 2 + (i))

/* Bits for R92C_CAM_CTL0(i). */
#define R92C_CAM_KEYID_M	0x00000003
#define R92C_CAM_KEYID_S	0
#define R92C_CAM_ALGO_M		0x0000001c
#define R92C_CAM_ALGO_S		2
#define R92C_CAM_ALGO_NONE	0
#define R92C_CAM_ALGO_WEP40	1
#define R92C_CAM_ALGO_TKIP	2
#define R92C_CAM_ALGO_AES	4
#define R92C_CAM_ALGO_WEP104	5
#define R92C_CAM_VALID		0x00008000
#define R92C_CAM_MACLO_M	0xffff0000
#define R92C_CAM_MACLO_S	16

/* Rate adaptation modes. */
#define R92C_RAID_11GN	1
#define R92C_RAID_11N	3
#define R92C_RAID_11BG	4
#define R92C_RAID_11G	5	/* "pure" 11g */
#define R92C_RAID_11B	6

#define R92E_RAID_11BG	6
#define R92E_RAID_11G	7	/* "pure" 11g */
#define R92E_RAID_11B	8


/* Macros to access unaligned little-endian memory. */
#define LE_READ_2(x)	((x)[0] | (x)[1] << 8)
#define LE_READ_4(x)	((x)[0] | (x)[1] << 8 | (x)[2] << 16 | (x)[3] << 24)

/*
 * Macros to access subfields in registers.
 */
/* Mask and Shift (getter). */
#define MS(val, field)							\
	(((val) & field##_M) >> field##_S)

/* Shift and Mask (setter). */
#define SM(field, val)							\
	(((val) << field##_S) & field##_M)

/* Rewrite. */
#define RW(var, field, val)						\
	(((var) & ~field##_M) | SM(field, val))

/*
 * Firmware image header.
 */
struct r92c_fw_hdr {
	/* QWORD0 */
	uint16_t	signature;
	uint8_t		category;
	uint8_t		function;
	uint16_t	version;
	uint16_t	subversion;
	/* QWORD1 */
	uint8_t		month;
	uint8_t		date;
	uint8_t		hour;
	uint8_t		minute;
	uint16_t	ramcodesize;
	uint16_t	reserved2;
	/* QWORD2 */
	uint32_t	svnidx;
	uint32_t	reserved3;
	/* QWORD3 */
	uint32_t	reserved4;
	uint32_t	reserved5;
} __packed;

/*
 * Host to firmware commands.
 */
struct r92c_fw_cmd {
	uint8_t	id;
#define R92C_CMD_AP_OFFLOAD		0
#define R92C_CMD_SET_PWRMODE		1
#define R92C_CMD_JOINBSS_RPT		2
#define R92C_CMD_RSVD_PAGE		3
#define R92C_CMD_RSSI			4
#define R92C_CMD_RSSI_SETTING		5
#define R92C_CMD_MACID_CONFIG		6
#define R92C_CMD_MACID_PS_MODE		7
#define R92C_CMD_P2P_PS_OFFLOAD		8
#define R92C_CMD_SELECTIVE_SUSPEND	9
#define R92C_CMD_FLAG_EXT		0x80

	uint8_t	msg[5];
} __packed;

/* Structure for R92C_CMD_RSSI_SETTING. */
struct r92c_fw_cmd_rssi {
	uint8_t	macid;
	uint8_t	reserved;
	uint8_t	pwdb;
} __packed;

/* Structure for R92C_CMD_MACID_CONFIG. */
struct r92c_fw_cmd_macid_cfg {
	uint32_t	mask;
	uint8_t		macid;
#define R92C_MACID_BSS		0
#define R92C_MACID_BC		4	/* Broadcast. */
#define R92C_MACID_VALID	0x80
#define R92C_MACID_SHORTGI	0x20
} __packed;

/* Structure for R92C_CMD_SET_PWRMODE. */
struct r92c_fw_cmd_setpwrmode {
	uint8_t		mode;
	uint8_t		smartps;
	uint8_t		bcn_time;	/* 100ms increments */
} __packed;

#define R92E_CMD_KEEP_ALIVE	0x03
#define R92E_CMD_SET_PWRMODE	0x20
#define R92E_CMD_RSSI_REPORT	0x42

/* Structure for R92E_CMD_KEEP_ALIVE. */
struct r92e_fw_cmd_keepalive {
	uint8_t		mode;
	uint8_t		period;
} __packed;

/* Structure for R92E_CMD_SET_PWRMODE. */
struct r92e_fw_cmd_setpwrmode {
	uint8_t		mode;
#define FWMODE_ACTIVE		0
#define FWMODE_LOW_POWER	1
#define FWMODE_WMMPS		2
	uint8_t		smartps;
#define SRTPS_LOW_POWER		0
#define SRTPS_POLL		0x10
#define SRTPS_WMMPS		0x20
	uint8_t		awake_int;	/* 100ms increments. */
	uint8_t		all_queue_apsd;
	uint8_t		pwr_state;
#define PS_PFOFF		0x00
#define PS_RFON			0x04
#define PS_ALLON		0x0c
} __packed;

/* Structure for R92E_CMD_RSSI_REPORT. */
struct r92e_fw_cmd_rssi {
	uint8_t		macid;
	uint8_t		reserved;
	uint8_t		pwdb;
	uint8_t		reserved2;
} __packed;

/*
 * RTL8192CU ROM image.
 */
struct r92c_rom {
	uint16_t	id;		/* 0x8129 */
	uint8_t		reserved1[5];
	uint8_t		dbg_sel;
	uint16_t	reserved2;
	uint16_t	vid;
	uint16_t	pid;
	uint8_t		usb_opt;
	uint8_t		ep_setting;
	uint16_t	reserved3;
	uint8_t		usb_phy;
	uint8_t		reserved4[3];
	uint8_t		macaddr[IEEE80211_ADDR_LEN];
	uint8_t		string[61];	/* "Realtek" */
	uint8_t		subcustomer_id;
	uint8_t		cck_tx_pwr[R92C_MAX_CHAINS][3];
	uint8_t		ht40_1s_tx_pwr[R92C_MAX_CHAINS][3];
	uint8_t		ht40_2s_tx_pwr_diff[3];
	uint8_t		ht20_tx_pwr_diff[3];
	uint8_t		ofdm_tx_pwr_diff[3];
	uint8_t		ht40_max_pwr[3];
	uint8_t		ht20_max_pwr[3];
	uint8_t		channel_plan;
	uint8_t		tssi[R92C_MAX_CHAINS];
	uint8_t		thermal_meter;
	uint8_t		rf_opt1;
#define R92C_ROM_RF1_REGULATORY_M	0x07
#define R92C_ROM_RF1_REGULATORY_S	0
#define R92C_ROM_RF1_BOARD_TYPE_M	0xe0
#define R92C_ROM_RF1_BOARD_TYPE_S	5
#define R92C_BOARD_TYPE_DONGLE		0
#define R92C_BOARD_TYPE_HIGHPA		1
#define R92C_BOARD_TYPE_MINICARD	2
#define R92C_BOARD_TYPE_SOLO		3
#define R92C_BOARD_TYPE_COMBO		4

	uint8_t		rf_opt2;
	uint8_t		rf_opt3;
	uint8_t		rf_opt4;
	uint8_t		reserved5;
	uint8_t		version;
	uint8_t		customer_id;
} __packed;

struct r92e_tx_pwr {
	uint8_t		cck_tx_pwr[6];
	uint8_t		ht40_tx_pwr[5];
	uint8_t		ht20_ofdm_tx_pwr_diff;
#define R92E_ROM_TXPWR_HT20_DIFF_M	0xf0
#define R92E_ROM_TXPWR_HT20_DIFF_S	4
#define R92E_ROM_TXPWR_OFDM_DIFF_M	0x0f
#define R92E_ROM_TXPWR_OFDM_DIFF_S	0

	struct {
		uint8_t ht40_ht20_tx_pwr_diff;
#define R92E_ROM_TXPWR_HT40_DIFF_M	0xf0
#define R92E_ROM_TXPWR_HT40_DIFF_S	4
#define R92E_ROM_TXPWR_HT20_2S_DIFF_M	0x0f
#define R92E_ROM_TXPWR_HT20_2S_DIFF_S	0

		uint8_t ofdm_cck_tx_pwr_diff;
	} __packed pwr_diff[3];

	uint8_t		reserved[24];
} __packed;

struct r92e_rom {
	uint16_t	id;
	uint8_t		reserved[14];
	struct r92e_tx_pwr txpwr_a;
	struct r92e_tx_pwr txpwr_b;
	uint8_t		reserved2[84];
	uint8_t		channel_plan;
	uint8_t		xtal_k;
	uint8_t		thermal_meter;
	uint8_t		iqk_lck;
	uint8_t		pa_type;
	uint8_t		lna_type_2g;
	uint8_t		reserved3;
	uint8_t		lna_type_5g;
	uint8_t		reserved4;
	uint8_t		rf_board_opt;
	uint8_t		rf_feature_opt;
	uint8_t		rf_bt_opt;
	uint8_t		eeprom_version;
	uint8_t		eeprom_customer_id;
	uint8_t		reserved5[3];
	uint8_t		rf_antenna_option;
	uint8_t		reserved6[6];
	uint16_t	vid;
	uint16_t	pid;
	uint8_t		usb_optional_function;
	uint8_t		reserved9[2];
	uint8_t		macaddr[IEEE80211_ADDR_LEN];
	uint8_t		reserved10[2];
	uint8_t		vendor[7];
	uint8_t		reserved11[2];
	uint8_t		device_name[11];
	uint8_t		reserved12[2];
	uint8_t		serial[11];
	uint8_t		reserved13[48];
	uint8_t		unknown[13];
	uint8_t		reserved14[195];
} __packed;

struct r88e_tx_pwr {
	uint8_t		cck_tx_pwr[6];
	uint8_t		ht40_tx_pwr[5];
	uint8_t		ht20_ofdm_tx_pwr_diff;
#define R88E_ROM_TXPWR_HT20_DIFF_M	0xf0
#define R88E_ROM_TXPWR_HT20_DIFF_S	4
#define R88E_ROM_TXPWR_OFDM_DIFF_M	0x0f
#define R88E_ROM_TXPWR_OFDM_DIFF_S	0

} __packed;

/*
 * RTL8188E ROM images.
 */
struct r88e_rom {
	uint16_t		id;
	uint8_t			reserved1[14];
	struct r88e_tx_pwr	txpwr;
	uint8_t			reserved2[156];
	uint8_t			channel_plan;
	uint8_t			xtal;
	uint8_t			thermal_meter;
	uint8_t			reserved3[6];
	uint8_t			rf_board_opt;
	uint8_t			rf_feature_opt;
	uint8_t			rf_bt_opt;
	uint8_t			version;
	uint8_t			customer_id;
	uint8_t			reserved4[3];
	uint8_t			rf_ant_opt;
	uint8_t			reserved5[6];
	union {
#define r88ee_rom	u.r88ee
		struct {
			uint8_t		macaddr[IEEE80211_ADDR_LEN];
			uint16_t	vid;
			uint16_t	did;
			uint16_t	svid;
			uint16_t	smid;
			uint8_t		reserved6[290];
		} __packed r88ee;

#define r88eu_rom	u.r88eu
		struct {
			uint16_t	vid;
			uint16_t	pid;
			uint8_t		usb_opt;
			uint8_t		reserved6[2];
			uint8_t		macaddr[IEEE80211_ADDR_LEN];
			uint8_t		reserved7[2];
			uint8_t		string[33];	/* "Realtek" */
			uint8_t		reserved8[256];
		} __packed r88eu;
	} u;
} __packed;

/*
 * RTL8188FTV ROM image.
 */
struct r88f_rom {
	uint16_t		id;
	uint8_t			reserved1[14];
	struct r88e_tx_pwr	txpwr;
	uint8_t			reserved2[156];
	uint8_t			channel_plan;
	uint8_t			xtal;
	uint8_t			thermal_meter;
	uint8_t			iqk_lck;
	uint8_t			pa_type;
	uint8_t			lna_type_2g;
	uint8_t			reserved3[3];
	uint8_t			rf_board_opt;
	uint8_t			rf_feature_opt;
	uint8_t			rf_bt_opt;
	uint8_t			eeprom_version;
	uint8_t			eeprom_customer_id;
	uint8_t			reserved4[10];
	uint16_t		vid;
	uint16_t		pid;
	uint8_t			usb_optional_function;
	uint8_t			reserved5[2];
	uint8_t			macaddr[IEEE80211_ADDR_LEN];
	uint8_t			reserved6[291];
} __packed;

/*
 * RTL8723A ROM images.
 */
struct r23a_rom {
	uint16_t		id;		/* 0x8129 */	/* 0x00 */
	uint8_t			reserved[14];			/* 0x02 */

	uint8_t			tx_pwr_cck_a[3];		/* 0x10 */
	uint8_t			tx_pwr_cck_b[3];		/* 0x13 */
	uint8_t			tx_pwr_ht40_1s_a[3];		/* 0x16 */
	uint8_t			tx_pwr_ht40_1s_b[3];		/* 0x19 */
	uint8_t			tx_pwr_ht20_diff[3];		/* 0x1c */
	uint8_t			tx_pwr_ofdm_diff[3];		/* 0x1f */

	uint8_t			ht40_max_pwr_offset[3];		/* 0x22 */
	uint8_t			ht20_max_pwr_offset[3];		/* 0x25 */
	uint8_t			channel_plan;			/* 0x28 */
	uint8_t			tssi_a;				/* 0x29 */
	uint8_t			thermal_meter;			/* 0x2a */
	uint8_t			reserved2[5];			/* 0x2b */

	uint8_t			version;			/* 0x30 */
	uint8_t			customer_id;			/* 0x31 */
	uint8_t			customer_id_min;		/* 0x32 */
	uint8_t			reserved3[22];			/* 0x33 */

	uint16_t		vid;				/* 0x49 */
	uint16_t		did;				/* 0x4b */
	uint16_t		svid;				/* 0x4d */
	uint16_t		smid;				/* 0x4f */

	uint8_t			reserved4[3];			/* 0x51 */
	uint8_t			pwr_diff;			/* 0x54 */
	uint8_t			reserved5[5];			/* 0x55 */
	uint8_t			cck_tx_pwr;			/* 0x5a */
	uint8_t			reserved6[5];			/* 0x5b */

	uint8_t			ht40_1s_tx_pwr;			/* 0x60 */
	uint8_t			reserved7[5];
	uint8_t			ht40_2s_tx_pwr_diff;		/* 0x66 */
	uint8_t			macaddr[IEEE80211_ADDR_LEN];	/* 0x67 */
	uint8_t			reserved8[10];			/* 0x6d */

	uint8_t			tssi_b;				/* 0x77 */
	uint8_t			xtal_k;				/* 0x78 */
	uint8_t			rf_opt1;			/* 0x79 */
	uint8_t			rf_opt2;			/* 0x7a */
	uint8_t			rf_opt3;			/* 0x7b */
	uint8_t			rf_opt4;			/* 0x7c */
	uint8_t			reserved9[131];			/* 0x7d */
} __packed;

/* Rx PHY descriptor. */
struct r92c_rx_phystat {
	uint32_t	phydw0;
	uint32_t	phydw1;
	uint32_t	phydw2;
	uint32_t	phydw3;
	uint32_t	phydw4;
	uint32_t	phydw5;
	uint32_t	phydw6;
	uint32_t	phydw7;
} __packed __attribute__((aligned(4)));

/* Rx PHY CCK descriptor. */
struct r92c_rx_cck {
	uint8_t		adc_pwdb[4];
	uint8_t		sq_rpt;
	uint8_t		agc_rpt;
} __packed;

/* Tx report (type 1). */
struct r88e_tx_rpt_ccx {
	uint8_t		rptb0;
#define R88E_RPTB6_PKT_NUM_M	0x0e
#define R88E_RPTB6_PKT_NUM_S	1
#define R88E_RPTB0_INT_CCX	0x80

	uint8_t		rptb1;
#define R88E_RPTB1_MACID_M	0x3f
#define R88E_RPTB1_MACID_S	0
#define R88E_RPTB1_PKT_OK	0x40
#define R88E_RPTB1_BMC		0x80

	uint8_t		rptb2;
#define R88E_RPTB2_RETRY_CNT_M	0x3f
#define R88E_RPTB2_RETRY_CNT_S	0
#define R88E_RPTB2_LIFE_EXPIRE	0x40
#define R88E_RPTB2_RETRY_OVER	0x80

	uint8_t		queue_time_low;
	uint8_t		queue_time_high;
	uint8_t		final_rate;
	uint8_t		rptb6;
#define R88E_RPTB6_QSEL_M	0xf0
