share/man/man5/qmake-module.5
.\"	$OpenBSD: qmake-module.5,v 1.4 2022/11/27 15:27:17 kn Exp $
.\"
.\" Copyright (c) 2008 Marc Espie
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: November 27 2022 $
.Dt QMAKE-MODULE 5
.Os
.Sh NAME
.Nm qmake-module
.Nd devel/qmake port module
.Sh DESCRIPTION
This manual page documents the behavior of setting
.Li MODULES=devel/qmake
in the
.Xr ports 7
tree.
.Pp
This module automates usage of qmake, independently of the actual
version of Qt being used.
This module requires that one of the
.Pa x11/qt*
to be used as well.
.Pp
If
.Ev CONFIGURE_STYLE
was not set before, sets its value to
.Sq qmake .
If
.Ev CONFIGURE_STYLE
contains
.Sq qmake
the module will define each of the
.Ar do-build
and
.Ar do-install
targets, unless port already defines one; also,
.Ev SEPARATE_BUILD
will be set to
.Sq Yes
unless it's already set to some value.
Also, unless
.Ev NO_TEST
is set, the
.Ar do-test
target will be defined.
.Pp
The following variables could be used in qmake-based ports:
.Bl -tag -width 1234
.It Ev MODQMAKE_ARGS
Additional arguments for qmake invocation.
The module already defines some.
.It Ev MODQMAKE_INSTALL_ROOT
Root directory for fake install.
Normally, it's a WRKINST, but some (broken) ports require another value,
like PREFIX.
.It Ev MODQMAKE_PROJECTS
List of qmake project files to be used, relative to WRKSRC.
Directories containing those projects could be used as well,
see qmake documentation for details.
Defaults to
.Sq \&. ,
which means the (only) project in WRKSRC directory.
.It Ev MODQMAKE_RECURSIVE
If
.Sq Yes ,
then qmake will be run recursively during configure stage;
otherwise, only projects mentioned in
.Ev MODQMAKE_PROJECTS
will be processed during configure stage, and their descendants will
be visited during main build phase.
Sometimes a qmake project processing depends on files generated
by other qmake project during build, and recursive builds break this.
Defaults to
.Sq Yes .
.It Ev MODQMAKE_build
Actual commands that module will use to build all
.Ev MODQMAKE_PROJECTS
provided.
To be used in complicated cases, when port have to use its own
.Ar do-build
target or mix different
.Ev CONFIGURE_STYLE
values.
.It Ev MODQMAKE_install
Same as for
.Ev MODQMAKE_build ,
but used in
.Ar do-install
stage.
.El
.Sh SEE ALSO
.Xr port-modules 5
