[
    {
        "CollectPEBSRecord": "1",
        "PublicDescription": "Counts the number of issue slots per core cycle that were not consumed because of a full resource in the backend.  Including but not limited to resources such as the Re-order Buffer (ROB), reservation stations (RS), load/store buffers, physical registers, or any other needed machine resource that is currently unavailable.   Note that uops must be available for consumption in order for this event to fire.  If a uop is not available (Instruction Queue is empty), this event will not count.",
        "EventCode": "0xCA",
        "Counter": "0,1,2,3",
        "UMask": "0x1",
        "EventName": "ISSUE_SLOTS_NOT_CONSUMED.RESOURCE_FULL",
        "SampleAfterValue": "200003",
        "BriefDescription": "Unfilled issue slots per cycle because of a full resource in the backend"
    },
    {
        "CollectPEBSRecord": "1",
        "PublicDescription": "Counts the number of issue slots per core cycle that were not consumed by the backend because allocation is stalled waiting for a mispredicted jump to retire or other branch-like conditions (e.g. the event is relevant during certain microcode flows).   Counts all issue slots blocked while within this window including slots where uops were not available in the Instruction Queue.",
        "EventCode": "0xCA",
        "Counter": "0,1,2,3",
        "UMask": "0x2",
        "EventName": "ISSUE_SLOTS_NOT_CONSUMED.RECOVERY",
        "SampleAfterValue": "200003",
        "BriefDescription": "Unfilled issue slots per cycle to recover"
    },
    {
        "CollectPEBSRecord": "1",
        "PublicDescription": "Counts the number of issue slots per core cycle that were not consumed by the backend due to either a full resource  in the backend (RESOURCE_FULL) or due to the processor recovering from some event (RECOVERY).",
        "EventCode": "0xCA",
        "Counter": "0,1,2,3",
        "UMask": "0x0",
        "EventName": "ISSUE_SLOTS_NOT_CONSUMED.ANY",
        "SampleAfterValue": "200003",
        "BriefDescription": "Unfilled issue slots per cycle"
    },
    {
        "CollectPEBSRecord": "2",
        "PublicDescription": "Counts hardware interrupts received by the processor.",
        "EventCode": "0xCB",
        "Counter": "0,1,2,3",
        "UMask": "0x1",
        "EventName": "HW_INTERRUPTS.RECEIVED",
        "SampleAfterValue": "200003",
        "BriefDescription": "Hardware interrupts received (Precise event capable)"
    },
    {
        "CollectPEBSRecord": "2",
        "PublicDescription": "Counts core cycles during which there are pending interrupts, but interrupts are masked (EFLAGS.IF = 0).",
        "EventCode": "0xCB",
        "Counter": "0,1,2,3",
        "UMask": "0x4",
        "EventName": "HW_INTERRUPTS.PENDING_AND_MASKED",
        "SampleAfterValue": "200003",
        "BriefDescription": "Cycles pending interrupts are masked (Precise event capable)"
    }
]