lib/libc/sys/closefrom.2
.\"	$OpenBSD: closefrom.2,v 1.10 2019/05/31 18:36:58 cheloha Exp $
.\"
.\" Copyright (c) 2004 Ted Unangst.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.Dd $Mdocdate: May 31 2019 $
.Dt CLOSEFROM 2
.Os
.Sh NAME
.Nm closefrom
.Nd delete many descriptors
.Sh SYNOPSIS
.In unistd.h
.Ft int
.Fn closefrom "int fd"
.Sh DESCRIPTION
The
.Fn closefrom
call deletes all descriptors numbered
.Fa fd
and higher from the per-process file descriptor table.
It is effectively the same as calling
.Xr close 2
on each descriptor.
.Sh RETURN VALUES
.Rv -std
.Sh ERRORS
.Fn closefrom
will fail if:
.Bl -tag -width Er
.It Bq Er EBADF
.Fa fd
is greater than all open file descriptors.
.It Bq Er EINTR
An interrupt was received.
.El
.Sh SEE ALSO
.Xr close 2
.Sh STANDARDS
.Fn closefrom
is a
.Bx
and Solaris extension.
.Sh HISTORY
The
.Fn closefrom
function first appeared in Solaris 9 and has been available since
.Ox 3.5 .
