lib/libc/sys/sched_yield.2
.\"	$OpenBSD: sched_yield.2,v 1.1 2014/11/14 00:24:28 guenther Exp $
.\"
.\" Copyright (c) 2014 Philip Guenther <guenther@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: November 14 2014 $
.Dt SCHED_YIELD 2
.Os
.Sh NAME
.Nm sched_yield
.Nd yield the processor
.Sh SYNOPSIS
.In sched.h
.Ft int
.Fn sched_yield void
.Sh DESCRIPTION
The
.Fn sched_yield
function makes the current thread yield the processor and be put at
the end of its run queue without altering its priority.
.Sh RETURN VALUES
.Rv -std
.Sh STANDARDS
The
.Fn sched_yield
function conforms to
.St -p1003.1-2008 .
.Sh HISTORY
The
.Fn sched_yield
system call appeared in
.Ox 4.2 .
.Sh CAVEATS
The effect of
.Fn sched_yield
is only precisely defined for real-time scheduling classes,
none of which are currently supported by
.Ox .
