lib/libc/sys/sysarch.2
.\"	$OpenBSD: sysarch.2,v 1.11 2015/09/10 17:55:21 schwarze Exp $
.\"	$NetBSD: sysarch.2,v 1.4 1995/02/27 12:38:47 cgd Exp $
.\"
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)syscall.2	6.3 (Berkeley) 3/10/91
.\"
.Dd $Mdocdate: September 10 2015 $
.Dt SYSARCH 2
.Os
.Sh NAME
.Nm sysarch
.Nd architecture-dependent system call
.Sh SYNOPSIS
.In machine/sysarch.h
.Ft int
.Fn sysarch "int number" "void *args"
.Sh DESCRIPTION
.Fn sysarch
performs the architecture-dependent function specified by
.Fa number
with the arguments specified by the
.Fa args
pointer.
.Fa args
is a pointer to a structure defining the actual arguments of the function.
Symbolic constants and argument structures for the architecture-dependent
functions can be found in the header file
.In machine/sysarch.h .
.Pp
The
.Fn sysarch
system call should never be called directly by user programs.
Instead, they should access its functions using the architecture-dependent
library.
.Sh RETURN VALUES
See the manual pages for specific architecture-dependent function calls
for information about their return values.
.Sh HISTORY
The
.Fn sysarch
function call appeared in
.Nx 0.9a .
