usr.sbin/acpidump/acpidump.8
.\"	$OpenBSD: acpidump.8,v 1.19 2020/11/22 17:10:06 jmc Exp $
.\"
.\" Copyright (c) 1999 Doug Rabson <dfr@FreeBSD.org>
.\" Copyright (c) 2000 Mitsuru IWASAKI <iwasaki@FreeBSD.org>
.\" Copyright (c) 2000 Yasuo YOKOYAMA <yokoyama@jp.FreeBSD.org>
.\" Copyright (c) 2000 Hiroki Sato <hrs@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: src/usr.sbin/acpi/acpidump/acpidump.8,v 1.9 2001/09/05 19:21:25 dd Exp $
.\"
.Dd $Mdocdate: November 22 2020 $
.Dt ACPIDUMP 8
.Os
.Sh NAME
.Nm acpidump
.Nd dump ACPI tables
.Sh SYNOPSIS
.Nm
.Fl o Ar prefix
.Sh DESCRIPTION
The
.Nm
command stores ACPI tables from physical memory into files specified by
.Ar prefix .
If
.Ar prefix
specifies a directory, the generated files will be of the form
<prefix>/<sig>.<id>.
Otherwise, they will be named <prefix>.<sig>.<id>.
.Dq sig
is the signature of the ACPI Table;
.Dq id
is unique for each table.
.Pp
Additionally a file called <prefix>/headers or <prefix>.headers will
be created that contains additional human readable information
pertaining to this specific dump.
.Pp
The ACPICA disassembler is available through the
.Ox
ports tree or package system:
.Bd -literal -offset indent
# pkg_add acpica
$ iasl -d <prefix>.<sig>.<id>
.Ed
.Pp
.Nm
requires the ability to open
.Pa /dev/kmem ,
which may be restricted based upon the value of the
.Ar kern.allowkmem
.Xr sysctl 8 .
.Pp
.Nm
is run at startup and stores the results in
.Pa /var/db/acpi .
.Sh FILES
.Bl -tag -width /dev/mem
.It Pa /dev/mem
.It Pa /var/db/acpi
.El
.Sh SEE ALSO
.Xr pkg_add 1 ,
.Xr mem 4 ,
.Xr packages 7 ,
.Xr ports 7
.Sh HISTORY
The
.Nm
command first appeared in
.Ox 3.8 .
