share/man/man4/man4.i386/pas.4
.\"   $OpenBSD: pas.4,v 1.2 2007/05/31 19:19:55 jmc Exp $
.\"
.\" Copyright (c) 2006 JASON MCINTYRE <jmc@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt PAS 4 i386
.Os
.Sh NAME
.Nm pas
.Nd Media Vision Pro AudioSpectrum audio device
.Sh SYNOPSIS
.Cd "pas0 at isa? port 0x220 irq 7 drq 1"
.Cd "audio* at pas?"
.Sh DESCRIPTION
The
.Nm
driver provides support for second generation
Media Vision Pro AudioSpectrum
sound cards.
These cards contain an MVD101 multimedia chip.
.Pp
The following cards are supported:
.Bd -literal -offset indent
CDPC
Fusion CD
Fusion CD 16
PAS 16
PAS Plus
.Ed
.Sh SEE ALSO
.Xr audio 4 ,
.Xr intro 4 ,
.Xr isa 4
