/*
********************************************************************************
**        OS    : FreeBSD
**   FILE NAME  : arcmsr.h
**        BY    : Erich Chen, Ching Huang
**   Description: SCSI RAID Device Driver for 
**                ARECA (ARC11XX/ARC12XX/ARC13XX/ARC16XX/ARC188x)
**                SATA/SAS RAID HOST Adapter
********************************************************************************
********************************************************************************
** SPDX-License-Identifier: BSD-3-Clause
**
** Copyright (C) 2002 - 2012, Areca Technology Corporation All rights reserved.
**
** Redistribution and use in source and binary forms,with or without
** modification,are permitted provided that the following conditions
** are met:
** 1. Redistributions of source code must retain the above copyright
**    notice,this list of conditions and the following disclaimer.
** 2. Redistributions in binary form must reproduce the above copyright
**    notice,this list of conditions and the following disclaimer in the
**    documentation and/or other materials provided with the distribution.
** 3. The name of the author may not be used to endorse or promote products
**    derived from this software without specific prior written permission.
**
** THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
** IMPLIED WARRANTIES,INCLUDING,BUT NOT LIMITED TO,THE IMPLIED WARRANTIES

#define PCIDevVenIDARC1222              0x122217D3 /* Vendor Device ID	*/
#define PCIDevVenIDARC1223              0x122317D3 /* Vendor Device ID	*/
#define PCIDevVenIDARC1230              0x123017D3 /* Vendor Device ID	*/
#define PCIDevVenIDARC1231              0x123117D3 /* Vendor Device ID	*/
#define PCIDevVenIDARC1260              0x126017D3 /* Vendor Device ID	*/
#define PCIDevVenIDARC1261              0x126117D3 /* Vendor Device ID	*/
#define PCIDevVenIDARC1270              0x127017D3 /* Vendor Device ID	*/
#define PCIDevVenIDARC1280              0x128017D3 /* Vendor Device ID	*/
#define PCIDevVenIDARC1380              0x138017D3 /* Vendor Device ID	*/
#define PCIDevVenIDARC1381              0x138117D3 /* Vendor Device ID	*/
#define PCIDevVenIDARC1680              0x168017D3 /* Vendor Device ID	*/
#define PCIDevVenIDARC1681              0x168117D3 /* Vendor Device ID	*/
#define PCIDevVenIDARC1880              0x188017D3 /* Vendor Device ID	*/
#define PCIDevVenIDARC1882              0x188217D3 /* Vendor Device ID	*/
#define PCIDevVenIDARC1884              0x188417D3 /* Vendor Device ID	*/

#ifndef PCIR_BARS
	#define PCIR_BARS	0x10
	#define	PCIR_BAR(x)	(PCIR_BARS + (x) * 4)
#endif

#define PCI_BASE_ADDR0                  0x10
#define PCI_BASE_ADDR1                  0x14
#define PCI_BASE_ADDR2                  0x18
#define PCI_BASE_ADDR3                  0x1C
#define PCI_BASE_ADDR4                  0x20
#define PCI_BASE_ADDR5                  0x24
/*
**********************************************************************************
**
**********************************************************************************
*/
#define ARCMSR_SCSICMD_IOCTL            0x77
#define ARCMSR_CDEVSW_IOCTL             0x88
#define ARCMSR_MESSAGE_FAIL             0x0001
#define	ARCMSR_MESSAGE_SUCCESS          0x0000
/*
**********************************************************************************
**
**********************************************************************************
*/
#define arcmsr_ccbsrb_ptr	spriv_ptr0
#define arcmsr_ccbacb_ptr	spriv_ptr1
#define dma_addr_hi32(addr)	(u_int32_t) ((addr>>16)>>16)
#define dma_addr_lo32(addr)	(u_int32_t) (addr & 0xffffffff)
#define get_min(x,y)		((x) < (y) ? (x) : (y))
#define get_max(x,y)		((x) < (y) ? (y) : (x))
/*
**************************************************************************
**************************************************************************
*/
#define CHIP_REG_READ32(s, b, r)	bus_space_read_4(acb->btag[b], acb->bhandle[b], offsetof(struct s, r))
#define CHIP_REG_WRITE32(s, b, r, d)	bus_space_write_4(acb->btag[b], acb->bhandle[b], offsetof(struct s, r), d)
#define READ_CHIP_REG32(b, r)		bus_space_read_4(acb->btag[b], acb->bhandle[b], r)
#define WRITE_CHIP_REG32(b, r, d)	bus_space_write_4(acb->btag[b], acb->bhandle[b], r, d)
/*
**********************************************************************************
**    IOCTL CONTROL Mail Box
**********************************************************************************
*/
struct CMD_MESSAGE {
      u_int32_t HeaderLength;
      u_int8_t Signature[8];
      u_int32_t Timeout;
      u_int32_t ControlCode;
      u_int32_t ReturnCode;
      u_int32_t Length;
};

struct CMD_MESSAGE_FIELD {
    struct CMD_MESSAGE cmdmessage; /* ioctl header */
    u_int8_t           messagedatabuffer[1032]; /* areca gui program does not accept more than 1031 byte */
};

/************************************************************************/
/************************************************************************/

#define ARCMSR_IOP_ERROR_ILLEGALPCI		0x0001
#define ARCMSR_IOP_ERROR_VENDORID		0x0002
#define ARCMSR_IOP_ERROR_DEVICEID		0x0002
#define ARCMSR_IOP_ERROR_ILLEGALCDB		0x0003
#define ARCMSR_IOP_ERROR_UNKNOW_CDBERR		0x0004
#define ARCMSR_SYS_ERROR_MEMORY_ALLOCATE	0x0005
#define ARCMSR_SYS_ERROR_MEMORY_CROSS4G		0x0006
#define ARCMSR_SYS_ERROR_MEMORY_LACK		0x0007
#define ARCMSR_SYS_ERROR_MEMORY_RANGE		0x0008
#define ARCMSR_SYS_ERROR_DEVICE_BASE		0x0009
#define ARCMSR_SYS_ERROR_PORT_VALIDATE		0x000A

/*DeviceType*/
#define ARECA_SATA_RAID                      	0x90000000

/*FunctionCode*/
#define FUNCTION_READ_RQBUFFER               	0x0801
#define FUNCTION_WRITE_WQBUFFER              	0x0802
#define FUNCTION_CLEAR_RQBUFFER              	0x0803
#define FUNCTION_CLEAR_WQBUFFER              	0x0804
#define FUNCTION_CLEAR_ALLQBUFFER            	0x0805
#define FUNCTION_REQUEST_RETURNCODE_3F         	0x0806
#define FUNCTION_SAY_HELLO                   	0x0807
#define FUNCTION_SAY_GOODBYE                    0x0808
#define FUNCTION_FLUSH_ADAPTER_CACHE           	0x0809
/*
************************************************************************
**      IOCTL CONTROL CODE
************************************************************************
*/
/* ARECA IO CONTROL CODE*/
#define ARCMSR_MESSAGE_READ_RQBUFFER           	_IOWR('F', FUNCTION_READ_RQBUFFER, struct CMD_MESSAGE_FIELD)
#define ARCMSR_MESSAGE_WRITE_WQBUFFER          	_IOWR('F', FUNCTION_WRITE_WQBUFFER, struct CMD_MESSAGE_FIELD)
#define ARCMSR_MESSAGE_CLEAR_RQBUFFER          	_IOWR('F', FUNCTION_CLEAR_RQBUFFER, struct CMD_MESSAGE_FIELD)
#define ARCMSR_MESSAGE_CLEAR_WQBUFFER          	_IOWR('F', FUNCTION_CLEAR_WQBUFFER, struct CMD_MESSAGE_FIELD)
#define ARCMSR_MESSAGE_CLEAR_ALLQBUFFER        	_IOWR('F', FUNCTION_CLEAR_ALLQBUFFER, struct CMD_MESSAGE_FIELD)
#define ARCMSR_MESSAGE_REQUEST_RETURNCODE_3F   	_IOWR('F', FUNCTION_REQUEST_RETURNCODE_3F, struct CMD_MESSAGE_FIELD)
#define ARCMSR_MESSAGE_SAY_HELLO               	_IOWR('F', FUNCTION_SAY_HELLO, struct CMD_MESSAGE_FIELD) 
#define ARCMSR_MESSAGE_SAY_GOODBYE              _IOWR('F', FUNCTION_SAY_GOODBYE, struct CMD_MESSAGE_FIELD)
#define ARCMSR_MESSAGE_FLUSH_ADAPTER_CACHE      _IOWR('F', FUNCTION_FLUSH_ADAPTER_CACHE, struct CMD_MESSAGE_FIELD)

/* ARECA IOCTL ReturnCode */
#define ARCMSR_MESSAGE_RETURNCODE_OK		0x00000001
#define ARCMSR_MESSAGE_RETURNCODE_ERROR		0x00000006
#define ARCMSR_MESSAGE_RETURNCODE_3F		0x0000003F
#define ARCMSR_IOCTL_RETURNCODE_BUS_HANG_ON	0x00000088
/* 
************************************************************************
**                SPEC. for Areca HBA adapter
************************************************************************
*/
/* signature of set and get firmware config */
#define ARCMSR_SIGNATURE_GET_CONFIG		0x87974060
#define ARCMSR_SIGNATURE_SET_CONFIG		0x87974063
/* message code of inbound message register */
#define ARCMSR_INBOUND_MESG0_NOP		0x00000000
#define ARCMSR_INBOUND_MESG0_GET_CONFIG		0x00000001
#define ARCMSR_INBOUND_MESG0_SET_CONFIG		0x00000002
#define ARCMSR_INBOUND_MESG0_ABORT_CMD		0x00000003
#define ARCMSR_INBOUND_MESG0_STOP_BGRB		0x00000004
#define ARCMSR_INBOUND_MESG0_FLUSH_CACHE	0x00000005
#define ARCMSR_INBOUND_MESG0_START_BGRB		0x00000006
#define ARCMSR_INBOUND_MESG0_CHK331PENDING	0x00000007
#define ARCMSR_INBOUND_MESG0_SYNC_TIMER		0x00000008
/* doorbell interrupt generator */
#define ARCMSR_INBOUND_DRIVER_DATA_WRITE_OK	0x00000001
#define ARCMSR_INBOUND_DRIVER_DATA_READ_OK	0x00000002
#define ARCMSR_OUTBOUND_IOP331_DATA_WRITE_OK	0x00000001
#define ARCMSR_OUTBOUND_IOP331_DATA_READ_OK	0x00000002
/* srb areca cdb flag */
#define ARCMSR_SRBPOST_FLAG_SGL_BSIZE		0x80000000
#define ARCMSR_SRBPOST_FLAG_IAM_BIOS		0x40000000
#define ARCMSR_SRBREPLY_FLAG_IAM_BIOS		0x40000000
#define ARCMSR_SRBREPLY_FLAG_ERROR		0x10000000
#define ARCMSR_SRBREPLY_FLAG_ERROR_MODE0        0x10000000
#define ARCMSR_SRBREPLY_FLAG_ERROR_MODE1	0x00000001
/* outbound firmware ok */
#define ARCMSR_OUTBOUND_MESG1_FIRMWARE_OK	0x80000000

#define ARCMSR_ARC1680_BUS_RESET		0x00000003
/* 
************************************************************************
**                SPEC. for Areca HBB adapter
************************************************************************
*/
/* ARECA HBB COMMAND for its FIRMWARE */
#define ARCMSR_DRV2IOP_DOORBELL                 0x00020400    /* window of "instruction flags" from driver to iop */
#define ARCMSR_DRV2IOP_DOORBELL_MASK            0x00020404
#define ARCMSR_IOP2DRV_DOORBELL                 0x00020408    /* window of "instruction flags" from iop to driver */
#define ARCMSR_IOP2DRV_DOORBELL_MASK            0x0002040C

#define ARCMSR_IOP2DRV_DOORBELL_1203            0x00021870    /* window of "instruction flags" from iop to driver */
#define ARCMSR_IOP2DRV_DOORBELL_MASK_1203       0x00021874
#define ARCMSR_DRV2IOP_DOORBELL_1203            0x00021878    /* window of "instruction flags" from driver to iop */
#define ARCMSR_DRV2IOP_DOORBELL_MASK_1203       0x0002187C

/* ARECA FLAG LANGUAGE */
#define ARCMSR_IOP2DRV_DATA_WRITE_OK            0x00000001        /* ioctl transfer */
#define ARCMSR_IOP2DRV_DATA_READ_OK             0x00000002        /* ioctl transfer */
#define ARCMSR_IOP2DRV_CDB_DONE                 0x00000004
#define ARCMSR_IOP2DRV_MESSAGE_CMD_DONE         0x00000008

#define ARCMSR_DOORBELL_HANDLE_INT		0x0000000F
#define ARCMSR_DOORBELL_INT_CLEAR_PATTERN       0xFF00FFF0
#define ARCMSR_MESSAGE_INT_CLEAR_PATTERN        0xFF00FFF7

#define ARCMSR_MESSAGE_GET_CONFIG		0x00010008	/* (ARCMSR_INBOUND_MESG0_GET_CONFIG<<16)|ARCMSR_DRV2IOP_MESSAGE_CMD_POSTED) */
#define ARCMSR_MESSAGE_SET_CONFIG		0x00020008	/* (ARCMSR_INBOUND_MESG0_SET_CONFIG<<16)|ARCMSR_DRV2IOP_MESSAGE_CMD_POSTED) */
#define ARCMSR_MESSAGE_ABORT_CMD		0x00030008	/* (ARCMSR_INBOUND_MESG0_ABORT_CMD<<16)|ARCMSR_DRV2IOP_MESSAGE_CMD_POSTED) */
#define ARCMSR_MESSAGE_STOP_BGRB		0x00040008	/* (ARCMSR_INBOUND_MESG0_STOP_BGRB<<16)|ARCMSR_DRV2IOP_MESSAGE_CMD_POSTED) */
#define ARCMSR_MESSAGE_FLUSH_CACHE              0x00050008	/* (ARCMSR_INBOUND_MESG0_FLUSH_CACHE<<16)|ARCMSR_DRV2IOP_MESSAGE_CMD_POSTED) */
#define ARCMSR_MESSAGE_START_BGRB		0x00060008	/* (ARCMSR_INBOUND_MESG0_START_BGRB<<16)|ARCMSR_DRV2IOP_MESSAGE_CMD_POSTED) */
#define ARCMSR_MESSAGE_START_DRIVER_MODE	0x000E0008	
#define ARCMSR_MESSAGE_SET_POST_WINDOW		0x000F0008	
#define ARCMSR_MESSAGE_ACTIVE_EOI_MODE		0x00100008
#define ARCMSR_MESSAGE_FIRMWARE_OK		0x80000000	/* ARCMSR_OUTBOUND_MESG1_FIRMWARE_OK */

#define ARCMSR_DRV2IOP_DATA_WRITE_OK            0x00000001	/* ioctl transfer */
#define ARCMSR_DRV2IOP_DATA_READ_OK             0x00000002	/* ioctl transfer */
#define ARCMSR_DRV2IOP_CDB_POSTED               0x00000004
#define ARCMSR_DRV2IOP_MESSAGE_CMD_POSTED       0x00000008
#define ARCMSR_DRV2IOP_END_OF_INTERRUPT         0x00000010  /*  */

/* data tunnel buffer between user space program and its firmware */
#define ARCMSR_MSGCODE_RWBUFFER			0x0000fa00    /* iop msgcode_rwbuffer for message command */
#define ARCMSR_IOCTL_WBUFFER			0x0000fe00    /* user space data to iop 128bytes */
#define ARCMSR_IOCTL_RBUFFER			0x0000ff00    /* iop data to user space 128bytes */
#define ARCMSR_HBB_BASE0_OFFSET			0x00000010
#define ARCMSR_HBB_BASE1_OFFSET			0x00000018
#define ARCMSR_HBB_BASE0_LEN			0x00021000
#define ARCMSR_HBB_BASE1_LEN			0x00010000
/* 
************************************************************************
**                SPEC. for Areca HBC adapter
************************************************************************
*/
#define ARCMSR_HBC_ISR_THROTTLING_LEVEL                 12
#define ARCMSR_HBC_ISR_MAX_DONE_QUEUE                   20
/* Host Interrupt Mask */
#define ARCMSR_HBCMU_UTILITY_A_ISR_MASK                 0x00000001 /* When clear, the Utility_A interrupt routes to the host.*/
#define ARCMSR_HBCMU_OUTBOUND_DOORBELL_ISR_MASK         0x00000004 /* When clear, the General Outbound Doorbell interrupt routes to the host.*/
#define ARCMSR_HBCMU_OUTBOUND_POSTQUEUE_ISR_MASK        0x00000008 /* When clear, the Outbound Post List FIFO Not Empty interrupt routes to the host.*/
#define ARCMSR_HBCMU_ALL_INTMASKENABLE                  0x0000000D /* disable all ISR */
/* Host Interrupt Status */
#define ARCMSR_HBCMU_UTILITY_A_ISR                      0x00000001
        /*
        ** Set when the Utility_A Interrupt bit is set in the Outbound Doorbell Register. 
        ** It clears by writing a 1 to the Utility_A bit in the Outbound Doorbell Clear Register or through automatic clearing (if enabled).
        */
#define ARCMSR_HBCMU_OUTBOUND_DOORBELL_ISR              0x00000004
        /*
        ** Set if Outbound Doorbell register bits 30:1 have a non-zero
        ** value. This bit clears only when Outbound Doorbell bits
        ** 30:1 are ALL clear. Only a write to the Outbound Doorbell
        ** Clear register clears bits in the Outbound Doorbell register.
        */
#define ARCMSR_HBCMU_OUTBOUND_POSTQUEUE_ISR             0x00000008
        /*
        ** Set whenever the Outbound Post List Producer/Consumer
        ** Register (FIFO) is not empty. It clears when the Outbound
        ** Post List FIFO is empty.
        */
#define ARCMSR_HBCMU_SAS_ALL_INT                        0x00000010
        /*
        ** This bit indicates a SAS interrupt from a source external to
        ** the PCIe core. This bit is not maskable.
        */
/* DoorBell*/
#define ARCMSR_HBCMU_DRV2IOP_DATA_WRITE_OK                      0x00000002/**/
#define ARCMSR_HBCMU_DRV2IOP_DATA_READ_OK                       0x00000004/**/
#define ARCMSR_HBCMU_DRV2IOP_MESSAGE_CMD_DONE                   0x00000008/*inbound message 0 ready*/
#define ARCMSR_HBCMU_DRV2IOP_POSTQUEUE_THROTTLING               0x00000010/*more than 12 request completed in a time*/
#define ARCMSR_HBCMU_IOP2DRV_DATA_WRITE_OK                      0x00000002/**/
#define ARCMSR_HBCMU_IOP2DRV_DATA_WRITE_DOORBELL_CLEAR          0x00000002/*outbound DATA WRITE isr door bell clear*/
#define ARCMSR_HBCMU_IOP2DRV_DATA_READ_OK                       0x00000004/**/
#define ARCMSR_HBCMU_IOP2DRV_DATA_READ_DOORBELL_CLEAR           0x00000004/*outbound DATA READ isr door bell clear*/
#define ARCMSR_HBCMU_IOP2DRV_MESSAGE_CMD_DONE                   0x00000008/*outbound message 0 ready*/
#define ARCMSR_HBCMU_IOP2DRV_MESSAGE_CMD_DONE_DOORBELL_CLEAR    0x00000008/*outbound message cmd isr door bell clear*/
#define ARCMSR_HBCMU_MESSAGE_FIRMWARE_OK		        0x80000000/*ARCMSR_HBCMU_MESSAGE_FIRMWARE_OK*/
#define ARCMSR_HBCMU_RESET_ADAPTER				0x00000024
#define ARCMSR_HBCMU_DiagWrite_ENABLE				0x00000080

/* 
************************************************************************
**                SPEC. for Areca HBD adapter
************************************************************************
*/
#define ARCMSR_HBDMU_CHIP_ID				0x00004
#define ARCMSR_HBDMU_CPU_MEMORY_CONFIGURATION		0x00008
#define ARCMSR_HBDMU_I2_HOST_INTERRUPT_MASK		0x00034
#define ARCMSR_HBDMU_MAIN_INTERRUPT_STATUS		0x00200
#define ARCMSR_HBDMU_PCIE_F0_INTERRUPT_ENABLE		0x0020C
#define ARCMSR_HBDMU_INBOUND_MESSAGE0			0x00400
#define ARCMSR_HBDMU_INBOUND_MESSAGE1			0x00404
#define ARCMSR_HBDMU_OUTBOUND_MESSAGE0			0x00420
#define ARCMSR_HBDMU_OUTBOUND_MESSAGE1			0x00424
#define ARCMSR_HBDMU_INBOUND_DOORBELL			0x00460
#define ARCMSR_HBDMU_OUTBOUND_DOORBELL			0x00480
#define ARCMSR_HBDMU_OUTBOUND_DOORBELL_ENABLE		0x00484
#define ARCMSR_HBDMU_INBOUND_LIST_BASE_LOW		0x01000
#define ARCMSR_HBDMU_INBOUND_LIST_BASE_HIGH		0x01004
#define ARCMSR_HBDMU_INBOUND_LIST_WRITE_POINTER		0x01018
#define ARCMSR_HBDMU_OUTBOUND_LIST_BASE_LOW		0x01060
#define ARCMSR_HBDMU_OUTBOUND_LIST_BASE_HIGH		0x01064
#define ARCMSR_HBDMU_OUTBOUND_LIST_COPY_POINTER		0x0106C
#define ARCMSR_HBDMU_OUTBOUND_LIST_READ_POINTER		0x01070
#define ARCMSR_HBDMU_OUTBOUND_INTERRUPT_CAUSE		0x01088
#define ARCMSR_HBDMU_OUTBOUND_INTERRUPT_ENABLE		0x0108C

#define ARCMSR_HBDMU_MESSAGE_WBUFFER			0x02000
#define ARCMSR_HBDMU_MESSAGE_RBUFFER			0x02100
#define ARCMSR_HBDMU_MESSAGE_RWBUFFER			0x02200

#define ARCMSR_HBDMU_ISR_THROTTLING_LEVEL		16
#define ARCMSR_HBDMU_ISR_MAX_DONE_QUEUE			20

/* Host Interrupt Mask */
#define ARCMSR_HBDMU_ALL_INT_ENABLE			0x00001010	/* enable all ISR */
#define ARCMSR_HBDMU_ALL_INT_DISABLE			0x00000000	/* disable all ISR */

/* Host Interrupt Status */
#define ARCMSR_HBDMU_OUTBOUND_INT			0x00001010
#define ARCMSR_HBDMU_OUTBOUND_DOORBELL_INT		0x00001000
#define ARCMSR_HBDMU_OUTBOUND_POSTQUEUE_INT		0x00000010

/* DoorBell*/
#define ARCMSR_HBDMU_DRV2IOP_DATA_IN_READY		0x00000001
#define ARCMSR_HBDMU_DRV2IOP_DATA_OUT_READ		0x00000002

#define ARCMSR_HBDMU_IOP2DRV_DATA_WRITE_OK		0x00000001
#define ARCMSR_HBDMU_IOP2DRV_DATA_READ_OK		0x00000002

/*outbound message 0 ready*/
#define ARCMSR_HBDMU_IOP2DRV_MESSAGE_CMD_DONE		0x02000000

#define ARCMSR_HBDMU_F0_DOORBELL_CAUSE			0x02000003

/*outbound message cmd isr door bell clear*/
#define ARCMSR_HBDMU_IOP2DRV_MESSAGE_CMD_DONE_CLEAR	0x02000000

/*outbound list */
#define ARCMSR_HBDMU_OUTBOUND_LIST_INTERRUPT		0x00000001
#define ARCMSR_HBDMU_OUTBOUND_LIST_INTERRUPT_CLEAR	0x00000001

/*ARCMSR_HBAMU_MESSAGE_FIRMWARE_OK*/
#define ARCMSR_HBDMU_MESSAGE_FIRMWARE_OK		0x80000000
/* 
*******************************************************************************
**                SPEC. for Areca HBE adapter
*******************************************************************************
*/
#define ARCMSR_SIGNATURE_1884				0x188417D3
#define ARCMSR_HBEMU_OUTBOUND_DOORBELL_ISR		0x00000001
#define ARCMSR_HBEMU_OUTBOUND_POSTQUEUE_ISR		0x00000008
#define ARCMSR_HBEMU_ALL_INTMASKENABLE			0x00000009 /* disable all ISR */

#define ARCMSR_HBEMU_DRV2IOP_DATA_WRITE_OK		0x00000002
#define ARCMSR_HBEMU_DRV2IOP_DATA_READ_OK		0x00000004
#define ARCMSR_HBEMU_DRV2IOP_MESSAGE_CMD_DONE		0x00000008 /* inbound message 0 ready */
#define ARCMSR_HBEMU_IOP2DRV_DATA_WRITE_OK		0x00000002
#define ARCMSR_HBEMU_IOP2DRV_DATA_READ_OK		0x00000004
#define ARCMSR_HBEMU_IOP2DRV_MESSAGE_CMD_DONE		0x00000008 /* outbound message 0 ready */
#define ARCMSR_HBEMU_MESSAGE_FIRMWARE_OK		0x80000000 /* ARCMSR_HBCMU_MESSAGE_FIRMWARE_OK */
/* ARC-1884 doorbell sync */
#define ARCMSR_HBEMU_DOORBELL_SYNC			0x100
#define ARCMSR_ARC188X_RESET_ADAPTER			0x00000004
/*
*********************************************************************
** Message Unit structure
*********************************************************************
*/
struct HBA_MessageUnit
{
	u_int32_t	resrved0[4];		/*0000 000F*/
	u_int32_t	inbound_msgaddr0;	/*0010 0013*/
	u_int32_t	inbound_msgaddr1;	/*0014 0017*/
	u_int32_t	outbound_msgaddr0;	/*0018 001B*/
	u_int32_t	outbound_msgaddr1;	/*001C 001F*/
	u_int32_t	inbound_doorbell;	/*0020 0023*/
	u_int32_t	inbound_intstatus;	/*0024 0027*/
	u_int32_t	inbound_intmask;	/*0028 002B*/
	u_int32_t	outbound_doorbell;	/*002C 002F*/
	u_int32_t	outbound_intstatus;	/*0030 0033*/
	u_int32_t	outbound_intmask;	/*0034 0037*/
	u_int32_t	reserved1[2];		/*0038 003F*/
	u_int32_t	inbound_queueport;	/*0040 0043*/
	u_int32_t	outbound_queueport;	/*0044 0047*/
	u_int32_t	reserved2[2];		/*0048 004F*/
	u_int32_t	reserved3[492];		/*0050 07FF ......local_buffer 492*/
	u_int32_t	reserved4[128];		/*0800 09FF                    128*/
	u_int32_t	msgcode_rwbuffer[256];	/*0a00 0DFF                    256*/
	u_int32_t	message_wbuffer[32];	/*0E00 0E7F                     32*/
	u_int32_t	reserved5[32];		/*0E80 0EFF                     32*/
	u_int32_t	message_rbuffer[32];	/*0F00 0F7F                     32*/
	u_int32_t	reserved6[32];		/*0F80 0FFF                     32*/
};
/*
*********************************************************************
** 
*********************************************************************
*/
struct HBB_DOORBELL_1203
{
	u_int8_t	doorbell_reserved[ARCMSR_IOP2DRV_DOORBELL_1203]; /*reserved */
	u_int32_t	iop2drv_doorbell;          /*offset 0x00021870:00,01,02,03: window of "instruction flags" from iop to driver */
	u_int32_t	iop2drv_doorbell_mask;     /*                  04,05,06,07: doorbell mask */
	u_int32_t	drv2iop_doorbell;          /*                  08,09,10,11: window of "instruction flags" from driver to iop */
	u_int32_t	drv2iop_doorbell_mask;     /*                  12,13,14,15: doorbell mask */
};
struct HBB_DOORBELL
{
	u_int8_t	doorbell_reserved[ARCMSR_DRV2IOP_DOORBELL]; /*reserved */
	u_int32_t	drv2iop_doorbell;          /*offset 0x00020400:00,01,02,03: window of "instruction flags" from driver to iop */
	u_int32_t	drv2iop_doorbell_mask;     /*                  04,05,06,07: doorbell mask */
	u_int32_t	iop2drv_doorbell;          /*                  08,09,10,11: window of "instruction flags" from iop to driver */
	u_int32_t	iop2drv_doorbell_mask;     /*                  12,13,14,15: doorbell mask */
};
/*
*********************************************************************
** 
*********************************************************************
*/
struct HBB_RWBUFFER
{
	u_int8_t	message_reserved0[ARCMSR_MSGCODE_RWBUFFER];   /*reserved */
	u_int32_t	msgcode_rwbuffer[256];      /*offset 0x0000fa00:   0,   1,   2,   3,...,1023: message code read write 1024bytes */
	u_int32_t	message_wbuffer[32];        /*offset 0x0000fe00:1024,1025,1026,1027,...,1151: user space data to iop 128bytes */
	u_int32_t	message_reserved1[32];      /*                  1152,1153,1154,1155,...,1279: message reserved*/
	u_int32_t	message_rbuffer[32];        /*offset 0x0000ff00:1280,1281,1282,1283,...,1407: iop data to user space 128bytes */ 
};
/*
*********************************************************************
** 
*********************************************************************
*/
struct HBB_MessageUnit
{
	u_int32_t		post_qbuffer[ARCMSR_MAX_HBB_POSTQUEUE];       /* post queue buffer for iop */
	u_int32_t		done_qbuffer[ARCMSR_MAX_HBB_POSTQUEUE];       /* done queue buffer for iop */
	int32_t			postq_index;                                  /* post queue index */
	int32_t			doneq_index;								   /* done queue index */
	struct HBB_DOORBELL    *hbb_doorbell;
	struct HBB_RWBUFFER    *hbb_rwbuffer;
	bus_size_t		drv2iop_doorbell;          /* window of "instruction flags" from driver to iop */
	bus_size_t		drv2iop_doorbell_mask;     /* doorbell mask */
	bus_size_t		iop2drv_doorbell;          /* window of "instruction flags" from iop to driver */
	bus_size_t		iop2drv_doorbell_mask;     /* doorbell mask */
};

/*
*********************************************************************
** 
*********************************************************************
*/
struct HBC_MessageUnit {
	u_int32_t	message_unit_status;                        /*0000 0003*/
	u_int32_t	slave_error_attribute;	                    /*0004 0007*/
	u_int32_t	slave_error_address;	                    /*0008 000B*/
	u_int32_t	posted_outbound_doorbell;	            /*000C 000F*/
	u_int32_t	master_error_attribute;	                    /*0010 0013*/
	u_int32_t	master_error_address_low;	            /*0014 0017*/
	u_int32_t	master_error_address_high;	            /*0018 001B*/
	u_int32_t	hcb_size;                                   /*001C 001F size of the PCIe window used for HCB_Mode accesses*/
	u_int32_t	inbound_doorbell;	                    /*0020 0023*/
	u_int32_t	diagnostic_rw_data;	                    /*0024 0027*/
	u_int32_t	diagnostic_rw_address_low;	            /*0028 002B*/
	u_int32_t	diagnostic_rw_address_high;	            /*002C 002F*/
	u_int32_t	host_int_status;	                    /*0030 0033 host interrupt status*/
	u_int32_t	host_int_mask;     	                    /*0034 0037 host interrupt mask*/
	u_int32_t	dcr_data;	                            /*0038 003B*/
	u_int32_t	dcr_address;                                /*003C 003F*/
	u_int32_t	inbound_queueport;                          /*0040 0043 port32 host inbound queue port*/
	u_int32_t	outbound_queueport;                         /*0044 0047 port32 host outbound queue port*/
	u_int32_t	hcb_pci_address_low;                        /*0048 004B*/
	u_int32_t	hcb_pci_address_high;                       /*004C 004F*/
	u_int32_t	iop_int_status;                             /*0050 0053*/
	u_int32_t	iop_int_mask;                               /*0054 0057*/
	u_int32_t	iop_inbound_queue_port;                     /*0058 005B*/
	u_int32_t	iop_outbound_queue_port;                    /*005C 005F*/
	u_int32_t	inbound_free_list_index;                    /*0060 0063 inbound free list producer consumer index*/
	u_int32_t	inbound_post_list_index;                    /*0064 0067 inbound post list producer consumer index*/
	u_int32_t	outbound_free_list_index;                   /*0068 006B outbound free list producer consumer index*/
	u_int32_t	outbound_post_list_index;                   /*006C 006F outbound post list producer consumer index*/
	u_int32_t	inbound_doorbell_clear;                     /*0070 0073*/
	u_int32_t	i2o_message_unit_control;                   /*0074 0077*/
	u_int32_t	last_used_message_source_address_low;       /*0078 007B*/
	u_int32_t	last_used_message_source_address_high;	    /*007C 007F*/
	u_int32_t	pull_mode_data_byte_count[4];               /*0080 008F pull mode data byte count0..count7*/
	u_int32_t	message_dest_address_index;                 /*0090 0093*/
	u_int32_t	done_queue_not_empty_int_counter_timer;     /*0094 0097*/
	u_int32_t	utility_A_int_counter_timer;                /*0098 009B*/
	u_int32_t	outbound_doorbell;                          /*009C 009F*/
	u_int32_t	outbound_doorbell_clear;                    /*00A0 00A3*/
	u_int32_t	message_source_address_index;               /*00A4 00A7 message accelerator source address consumer producer index*/
	u_int32_t	message_done_queue_index;                   /*00A8 00AB message accelerator completion queue consumer producer index*/
	u_int32_t	reserved0;                                  /*00AC 00AF*/
	u_int32_t	inbound_msgaddr0;                           /*00B0 00B3 scratchpad0*/
	u_int32_t	inbound_msgaddr1;                           /*00B4 00B7 scratchpad1*/
	u_int32_t	outbound_msgaddr0;                          /*00B8 00BB scratchpad2*/
	u_int32_t	outbound_msgaddr1;                          /*00BC 00BF scratchpad3*/
	u_int32_t	inbound_queueport_low;                      /*00C0 00C3 port64 host inbound queue port low*/
	u_int32_t	inbound_queueport_high;                     /*00C4 00C7 port64 host inbound queue port high*/
	u_int32_t	outbound_queueport_low;                     /*00C8 00CB port64 host outbound queue port low*/
	u_int32_t	outbound_queueport_high;                    /*00CC 00CF port64 host outbound queue port high*/
	u_int32_t	iop_inbound_queue_port_low;                 /*00D0 00D3*/
	u_int32_t	iop_inbound_queue_port_high;                /*00D4 00D7*/
	u_int32_t	iop_outbound_queue_port_low;                /*00D8 00DB*/
	u_int32_t	iop_outbound_queue_port_high;               /*00DC 00DF*/
	u_int32_t	message_dest_queue_port_low;                /*00E0 00E3 message accelerator destination queue port low*/
	u_int32_t	message_dest_queue_port_high;               /*00E4 00E7 message accelerator destination queue port high*/
	u_int32_t	last_used_message_dest_address_low;         /*00E8 00EB last used message accelerator destination address low*/
	u_int32_t	last_used_message_dest_address_high;        /*00EC 00EF last used message accelerator destination address high*/
	u_int32_t	message_done_queue_base_address_low;        /*00F0 00F3 message accelerator completion queue base address low*/
	u_int32_t	message_done_queue_base_address_high;       /*00F4 00F7 message accelerator completion queue base address high*/
	u_int32_t	host_diagnostic;                            /*00F8 00FB*/
	u_int32_t	write_sequence;                             /*00FC 00FF*/
	u_int32_t	reserved1[34];                              /*0100 0187*/
	u_int32_t	reserved2[1950];                            /*0188 1FFF*/
	u_int32_t	message_wbuffer[32];                        /*2000 207F*/
	u_int32_t	reserved3[32];                              /*2080 20FF*/
	u_int32_t	message_rbuffer[32];                        /*2100 217F*/
	u_int32_t	reserved4[32];                              /*2180 21FF*/
	u_int32_t	msgcode_rwbuffer[256];                      /*2200 23FF*/
};
/*
*********************************************************************
** 
*********************************************************************
*/
struct InBound_SRB {
	uint32_t addressLow; //pointer to SRB block
	uint32_t addressHigh;
	uint32_t length; // in DWORDs
	uint32_t reserved0;
};

struct OutBound_SRB {
	uint32_t addressLow; //pointer to SRB block
	uint32_t addressHigh;
};

struct HBD_MessageUnit {
	uint32_t reserved0;
	uint32_t chip_id;			//0x0004
	uint32_t cpu_mem_config;		//0x0008
	uint32_t reserved1[10];			//0x000C
	uint32_t i2o_host_interrupt_mask;	//0x0034
	uint32_t reserved2[114];		//0x0038
	uint32_t host_int_status;		//0x0200
	uint32_t host_int_enable;		//0x0204
	uint32_t reserved3[1];			//0x0208
	uint32_t pcief0_int_enable;		//0x020C
	uint32_t reserved4[124];		//0x0210
	uint32_t inbound_msgaddr0;		//0x0400
	uint32_t inbound_msgaddr1;		//0x0404
	uint32_t reserved5[6];			//0x0408
	uint32_t outbound_msgaddr0;		//0x0420
	uint32_t outbound_msgaddr1;		//0x0424
	uint32_t reserved6[14];			//0x0428
	uint32_t inbound_doorbell;		//0x0460
	uint32_t reserved7[7];			//0x0464
	uint32_t outbound_doorbell;		//0x0480
	uint32_t outbound_doorbell_enable;	//0x0484
	uint32_t reserved8[734];		//0x0488
	uint32_t inboundlist_base_low;		//0x1000
	uint32_t inboundlist_base_high;		//0x1004
	uint32_t reserved9[4];			//0x1008
	uint32_t inboundlist_write_pointer;	//0x1018
	uint32_t inboundlist_read_pointer;	//0x101C
	uint32_t reserved10[16];		//0x1020
	uint32_t outboundlist_base_low;		//0x1060
	uint32_t outboundlist_base_high;	//0x1064
	uint32_t reserved11;			//0x1068
	uint32_t outboundlist_copy_pointer;	//0x106C
	uint32_t outboundlist_read_pointer;	//0x1070 0x1072
	uint32_t reserved12[5];			//0x1074
	uint32_t outboundlist_interrupt_cause;	//0x1088
	uint32_t outboundlist_interrupt_enable;	//0x108C
	uint32_t reserved13[988];		//0x1090
	uint32_t message_wbuffer[32];		//0x2000
	uint32_t reserved14[32];		//0x2080
	uint32_t message_rbuffer[32];		//0x2100
	uint32_t reserved15[32];		//0x2180
	uint32_t msgcode_rwbuffer[256];		//0x2200
};

struct HBD_MessageUnit0 {
 	struct InBound_SRB post_qbuffer[ARCMSR_MAX_HBD_POSTQUEUE];
   	struct OutBound_SRB done_qbuffer[ARCMSR_MAX_HBD_POSTQUEUE+1];
	uint16_t postq_index;
	uint16_t doneq_index;
	struct HBD_MessageUnit	*phbdmu;
};
/*
*********************************************************************
** 
*********************************************************************
*/
struct HBE_MessageUnit {
	u_int32_t	iobound_doorbell;                           /*0000 0003*/
	u_int32_t	write_sequence_3xxx;	                    /*0004 0007*/
	u_int32_t	host_diagnostic_3xxx;	                    /*0008 000B*/
	u_int32_t	posted_outbound_doorbell;	            /*000C 000F*/
	u_int32_t	master_error_attribute;	                    /*0010 0013*/
	u_int32_t	master_error_address_low;	            /*0014 0017*/
	u_int32_t	master_error_address_high;	            /*0018 001B*/
	u_int32_t	hcb_size;                                   /*001C 001F*/
	u_int32_t	inbound_doorbell;	                    /*0020 0023*/
	u_int32_t	diagnostic_rw_data;	                    /*0024 0027*/
	u_int32_t	diagnostic_rw_address_low;	            /*0028 002B*/
	u_int32_t	diagnostic_rw_address_high;	            /*002C 002F*/
	u_int32_t	host_int_status;	                    /*0030 0033 host interrupt status*/
	u_int32_t	host_int_mask;     	                    /*0034 0037 host interrupt mask*/
	u_int32_t	dcr_data;	                            /*0038 003B*/
	u_int32_t	dcr_address;                                /*003C 003F*/
	u_int32_t	inbound_queueport;                          /*0040 0043 port32 host inbound queue port*/
	u_int32_t	outbound_queueport;                         /*0044 0047 port32 host outbound queue port*/
	u_int32_t	hcb_pci_address_low;                        /*0048 004B*/
	u_int32_t	hcb_pci_address_high;                       /*004C 004F*/
	u_int32_t	iop_int_status;                             /*0050 0053*/
	u_int32_t	iop_int_mask;                               /*0054 0057*/
	u_int32_t	iop_inbound_queue_port;                     /*0058 005B*/
	u_int32_t	iop_outbound_queue_port;                    /*005C 005F*/
	u_int32_t	inbound_free_list_index;                    /*0060 0063*/
	u_int32_t	inbound_post_list_index;                    /*0064 0067*/
	u_int32_t	outbound_free_list_index;                   /*0068 006B*/
	u_int32_t	outbound_post_list_index;                   /*006C 006F*/
	u_int32_t	inbound_doorbell_clear;                     /*0070 0073*/
	u_int32_t	i2o_message_unit_control;                   /*0074 0077*/
	u_int32_t	last_used_message_source_address_low;       /*0078 007B*/
	u_int32_t	last_used_message_source_address_high;	    /*007C 007F*/
	u_int32_t	pull_mode_data_byte_count[4];               /*0080 008F*/
	u_int32_t	message_dest_address_index;                 /*0090 0093*/
	u_int32_t	done_queue_not_empty_int_counter_timer;     /*0094 0097*/
	u_int32_t	utility_A_int_counter_timer;                /*0098 009B*/
	u_int32_t	outbound_doorbell;                          /*009C 009F*/
	u_int32_t	outbound_doorbell_clear;                    /*00A0 00A3*/
	u_int32_t	message_source_address_index;               /*00A4 00A7*/
	u_int32_t	message_done_queue_index;                   /*00A8 00AB*/
	u_int32_t	reserved0;                                  /*00AC 00AF*/
	u_int32_t	inbound_msgaddr0;                           /*00B0 00B3 scratchpad0*/
	u_int32_t	inbound_msgaddr1;                           /*00B4 00B7 scratchpad1*/
	u_int32_t	outbound_msgaddr0;                          /*00B8 00BB scratchpad2*/
	u_int32_t	outbound_msgaddr1;                          /*00BC 00BF scratchpad3*/
	u_int32_t	inbound_queueport_low;                      /*00C0 00C3 port64 host inbound queue port low*/
	u_int32_t	inbound_queueport_high;                     /*00C4 00C7 port64 host inbound queue port high*/
	u_int32_t	outbound_queueport_low;                     /*00C8 00CB port64 host outbound queue port low*/
	u_int32_t	outbound_queueport_high;                    /*00CC 00CF port64 host outbound queue port high*/
	u_int32_t	iop_inbound_queue_port_low;                 /*00D0 00D3*/
	u_int32_t	iop_inbound_queue_port_high;                /*00D4 00D7*/
	u_int32_t	iop_outbound_queue_port_low;                /*00D8 00DB*/
	u_int32_t	iop_outbound_queue_port_high;               /*00DC 00DF*/
	u_int32_t	message_dest_queue_port_low;                /*00E0 00E3*/
	u_int32_t	message_dest_queue_port_high;               /*00E4 00E7*/
	u_int32_t	last_used_message_dest_address_low;         /*00E8 00EB*/
	u_int32_t	last_used_message_dest_address_high;        /*00EC 00EF*/
	u_int32_t	message_done_queue_base_address_low;        /*00F0 00F3*/
	u_int32_t	message_done_queue_base_address_high;       /*00F4 00F7*/
	u_int32_t	host_diagnostic;                            /*00F8 00FB*/
	u_int32_t	write_sequence;                             /*00FC 00FF*/
	u_int32_t	reserved1[46];                              /*0100 01B7*/
	u_int32_t	reply_post_producer_index;                  /*01B8 01BB*/
	u_int32_t	reply_post_consumer_index;                  /*01BC 01BF*/
	u_int32_t	reserved2[1936];                            /*01C0 1FFF*/
	u_int32_t	message_wbuffer[32];                        /*2000 207F*/
	u_int32_t	reserved3[32];                              /*2080 20FF*/
	u_int32_t	message_rbuffer[32];                        /*2100 217F*/
	u_int32_t	reserved4[32];                              /*2180 21FF*/
	u_int32_t	msgcode_rwbuffer[256];                      /*2200 23FF*/
};

typedef struct deliver_completeQ {
	u_int16_t	cmdFlag;
	u_int16_t	cmdSMID;
	u_int16_t	cmdLMID;        // reserved (0)
	u_int16_t	cmdFlag2;       // reserved (0)
} DeliverQ, CompletionQ, *pDeliver_Q, *pCompletion_Q;

#define	COMPLETION_Q_POOL_SIZE	(sizeof(struct deliver_completeQ) * 512 + 128)

/*
*********************************************************************
** 
*********************************************************************
*/
struct MessageUnit_UNION
{
	union	{
		struct HBA_MessageUnit		hbamu;
		struct HBB_MessageUnit		hbbmu;
        	struct HBC_MessageUnit		hbcmu;
        	struct HBD_MessageUnit0		hbdmu;
        	struct HBE_MessageUnit		hbemu;
	} muu;
};
/* 
*************************************************************
**   structure for holding DMA address data 
*************************************************************
*/
#define IS_SG64_ADDR	0x01000000 /* bit24 */
/*
************************************************************************************************
**                            ARECA FIRMWARE SPEC
************************************************************************************************
**		Usage of IOP331 adapter
**		(All In/Out is in IOP331's view)
**		1. Message 0 --> InitThread message and retrun code
**		2. Doorbell is used for RS-232 emulation
**			inDoorBell :    bit0 -- data in ready            (DRIVER DATA WRITE OK)
**					bit1 -- data out has been read   (DRIVER DATA READ OK)
**			outDooeBell:    bit0 -- data out ready           (IOP331 DATA WRITE OK)
**					bit1 -- data in has been read    (IOP331 DATA READ OK)
**		3. Index Memory Usage
**			offset 0xf00 : for RS232 out (request buffer)
**			offset 0xe00 : for RS232 in  (scratch buffer)
**			offset 0xa00 : for inbound message code msgcode_rwbuffer (driver send to IOP331)
**			offset 0xa00 : for outbound message code msgcode_rwbuffer (IOP331 send to driver)
**		4. RS-232 emulation
**			Currently 128 byte buffer is used
**			          1st u_int32_t : Data length (1--124)
**			        Byte 4--127 : Max 124 bytes of data
**		5. PostQ
**		All SCSI Command must be sent through postQ:
**		(inbound queue port)	Request frame must be 32 bytes aligned 
**              	#   bit27--bit31 => flag for post ccb 
**			#   bit0--bit26 => real address (bit27--bit31) of post arcmsr_cdb  
**					bit31 : 0 : 256 bytes frame
**						1 : 512 bytes frame
**					bit30 : 0 : normal request
**						1 : BIOS request
**                                      bit29 : reserved
**                                      bit28 : reserved
**                                      bit27 : reserved
**  -------------------------------------------------------------------------------
**		(outbount queue port)	Request reply                          
**              	#   bit27--bit31 => flag for reply
**			#   bit0--bit26 => real address (bit27--bit31) of reply arcmsr_cdb 
**			bit31 : must be 0 (for this type of reply)
**			bit30 : reserved for BIOS handshake
**			bit29 : reserved
**			bit28 : 0 : no error, ignore AdapStatus/DevStatus/SenseData
**				1 : Error, error code in AdapStatus/DevStatus/SenseData
**			bit27 : reserved
**		6. BIOS request
**			All BIOS request is the same with request from PostQ
**			Except :
**				Request frame is sent from configuration space
**					offset: 0x78 : Request Frame (bit30 == 1)
**					offset: 0x18 : writeonly to generate IRQ to IOP331
**				Completion of request:
**				        (bit30 == 0, bit28==err flag)
**		7. Definition of SGL entry (structure)
**		8. Message1 Out - Diag Status Code (????)
**		9. Message0 message code :
**			0x00 : NOP
**			0x01 : Get Config ->offset 0xa00 :for outbound message code msgcode_rwbuffer (IOP331 send to driver)
**					Signature             0x87974060(4)
**					Request len           0x00000200(4)
**					numbers of queue      0x00000100(4)
**					SDRAM Size            0x00000100(4)-->256 MB
**					IDE Channels          0x00000008(4)
**					vendor                40 bytes char
**					model                  8 bytes char
**					FirmVer               16 bytes char
**					Device Map            16 bytes char
**	
**					FirmwareVersion DWORD <== Added for checking of new firmware capability
**			0x02 : Set Config ->offset 0xa00 : for inbound message code msgcode_rwbuffer (driver send to IOP331)
**					Signature             0x87974063(4)
**					UPPER32 of Request Frame  (4)-->Driver Only
**			0x03 : Reset (Abort all queued Command)
**			0x04 : Stop Background Activity
**			0x05 : Flush Cache
**			0x06 : Start Background Activity (re-start if background is halted)
**			0x07 : Check If Host Command Pending (Novell May Need This Function)
**			0x08 : Set controller time ->offset 0xa00 : for inbound message code msgcode_rwbuffer (driver to IOP331)
**					byte 0 : 0xaa <-- signature
**					byte 1 : 0x55 <-- signature
**					byte 2 : year (04)
**					byte 3 : month (1..12)
**					byte 4 : date (1..31)
**					byte 5 : hour (0..23)
**					byte 6 : minute (0..59)
**					byte 7 : second (0..59)
**      *********************************************************************************
**      Porting Of LSI2108/2116 Based PCIE SAS/6G host raid adapter
**      ==> Difference from IOP348
**      <1> Message Register 0,1 (the same usage) Init Thread message and retrun code
**           Inbound Message 0  (inbound_msgaddr0) : at offset 0xB0 (Scratchpad0) for inbound message code msgcode_rwbuffer (driver send to IOP)
**           Inbound Message 1  (inbound_msgaddr1) : at offset 0xB4 (Scratchpad1) Out.... Diag Status Code 
**           Outbound Message 0 (outbound_msgaddr0): at offset 0xB8 (Scratchpad3) Out.... Diag Status Code 
**           Outbound Message 1 (outbound_msgaddr1): at offset 0xBC (Scratchpad2) for outbound message code msgcode_rwbuffer (IOP send to driver)
**           <A> use doorbell to generate interrupt
**
**               inbound doorbell: bit3 --  inbound message 0 ready (driver to iop)
**              outbound doorbell: bit3 -- outbound message 0 ready (iop to driver)
**
**		        a. Message1: Out - Diag Status Code (????)
**
**		        b. Message0: message code 
**		        	    0x00 : NOP
**		        	    0x01 : Get Config ->offset 0xB8 :for outbound message code msgcode_rwbuffer (IOP send to driver)
**		        	    			Signature             0x87974060(4)
**		        	    			Request len           0x00000200(4)
**		        	    			numbers of queue      0x00000100(4)
**		        	    			SDRAM Size            0x00000100(4)-->256 MB
**		        	    			IDE Channels          0x00000008(4)
**		        	    			vendor                40 bytes char
**		        	    			model                  8 bytes char
**		        	    			FirmVer               16 bytes char
**                                         Device Map            16 bytes char
**                                         cfgVersion    ULONG <== Added for checking of new firmware capability
**		        	    0x02 : Set Config ->offset 0xB0 :for inbound message code msgcode_rwbuffer (driver send to IOP)
**		        	    			Signature             0x87974063(4)
**		        	    			UPPER32 of Request Frame  (4)-->Driver Only
**		        	    0x03 : Reset (Abort all queued Command)
**		        	    0x04 : Stop Background Activity
**		        	    0x05 : Flush Cache
**		        	    0x06 : Start Background Activity (re-start if background is halted)
**		        	    0x07 : Check If Host Command Pending (Novell May Need This Function)
**		        	    0x08 : Set controller time ->offset 0xB0 : for inbound message code msgcode_rwbuffer (driver to IOP)
**		        	            		byte 0 : 0xaa <-- signature
**                                      		byte 1 : 0x55 <-- signature
**		        	            		byte 2 : year (04)
**		        	            		byte 3 : month (1..12)
**		        	            		byte 4 : date (1..31)
**		        	            		byte 5 : hour (0..23)
**		        	            		byte 6 : minute (0..59)
**		        	            		byte 7 : second (0..59)
**
**      <2> Doorbell Register is used for RS-232 emulation
**           <A> different clear register
**           <B> different bit0 definition (bit0 is reserved)
**
**           inbound doorbell        : at offset 0x20
**           inbound doorbell clear  : at offset 0x70
**
**           inbound doorbell        : bit0 -- reserved
**                                     bit1 -- data in ready             (DRIVER DATA WRITE OK)
**                                     bit2 -- data out has been read    (DRIVER DATA READ OK)
**                                     bit3 -- inbound message 0 ready
**                                     bit4 -- more than 12 request completed in a time
**
**           outbound doorbell       : at offset 0x9C
**           outbound doorbell clear : at offset 0xA0
**
**           outbound doorbell       : bit0 -- reserved
**                                     bit1 -- data out ready            (IOP DATA WRITE OK)
**                                     bit2 -- data in has been read     (IOP DATA READ OK)
**                                     bit3 -- outbound message 0 ready
**
**      <3> Index Memory Usage (Buffer Area)
**           COMPORT_IN     at  0x2000: message_wbuffer  --  128 bytes (to be sent to ROC) : for RS232 in  (scratch buffer)
**           COMPORT_OUT    at  0x2100: message_rbuffer  --  128 bytes (to be sent to host): for RS232 out (request buffer)
**           BIOS_CFG_AREA  at  0x2200: msgcode_rwbuffer -- 1024 bytes for outbound message code msgcode_rwbuffer (IOP send to driver)
**           BIOS_CFG_AREA  at  0x2200: msgcode_rwbuffer -- 1024 bytes for  inbound message code msgcode_rwbuffer (driver send to IOP)
**
**      <4> PostQ (Command Post Address)
**          All SCSI Command must be sent through postQ:
**              inbound  queue port32 at offset 0x40 , 0x41, 0x42, 0x43
**              inbound  queue port64 at offset 0xC0 (lower)/0xC4 (upper)
**              outbound queue port32 at offset 0x44
**              outbound queue port64 at offset 0xC8 (lower)/0xCC (upper)
**              <A> For 32bit queue, access low part is enough to send/receive request
**                  i.e. write 0x40/0xC0, ROC will get the request with high part == 0, the
**                  same for outbound queue port
**              <B> For 64bit queue, if 64bit instruction is supported, use 64bit instruction
**                  to post inbound request in a single instruction, and use 64bit instruction
**                  to retrieve outbound request in a single instruction.
**                  If in 32bit environment, when sending inbound queue, write high part first
**                  then write low part. For receiving outbound request, read high part first
**                  then low part, to check queue empty, ONLY check high part to be 0xFFFFFFFF.
**                  If high part is 0xFFFFFFFF, DO NOT read low part, this may corrupt the
**                  consistency of the FIFO. Another way to check empty is to check status flag
**                  at 0x30 bit3.
**              <C> Post Address IS NOT shifted (must be 16 bytes aligned)
**                  For   BIOS, 16bytes aligned   is OK
**                  For Driver, 32bytes alignment is recommended.
**                  POST Command bit0 to bit3 is defined differently
**                  ----------------------------
**                  bit0:1 for PULL mode (must be 1)
**                  ----------------------------
**                  bit3/2/1: for arcmsr cdb size (arccdbsize)
**                      000: <= 0x0080 (128)
**                      001: <= 0x0100 (256)
**                      010: <= 0x0180 (384)
**                      011: <= 0x0200 (512)
**                      100: <= 0x0280 (640)
**                      101: <= 0x0300 (768)
**                      110: <= 0x0300 (reserved)
**                      111: <= 0x0300 (reserved)
**                  -----------------------------
**                  if len > 0x300 the len always set as 0x300
**                  -----------------------------   
**                  post addr = addr | ((len-1) >> 6) | 1
**                  -----------------------------
**                  page length in command buffer still required, 
**
**                  if page length > 3, 
**                     firmware will assume more request data need to be retrieved 
**
**              <D> Outbound Posting
**                  bit0:0 , no error, 1 with error, refer to status buffer
**                  bit1:0 , reserved (will be 0)
**                  bit2:0 , reserved (will be 0)
**                  bit3:0 , reserved (will be 0)
**                  bit63-4: Completed command address
**
**              <E> BIOS support, no special support is required. 
**                  LSI2108 support I/O register
**                  All driver functionality is supported through I/O address
**
************************************************************************************************
*/
/*
**********************************
**
**********************************
*/
/* size 8 bytes */
/* 32bit Scatter-Gather list */
struct SG32ENTRY {                 /* length bit 24 == 0 */
	u_int32_t	length;    /* high 8 bit == flag,low 24 bit == length */
	u_int32_t	address;
};
/* size 12 bytes */
/* 64bit Scatter-Gather list */
struct SG64ENTRY {                 /* length bit 24 == 1 */
  	u_int32_t       length;    /* high 8 bit == flag,low 24 bit == length */
   	u_int32_t       address; 
   	u_int32_t       addresshigh;
};
struct SGENTRY_UNION {
	union {
  		struct SG32ENTRY	sg32entry;   /* 30h   Scatter gather address  */
  		struct SG64ENTRY	sg64entry;   /* 30h */
	}u;
};
/*
**********************************
**
**********************************
*/
struct QBUFFER {
	u_int32_t     data_len;
	u_int8_t      data[124];
};
/*
**********************************
*/
typedef struct PHYS_ADDR64 {
	u_int32_t	phyadd_low;
	u_int32_t	phyadd_high;
}PHYSADDR64;
/*
************************************************************************************************
**      FIRMWARE INFO
************************************************************************************************
*/
#define	ARCMSR_FW_MODEL_OFFSET		15
#define	ARCMSR_FW_VERS_OFFSET		17
#define	ARCMSR_FW_DEVMAP_OFFSET		21
#define	ARCMSR_FW_CFGVER_OFFSET		25

struct FIRMWARE_INFO {
	u_int32_t      signature;           /*0,00-03*/
	u_int32_t      request_len;         /*1,04-07*/
	u_int32_t      numbers_queue;       /*2,08-11*/
	u_int32_t      sdram_size;          /*3,12-15*/
	u_int32_t      ide_channels;        /*4,16-19*/
	char           vendor[40];          /*5,20-59*/
	char           model[8];            /*15,60-67*/
	char           firmware_ver[16];    /*17,68-83*/
	char           device_map[16];      /*21,84-99*/
	u_int32_t      cfgVersion;          /*25,100-103 Added for checking of new firmware capability*/
	char           cfgSerial[16];       /*26,104-119*/
	u_int32_t      cfgPicStatus;        /*30,120-123*/
};
/*   (A) For cfgVersion in FIRMWARE_INFO
**        if low BYTE (byte#0) >= 3 (version 3)
**        then byte#1 report the capability of the firmware can xfer in a single request
**        
**        byte#1
**        0         256K
**        1         512K
**        2         1M
**        3         2M
**        4         4M
**        5         8M
**        6         16M
**    (B) Byte offset 7 (Reserved1) of CDB is changed to msgPages
**        Driver support new xfer method need to set this field to indicate
**        large CDB block in 0x100 unit (we use 0x100 byte as one page)
**        e.g. If the length of CDB including MSG header and SGL is 0x1508
**        driver need to set the msgPages to 0x16
**    (C) REQ_LEN_512BYTE must be used also to indicate SRB length
**        e.g. CDB len      msgPages    REQ_LEN_512BYTE flag
**             <= 0x100     1               0
**             <= 0x200     2               1
**             <= 0x300     3               1
**             <= 0x400     4               1
**             .
**             .
*/

/*
************************************************************************************************
**    size 0x1F8 (504)
************************************************************************************************
*/
struct ARCMSR_CDB {
	u_int8_t     	Bus;              /* 00h   should be 0            */
	u_int8_t     	TargetID;         /* 01h   should be 0--15        */
	u_int8_t     	LUN;              /* 02h   should be 0--7         */
	u_int8_t     	Function;         /* 03h   should be 1            */
	
	u_int8_t     	CdbLength;        /* 04h   not used now           */
	u_int8_t     	sgcount;          /* 05h                          */
	u_int8_t     	Flags;            /* 06h                          */
	u_int8_t     	msgPages;         /* 07h                          */
	
	u_int32_t    	Context;          /* 08h   Address of this request */
	u_int32_t    	DataLength;       /* 0ch   not used now           */
	
	u_int8_t     	Cdb[16];          /* 10h   SCSI CDB               */
	/*
	********************************************************
	** Device Status : the same from SCSI bus if error occur 
	** SCSI bus status codes.
	********************************************************
	*/
	u_int8_t     	DeviceStatus;     /* 20h   if error                */
	
	u_int8_t     	SenseData[15];    /* 21h   output                  */        
	
	union {
		struct SG32ENTRY	sg32entry[ARCMSR_MAX_SG_ENTRIES];        /* 30h   Scatter gather address  */
		struct SG64ENTRY	sg64entry[ARCMSR_MAX_SG_ENTRIES];        /* 30h                           */
	} u;
};
/* CDB flag */
#define ARCMSR_CDB_FLAG_SGL_BSIZE		0x01	/* bit 0: 0(256) / 1(512) bytes         */
#define ARCMSR_CDB_FLAG_BIOS			0x02	/* bit 1: 0(from driver) / 1(from BIOS) */
#define ARCMSR_CDB_FLAG_WRITE			0x04	/* bit 2: 0(Data in) / 1(Data out)      */
#define ARCMSR_CDB_FLAG_SIMPLEQ			0x00	/* bit 4/3 ,00 : simple Q,01 : head of Q,10 : ordered Q */
#define ARCMSR_CDB_FLAG_HEADQ			0x08
#define ARCMSR_CDB_FLAG_ORDEREDQ		0x10
/* scsi status */
#define SCSISTAT_GOOD                  		0x00
#define SCSISTAT_CHECK_CONDITION       		0x02
#define SCSISTAT_CONDITION_MET         		0x04
#define SCSISTAT_BUSY                  		0x08
#define SCSISTAT_INTERMEDIATE          		0x10
#define SCSISTAT_INTERMEDIATE_COND_MET 		0x14
#define SCSISTAT_RESERVATION_CONFLICT  		0x18
#define SCSISTAT_COMMAND_TERMINATED    		0x22
#define SCSISTAT_QUEUE_FULL            		0x28
/* DeviceStatus */
#define ARCMSR_DEV_SELECT_TIMEOUT		0xF0
#define ARCMSR_DEV_ABORTED			0xF1
#define ARCMSR_DEV_INIT_FAIL			0xF2
/*
*********************************************************************
**                   Command Control Block (SrbExtension)
** SRB must be not cross page boundary,and the order from offset 0
**         structure describing an ATA disk request
**             this SRB length must be 32 bytes boundary
*********************************************************************
*/
struct CommandControlBlock {
	struct ARCMSR_CDB	arcmsr_cdb;		/* 0  -503 (size of CDB=504): arcmsr messenger scsi command descriptor size 504 bytes */
	u_int32_t		cdb_phyaddr_low;	/* 504-507 */
	u_int32_t		arc_cdb_size;		/* 508-511 */
	/*  ======================512+32 bytes============================  */
	union ccb		*pccb;			/* 512-515 516-519 pointer of freebsd scsi command */
	struct AdapterControlBlock	*acb;		/* 520-523 524-527 */
	bus_dmamap_t		dm_segs_dmamap;		/* 528-531 532-535 */
	u_int16_t   		srb_flags;		/* 536-537 */
	u_int16_t		srb_state;              /* 538-539 */
	u_int32_t		cdb_phyaddr_high;	/* 540-543 */
	struct	callout		ccb_callout;
	u_int32_t		smid;
    /*  ==========================================================  */
};
/*	srb_flags */
#define		SRB_FLAG_READ			0x0000
#define		SRB_FLAG_WRITE			0x0001
#define		SRB_FLAG_ERROR			0x0002
#define		SRB_FLAG_FLUSHCACHE		0x0004
#define		SRB_FLAG_MASTER_ABORTED 	0x0008
#define		SRB_FLAG_DMAVALID		0x0010
#define		SRB_FLAG_DMACONSISTENT  	0x0020
#define		SRB_FLAG_DMAWRITE		0x0040
#define		SRB_FLAG_PKTBIND		0x0080
#define		SRB_FLAG_TIMER_START		0x0080
/*	srb_state */
#define		ARCMSR_SRB_DONE   		0x0000
#define		ARCMSR_SRB_UNBUILD 		0x0000
#define		ARCMSR_SRB_TIMEOUT 		0x1111
#define		ARCMSR_SRB_RETRY 		0x2222
#define		ARCMSR_SRB_START   		0x55AA
#define		ARCMSR_SRB_PENDING		0xAA55
#define		ARCMSR_SRB_RESET		0xA5A5
#define		ARCMSR_SRB_ABORTED		0x5A5A
#define		ARCMSR_SRB_ILLEGAL		0xFFFF

#define		SRB_SIZE	((sizeof(struct CommandControlBlock)+0x1f) & 0xffe0)
#define 	ARCMSR_SRBS_POOL_SIZE   (SRB_SIZE * ARCMSR_MAX_FREESRB_NUM)

/*
*********************************************************************
**                 Adapter Control Block
*********************************************************************
*/
#define ACB_ADAPTER_TYPE_A	0x00000000	/* hba I IOP */
#define ACB_ADAPTER_TYPE_B	0x00000001	/* hbb M IOP */
#define ACB_ADAPTER_TYPE_C	0x00000002	/* hbc L IOP */
#define ACB_ADAPTER_TYPE_D	0x00000003	/* hbd M IOP */
#define ACB_ADAPTER_TYPE_E	0x00000004	/* hbd L IOP */

struct AdapterControlBlock {
	u_int32_t		adapter_type;		/* adapter A,B..... */
	
	bus_space_tag_t		btag[2];
	bus_space_handle_t	bhandle[2];
	bus_dma_tag_t		parent_dmat;
	bus_dma_tag_t		dm_segs_dmat;		/* dmat for buffer I/O */  
	bus_dma_tag_t		srb_dmat;		/* dmat for freesrb */
	bus_dmamap_t		srb_dmamap;
	device_t		pci_dev;
#if __FreeBSD_version < 503000
	dev_t			ioctl_dev;
#else
	struct cdev		*ioctl_dev;
#endif
	int			pci_unit;
	
	struct resource		*sys_res_arcmsr[2];
	struct resource		*irqres[ARCMSR_NUM_MSIX_VECTORS];
	void			*ih[ARCMSR_NUM_MSIX_VECTORS]; /* interrupt handle */
	int			irq_id[ARCMSR_NUM_MSIX_VECTORS];
	
	/* Hooks into the CAM XPT */
	struct			cam_sim *psim;
	struct			cam_path *ppath;
	u_int8_t		*uncacheptr;
	unsigned long		vir2phy_offset;
	union	{
		unsigned long	phyaddr;
		struct {
			u_int32_t	phyadd_low;
			u_int32_t	phyadd_high;
		}B;
	}srb_phyaddr;
//	unsigned long				srb_phyaddr;
	/* Offset is used in making arc cdb physical to virtual calculations */
	u_int32_t		outbound_int_enable;
	
	struct MessageUnit_UNION	*pmu;		/* message unit ATU inbound base address0 */
	
	u_int8_t		adapter_index;
	u_int8_t		irq;
	u_int16_t		acb_flags;
	
	struct CommandControlBlock *psrb_pool[ARCMSR_MAX_FREESRB_NUM];     /* serial srb pointer array */
	struct CommandControlBlock *srbworkingQ[ARCMSR_MAX_FREESRB_NUM];   /* working srb pointer array */
	int32_t			workingsrb_doneindex;		/* done srb array index */
	int32_t			workingsrb_startindex;		/* start srb array index  */
	int32_t			srboutstandingcount;
	
	u_int8_t		rqbuffer[ARCMSR_MAX_QBUFFER];	/* data collection buffer for read from 80331 */
	u_int32_t		rqbuf_firstindex;		/* first of read buffer  */
	u_int32_t		rqbuf_lastindex;		/* last of read buffer   */
	
	u_int8_t		wqbuffer[ARCMSR_MAX_QBUFFER];	/* data collection buffer for write to 80331  */
	u_int32_t		wqbuf_firstindex;		/* first of write buffer */
	u_int32_t		wqbuf_lastindex;		/* last of write buffer  */
	
	arcmsr_lock_t		isr_lock;
	arcmsr_lock_t		srb_lock;
	arcmsr_lock_t		postDone_lock;
	arcmsr_lock_t		qbuffer_lock;
	
	u_int8_t		devstate[ARCMSR_MAX_TARGETID][ARCMSR_MAX_TARGETLUN]; /* id0 ..... id15,lun0...lun7 */
	u_int32_t		num_resets;
	u_int32_t		num_aborts;
	u_int32_t		firm_request_len;	/*1,04-07*/
	u_int32_t		firm_numbers_queue;	/*2,08-11*/
	u_int32_t		firm_sdram_size;	/*3,12-15*/
	u_int32_t		firm_ide_channels;	/*4,16-19*/
	u_int32_t		firm_cfg_version;
	char			firm_model[12];		/*15,60-67*/
	char			firm_version[20];	/*17,68-83*/
	char			device_map[20];		/*21,84-99 */
	struct	callout		devmap_callout;
	u_int32_t		pktRequestCount;
	u_int32_t		pktReturnCount;
	u_int32_t		vendor_device_id;
	u_int32_t		adapter_bus_speed;
	u_int32_t		maxOutstanding;
	u_int16_t		sub_device_id;
	u_int32_t		doneq_index;
	u_int32_t		in_doorbell;
	u_int32_t		out_doorbell;
	u_int32_t		completionQ_entry;
	pCompletion_Q		pCompletionQ;
	int			msix_vectors;
	int			rid[2];
};/* HW_DEVICE_EXTENSION */
/* acb_flags */
#define ACB_F_SCSISTOPADAPTER           0x0001
#define ACB_F_MSG_STOP_BGRB             0x0002		/* stop RAID background rebuild */
#define ACB_F_MSG_START_BGRB            0x0004		/* stop RAID background rebuild */
#define ACB_F_IOPDATA_OVERFLOW          0x0008		/* iop ioctl data rqbuffer overflow */
#define ACB_F_MESSAGE_WQBUFFER_CLEARED  0x0010		/* ioctl clear wqbuffer */
#define ACB_F_MESSAGE_RQBUFFER_CLEARED  0x0020		/* ioctl clear rqbuffer */
#define ACB_F_MESSAGE_WQBUFFER_READ     0x0040
