share/man/man4/man4.armv7/omclock.4
.\"	$OpenBSD: omclock.4,v 1.1 2020/04/10 22:26:46 kettenis Exp $
.\"
.\" Copyright (c) 2020 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: April 10 2020 $
.Dt OMCLOCK 4 armv7
.Os
.Sh NAME
.Nm omclock
.Nd OMAP clock module
.Sh SYNOPSIS
.Cd "omclock* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the clock controllers found on TI OMAP3,
OMAP4 and AM335x SoCs.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr omcm 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.7 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
