share/man/man4/man4.armv7/ommmc.4
.\"	$OpenBSD: ommmc.4,v 1.2 2016/06/18 05:59:26 jsg Exp $
.\" Copyright (c) 2013 Raphael Graf <rapha@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.\"
.\" Uwe Stuehler, 2007. Public Domain.
.\"
.Dd $Mdocdate: June 18 2016 $
.Dt OMMMC 4 armv7
.Os
.Sh NAME
.Nm ommmc
.Nd MMC/SD/SDIO controller
.Sh SYNOPSIS
.Cd "ommmc* at fdt?"
.Cd "sdmmc* at ommmc?"
.Sh DESCRIPTION
The
.Nm
driver supports the MMC/SD/SDIO controller integrated in OMAP and
AM335X processors.
.Pp
The
.Xr sdmmc 4
subsystem performs SD/MMC transactions to communicate with whatever
MMC/SD/SDIO devices are inserted into the card slot.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr sdmmc 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.4 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Dale Rahn Aq Mt drahn@dalerahn.com .
