share/man/man4/man4.armv7/omwugen.4
.\"	$OpenBSD: omwugen.4,v 1.2 2016/09/15 22:38:17 jmc Exp $
.\"
.\" Copyright (c) 2016 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 15 2016 $
.Dt OMWUGEN 4 armv7
.Os
.Sh NAME
.Nm omwugen
.Nd OMAP wake-up generator
.Sh SYNOPSIS
.Cd "omwugen* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver handles the wake-up generator logic present in OMAP4 and OMAP5 SoCs
which routes interrupts to
.Xr ampintc 4 .
