share/man/man4/man4.armv7/sysreg.4
.\"	$OpenBSD: sysreg.4,v 1.2 2016/10/08 06:45:02 jsg Exp $
.\"
.\" Copyright (c) 2015 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: October 8 2016 $
.Dt SYSREG 4 armv7
.Os
.Sh NAME
.Nm sysreg
.Nd ARM Motherboard Express microATX system registers
.Sh SYNOPSIS
.Cd "sysreg* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver supports the ARM Motherboard Express microATX system registers.
.Rs
.%T ARM Motherboard Express microATX Technical Reference Manual
.Re
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.8 .
