share/man/man4/man4.armv7/zqreset.4
.\"	$OpenBSD: zqreset.4,v 1.2 2021/04/30 13:52:12 jmc Exp $
.\"
.\" Copyright (c) 2021 Visa Hankala
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: April 30 2021 $
.Dt ZQRESET 4 armv7
.Os
.Sh NAME
.Nm zqreset
.Nd Xilinx Zynq-7000 reset controller
.Sh SYNOPSIS
.Cd "zqreset* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver controls the reset signals for the integrated components
of Zynq-7000 SoCs.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr zqclock 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.0 .
