/*
 * Chip-specific hardware definitions for
 * Broadcom 802.11abg Networking Device Driver
 *
 * Broadcom Proprietary and Confidential. Copyright (C) 2020,
 * All Rights Reserved.
 *
 * This is UNPUBLISHED PROPRIETARY SOURCE CODE of Broadcom;
 * the contents of this file may not be disclosed to third parties,
 * copied or duplicated in any form, in whole or in part, without
 * the prior written permission of Broadcom.
 *
 *
 * <<Broadcom-WL-IPTag/Proprietary:>>
 */

#ifndef	_D11_H
#define	_D11_H

/*
 * Notes:
 * 1. pre40/pre rev40: corerev < 40
 * 2. pre80/pre rev80: 40 <= corerev < 80
 * 3. rev40/D11AC: 80 > corerev >= 40
 * 4. rev80: corerev >= 80
 */

#include <typedefs.h>
#include <hndsoc.h>
#include <sbhnddma.h>
#include <802.11.h>

#if defined(BCMDONGLEHOST) || defined(WL_UNITTEST)
typedef struct {
	uint32 pad;
} shmdefs_t;
#else	/* defined(BCMDONGLEHOST)|| defined(WL_UNITTEST) */
#include <d11shm.h>
#ifdef USE_BCMCONF_H
#include <bcmconf.h>
#else
#include <wlc_cfg.h>
#endif
#endif /* !defined(BCMDONGLEHOST)|| !defined(WL_UNITTEST) */

#include <d11regs.h>

/* This marks the start of a packed structure section. */
#include <packed_section_start.h>

/* cpp contortions to concatenate w/arg prescan */
#ifndef	PAD
#define	_PADLINE(line)	pad ## line
#define	_XSTR(line)	_PADLINE(line)
#define	PAD		_XSTR(__LINE__)
#endif

#define	D11AC_BCN_TMPL_LEN	640	/**< length of the BCN template area for 11AC */

#define LPRS_TMPL_LEN		512	/**< length of the legacy PRS template area */

/* RX FIFO numbers */
#define	RX_FIFO			0	/**< data and ctl frames */
#define	RX_FIFO1		1	/**< ctl frames */
#define RX_FIFO2		2	/**< ctl frames */
#define RX_FIFO_NUMBER		3

/* TX FIFO numbers using WME Access Classes */
#define	TX_AC_BK_FIFO		0	/**< Access Category Background TX FIFO */
#define	TX_AC_BE_FIFO		1	/**< Access Category Best-Effort TX FIFO */
#define	TX_AC_VI_FIFO		2	/**< Access Class Video TX FIFO */
#define	TX_AC_VO_FIFO		3	/**< Access Class Voice TX FIFO */
#define	TX_BCMC_FIFO		4	/**< Broadcast/Multicast TX FIFO */
#define	TX_ATIM_FIFO		5	/**< TX fifo for ATIM window info */
#define	TX_AC_N_DATA_FIFO	4	/**< Number of legacy Data Fifos (BK, BE, VI, VO) */

/* TX FIFO numbers for trigger queues for HE STA only chips (i.e
 * This is valid only for 4369 or similar STA chips that supports
 * a single HE STA connection.
 */
#define	TX_TRIG_BK_FIFO		6	/**< Access Category Background TX FIFO */
#define	TX_TRIG_BE_FIFO		7	/**< Access Category Best-Effort TX FIFO */
#define	TX_TRIG_VI_FIFO		8	/**< Access Class Video TX FIFO */
#define	TX_TRIG_VO_FIFO		9	/**< Access Class Voice TX FIFO */
#define	TX_TRIG_HP_FIFO		10	/**< Access High Priority TX FIFO */
#define	TX_TRIG_N_DATA_FIFO	4	/**< Number of Trigger Data Fifos (BK, BE, VI, VO) */

#if defined(WL11AX_TRIGGERQ) && !defined(WL11AX_TRIGGERQ_DISABLED)
#define IS_TRIG_FIFO(fifo) \
	(((fifo) >= TX_TRIG_BK_FIFO) && ((fifo) < (TX_TRIG_BK_FIFO + TX_TRIG_N_DATA_FIFO)))
#else
#define IS_TRIG_FIFO(fifo) FALSE
#endif /* defined(WL11AX_TRIGGERQ) && !defined(WL11AX_TRIGGERQ_DISABLED) */

#define IS_AC_FIFO(fifo) \
	((fifo) < (TX_AC_BK_FIFO + TX_AC_N_DATA_FIFO))

/** Legacy TX FIFO numbers */
#define	TX_DATA_FIFO		TX_AC_BE_FIFO
#define	TX_CTL_FIFO		TX_AC_VO_FIFO

/** Trig TX FIFO numbers */
#define	TX_TRIG_DATA_FIFO	TX_TRIG_BE_FIFO
#define	TX_TRIG_CTL_FIFO	TX_TRIG_VO_FIFO

/* Extended FIFOs for corerev >= 64 */
#define TX_FIFO_6		6
#define TX_FIFO_7		7
#define TX_FIFO_16		16
#define TX_FIFO_23		23
#define TX_FIFO_25		25

#define TX_FIFO_EXT_START	TX_FIFO_6	/* Starting index of extendied HW TX FIFOs */
#define TX_FIFO_MU_START	8		/* index at which MU TX FIFOs start */

#define D11REG_IHR_WBASE	0x200
#define D11REG_IHR_BASE		(D11REG_IHR_WBASE << 1)

#define	PIHR_BASE	0x0400		/**< byte address of packed IHR region */

/* biststatus */
#define	BT_DONE		(1U << 31)	/**< bist done */
#define	BT_B2S		(1 << 30)	/**< bist2 ram summary bit */

/* DMA intstatus and intmask */
#define	I_PC		(1 << 10)	/**< pci descriptor error */
#define	I_PD		(1 << 11)	/**< pci data error */
#define	I_DE		(1 << 12)	/**< descriptor protocol error */
#define	I_RU		(1 << 13)	/**< receive descriptor underflow */
#define	I_RO		(1 << 14)	/**< receive fifo overflow */
#define	I_XU		(1 << 15)	/**< transmit fifo underflow */
#define	I_RI		(1 << 16)	/**< receive interrupt */
#define	I_XI		(1 << 24)	/**< transmit interrupt */

/* interrupt receive lazy */
#define	IRL_TO_MASK		0x00ffffff	/**< timeout */
#define	IRL_FC_MASK		0xff000000	/**< frame count */
#define	IRL_FC_SHIFT		24		/**< frame count */
#define	IRL_DISABLE		0x01000000	/**< Disabled value: int on 1 frame, zero time */

/** for correv >= 80. prev rev uses bit 21 */
#define	MCTL_BCNS_PROMISC_SHIFT	21
/** for correv < 80. prev rev uses bit 20 */
#define	MCTL_BCNS_PROMISC_SHIFT_LT80	20

/* maccontrol register */
#define	MCTL_GMODE		(1U << 31)
#define	MCTL_DISCARD_PMQ	(1 << 30)
#define	MCTL_DISCARD_TXSTATUS	(1 << 29)
#define	MCTL_TBTT_HOLD		(1 << 28)
#define	MCTL_CLOSED_NETWORK	(1 << 27)
#define	MCTL_WAKE		(1 << 26)
#define	MCTL_HPS		(1 << 25)
#define	MCTL_PROMISC		(1 << 24)
#define	MCTL_KEEPBADFCS		(1 << 23)
#define	MCTL_KEEPCONTROL	(1 << 22)
#define	MCTL_BCNS_PROMISC	(1 << MCTL_BCNS_PROMISC_SHIFT)
#define	MCTL_BCNS_PROMISC_LT80	(1 << MCTL_BCNS_PROMISC_SHIFT_LT80)
#define	MCTL_NO_TXDMA_LAST_PTR	(1 << 20)	/** for correv >= 85 */
#define	MCTL_LOCK_RADIO		(1 << 19)
#define	MCTL_AP			(1 << 18)
#define	MCTL_INFRA		(1 << 17)
#define	MCTL_BIGEND		(1 << 16)
#define	MCTL_DISABLE_CT		(1 << 14)   /** for corerev >= 83.1 */
#define	MCTL_GPOUT_SEL_MASK	(3 << 14)
#define	MCTL_GPOUT_SEL_SHIFT	14
#define	MCTL_EN_PSMDBG		(1 << 13)
#define	MCTL_IHR_EN		(1 << 10)
#define	MCTL_SHM_UPPER		(1 <<  9)
#define	MCTL_SHM_EN		(1 <<  8)
#define	MCTL_PSM_JMP_0		(1 <<  2)
#define	MCTL_PSM_RUN		(1 <<  1)
#define	MCTL_EN_MAC		(1 <<  0)

/* maccontrol1 register */
#define MCTL1_GCPS			(1u << 0u)
#define MCTL1_EGS_MASK			0x0000c000
#define MCTL1_EGS_SHIFT			14u
#define MCTL1_AVB_ENABLE		(1u << 1u)
#define MCTL1_GPIOSEL_SHIFT		8u
#define MCTL1_GPIOSEL			(0x3F)
#define MCTL1_GPIOSEL_MASK		(MCTL1_GPIOSEL << MCTL1_GPIOSEL_SHIFT)
/* Select MAC_SMPL_CPTR debug data that is placed in pc<7:1> & ifs_gpio_out<8:0> GPIOs */
#define MCTL1_GPIOSEL_TSF_PC_IFS(_corerev)	(D11REV_GE(_corerev, 85) ? 0x3b : 0x36)
#define MCTL1_AVB_TRIGGER		(1u << 2u)
#define MCTL1_THIRD_AXI1_FOR_PSM	(1u << 3u)
#define MCTL1_AXI1_FOR_RX		(1u << 4u)
#define MCTL1_TXDMA_ENABLE_PASS		(1u << 5u)
/* SampleCollectPlayCtrl */
#define SC_PLAYCTRL_MASK_ENABLE		(1u << 8u)
#define SC_PLAYCTRL_TRANS_MODE		(1u << 6u)
#define SC_PLAYCTRL_SRC_SHIFT		3u
#define SC_PLAYCTRL_SRC_MASK		(3u << SC_PLAYCTRL_SRC_SHIFT)
#define SC_PLAYCTRL_SRC_PHY_DBG		(3u << SC_PLAYCTRL_SRC_SHIFT)
#define SC_PLAYCTRL_SRC_GPIO_OUT	(2u << SC_PLAYCTRL_SRC_SHIFT)
#define SC_PLAYCTRL_SRC_GPIO_IN		(1u << SC_PLAYCTRL_SRC_SHIFT)
#define SC_PLAYCTRL_SRC_PHY_SMPL	(0u << SC_PLAYCTRL_SRC_SHIFT)
#define SC_PLAYCTRL_STOP		(1u << 2u)
#define SC_PLAYCTRL_PAUSE		(1u << 1u)
#define SC_PLAYCTRL_START		(1u << 0u)
/* SCPortalSel fields */
#define SC_PORTAL_SEL_AUTO_INCR		(1u << 15u)	/* Autoincr */
#define SC_PORTAL_SEL_STORE_MASK	(0u << 5u)	/* Bits 14:5 SCStoreMask15to0 */
#define SC_PORTAL_SEL_MATCH_MASK	(4u << 5u)	/* Bits 14:5 SCMatchMask15to0 */
#define SC_PORTAL_SEL_MATCH_VALUE	(8u << 5u)	/* Bits 14:5 SCMatchValue15to0 */
#define SC_PORTAL_SEL_TRIGGER_MASK	(12u << 0u)	/* Bits 4:0 SCTriggerMask15to0 */
#define SC_PORTAL_SEL_TRIGGER_VALUE	(16u << 0u)	/* Bits 4:0 SCTriggerValue15to0 */
#define SC_PORTAL_SEL_TRANS_MASK	(20u << 0u)	/* Bits 4:0 SCTransMask15to0 */

/* GpioOut register */
#define MGPIO_OUT_RXQ1_IFIFO_CNT_MASK	0x1fc0u
#define MGPIO_OUT_RXQ1_IFIFO_CNT_SHIFT	6u

#define MAC_RXQ1_IFIFO_CNT_ADDR	  0x26u
#define MAC_RXQ1_IFIFO_MAXLEN	  3u

/* maccommand register */
#define	MCMD_BCN0VLD		(1 <<  0)
#define	MCMD_BCN1VLD		(1 <<  1)
#define	MCMD_DIRFRMQVAL		(1 <<  2)
#define	MCMD_CCA		(1 <<  3)
#define	MCMD_BG_NOISE		(1 <<  4)
#define	MCMD_SKIP_SHMINIT	(1 <<  5)	/**< only used for simulation */
#define MCMD_SLOWCAL		(1 <<  6)
#define MCMD_SAMPLECOLL		MCMD_SKIP_SHMINIT	/**< reuse for sample collect */
#define MCMD_IF_DOWN		(1 << 8 )	/**< indicate interface is going down  */
#define MCMD_TOF		(1 << 9) /**< wifi ranging processing in ucode for rxd frames */
#define MCMD_TSYNC		(1 << 10) /**< start timestamp sync process in ucode */
#define MCMD_RADIO_DOWN		(1 << 11) /**< radio down by ucode */
#define MCMD_RADIO_UP		(1 << 12) /**< radio up by ucode */
#define MCMD_TXPU		(1 << 13) /**< txpu control by ucode */

/* macintstatus/macintmask */
#define	MI_MACSSPNDD     (1 <<  0)	/**< MAC has gracefully suspended */
#define	MI_BCNTPL        (1 <<  1)	/**< beacon template available */
#define	MI_TBTT          (1 <<  2)	/**< TBTT indication */
#define	MI_BCNSUCCESS    (1 <<  3)	/**< beacon successfully tx'd */
#define	MI_BCNCANCLD     (1 <<  4)	/**< beacon canceled (IBSS) */
#define	MI_ATIMWINEND    (1 <<  5)	/**< end of ATIM-window (IBSS) */
#define	MI_PMQ           (1 <<  6)	/**< PMQ entries available */
#define	MI_ALTTFS        (1 <<  7)	/**< TX status interrupt for ARM offloads */
#define	MI_NSPECGEN_1    (1 <<  8)	/**< non-specific gen-stat bits that are set by PSM */
#define	MI_MACTXERR      (1 <<  9)	/**< MAC level Tx error */
#define MI_PMQERR        (1 << 10)
#define	MI_PHYTXERR      (1 << 11)	/**< PHY Tx error */
#define	MI_PME           (1 << 12)	/**< Power Management Event */
#define	MI_GP0           (1 << 13)	/**< General-purpose timer0 */
#define	MI_GP1           (1 << 14)	/**< General-purpose timer1 */
#define	MI_DMAINT        (1 << 15)	/**< (ORed) DMA-interrupts */
#define	MI_TXSTOP        (1 << 16)	/**< MAC has completed a TX FIFO Suspend/Flush */
#define	MI_CCA           (1 << 17)	/**< MAC has completed a CCA measurement */
#define	MI_BG_NOISE      (1 << 18)	/**< MAC has collected background noise samples */
#define	MI_DTIM_TBTT     (1 << 19)	/**< MBSS DTIM TBTT indication */
#define MI_PRQ           (1 << 20)	/**< Probe response queue needs attention */
#define	MI_HEB           (1 << 21)	/**< HEB (Hardware Event Block) interrupt - 11ax cores */
#define	MI_BT_RFACT_STUCK	(1 << 22)	/**< MAC has detected invalid BT_RFACT pin,
						 * valid when rev < 15
						 */
#define MI_TTTT          (1 << 22)	/**< Target TIM Transmission Time,
						 * valid in rev = 26/29, or rev >= 42
						 */
#define	MI_BT_PRED_REQ   (1 << 23)	/**< MAC requested driver BTCX predictor calc */
#define	MI_BCNTRIM_RX	 (1 << 24)	/**< PSM received a partial beacon */
#define MI_P2P           (1 << 25)	/**< WiFi P2P interrupt */
#define MI_DMATX         (1 << 26)	/**< MAC new frame ready */
#define MI_TSSI_LIMIT    (1 << 27)	/**< Tssi Limit Reach, TxIdx=0/127 Interrupt */
#define MI_HWACI_NOTIFY  (1 << 27)	/**< HWACI detects ACI, Apply Mitigation settings */
#define MI_RFDISABLE     (1 << 28)	/**< MAC detected a change on RF Disable input
						 * (corerev >= 10)
						 */
#define	MI_TFS           (1 << 29)	/**< MAC has completed a TX (corerev >= 5) */
#define	MI_LEGACY_BUS_ERROR	(1 << 30)	/**< uCode indicated bus error */
#define	MI_TO            (1U << 31)	/**< general purpose timeout (corerev >= 3) */

#define MI_RXOV                 MI_NSPECGEN_1   /**< rxfifo overflow interrupt */

/* macintstatus_ext/macintmask_ext */
#define	MI_BUS_ERROR		(1U << 0u)	/**< uCode indicated bus error */
#define	MI_VCOPLL		(1U << 1u)	/**< uCode indicated PLL lock issue */
#define	MI_EXT_PS_CHG		(1U << 2u)	/**< Power state is changing (PS 0 <-> 1) */
#define MI_DIS_ULOFDMA		(1U << 3u)	/**< ucode indicated disabling ULOFDMA request */
#define	MI_EXT_PM_OFFLOAD	(1U << 4u)	/**< PM offload */
#define MI_OBSS_INTR		(1U << 5u)	/**< OBSS detection interrupt */
#define MI_SENSORC_CX_REQ	(1U << 6u)	/**< SensorC Mitigation Request interrupt */
#define MI_RLL_NAV_HOF		(1U << 7u)	/**< RLLW Switch */

#define MI_EXT_TXE_SHARED_ERR  (1U << 28u)     /* Error event in blocks inside TXE shared
						* (BMC/AQM/AQM-DMA/MIF)
						*/

/* Mac capabilities registers */
#define	MCAP_TKIPMIC		0x80000000	/**< TKIP MIC hardware present */
#define	MCAP_TKIPPH2KEY		0x40000000	/**< TKIP phase 2 key hardware present */
#define	MCAP_BTCX		0x20000000	/**< BT coexistence hardware and pins present */
#define	MCAP_MBSS		0x10000000	/**< Multi-BSS hardware present */
#define	MCAP_RXFSZ_MASK		0x0ff80000	/**< Rx fifo size in blocks (revid >= 16) */
#define	MCAP_RXFSZ_SHIFT	19
#define	MCAP_NRXQ_MASK		0x00070000	/**< Max Rx queues supported - 1 */
#define	MCAP_NRXQ_SHIFT		16
#define	MCAP_UCMSZ_MASK		0x0000e000	/**< Ucode memory size */
#define	MCAP_UCMSZ_3K3		0		/**< 3328 Words Ucode memory, in unit of 50-bit */
#define	MCAP_UCMSZ_4K		1		/**< 4096 Words Ucode memory */
#define	MCAP_UCMSZ_5K		2		/**< 5120 Words Ucode memory */
#define	MCAP_UCMSZ_6K		3		/**< 6144 Words Ucode memory */
#define	MCAP_UCMSZ_8K		4		/**< 8192 Words Ucode memory */
#define	MCAP_UCMSZ_SHIFT	13
#define	MCAP_TXFSZ_MASK		0x00000ff8	/**< Tx fifo size (* 512 bytes) */
#define	MCAP_TXFSZ_SHIFT	3
#define	MCAP_NTXQ_MASK		0x00000007	/**< Max Tx queues supported - 1 */
#define	MCAP_NTXQ_SHIFT		0

#define	MCAP_BTCX_SUP(corerev)	(MCAP_BTCX)

#define	MCAP_UCMSZ_TYPES	8		/**< different Ucode memory size types */

/* machwcap1 */
#define	MCAP1_ERC_MASK		0x00000001	/**< external radio coexistence */
#define	MCAP1_ERC_SHIFT		0
#define	MCAP1_SHMSZ_MASK	0x0000000e	/**< shm size (corerev >= 16) */
#define	MCAP1_SHMSZ_SHIFT	1
#define MCAP1_SHMSZ_1K		0		/**< 1024 words in unit of 32-bit */
#define MCAP1_SHMSZ_2K		1		/**< 1536 words in unit of 32-bit */
#define MCAP1_NUMMACCHAINS	0x00003000	/**< Indicates one less than the
							number of MAC Chains in the MAC.
							*/
#define MCAP1_NUMMACCHAINS_SHIFT	12
#define MCAP1_RXBLMAX_MASK	0x1800000u
#define MCAP1_RXBLMAX_SHIFT	23u
#define MCAP1_NUM_HEB_MASK	0xE0000000u
#define MCAP1_NUM_HEB_SHIFT	29u
#define MCAP1_NUM_HEB_FACTOR	3u
#define MCAP1_CT_CAPABLE_SHIFT	17

/* BTCX control */
#define BTCX_CTRL_EN		0x0001	/**< Enable BTCX module */
#define BTCX_CTRL_SW		0x0002	/**< Enable software override */
#define BTCX_CTRL_DSBLBTCXOUT	0x8000 /* Disable txconf/prisel signal output from btcx module */

#define BTCX_CTRL_PRI_POL	0x0080  /* Invert prisel polarity */
#define BTCX_CTRL_TXC_POL	0x0020  /* Invert txconf polarity */

#define SW_PRI_ON		1	/* switch prisel polarity */
#define SW_TXC_ON		2	/* switch txconf polarity */

/* BTCX status */
#define BTCX_STAT_RA		0x0001	/**< RF_ACTIVE state */

/* BTCX transaction control */
#define BTCX_TRANS_ANTSEL	0x0040	/**< ANTSEL output */
#define BTCX_TRANS_TXCONF	0x0080	/**< TX_CONF output */

/* pmqhost data */
#define	PMQH_DATA_MASK		0xffff0000	/**< data entry of head pmq entry */
#define	PMQH_BSSCFG		0x00100000	/**< PM entry for BSS config */
#define	PMQH_PMOFF		0x00010000	/**< PM Mode OFF: power save off */
#define	PMQH_PMON		0x00020000	/**< PM Mode ON: power save on */
#define	PMQH_PMPS		0x00200000	/**< PM Mode PRETEND */
#define	PMQH_DASAT		0x00040000	/**< Dis-associated or De-authenticated */
#define	PMQH_ATIMFAIL		0x00080000	/**< ATIM not acknowledged */
#define	PMQH_DEL_ENTRY		0x00000001	/**< delete head entry */
#define	PMQH_DEL_MULT		0x00000002	/**< delete head entry to cur read pointer -1 */
#define	PMQH_OFLO		0x00000004	/**< pmq overflow indication */
#define	PMQH_NOT_EMPTY		0x00000008	/**< entries are present in pmq */

/* phydebug (corerev >= 3) */
#define	PDBG_CRS		(1 << 0)  /**< phy is asserting carrier sense */
#define	PDBG_TXA		(1 << 1)  /**< phy is taking xmit byte from mac this cycle */
#define	PDBG_TXF		(1 << 2)  /**< mac is instructing the phy to transmit a frame */
#define	PDBG_TXE		(1 << 3)  /**< phy is signaling a transmit Error to the mac */
#define	PDBG_RXF		(1 << 4)  /**< phy detected the end of a valid frame preamble */
#define	PDBG_RXS		(1 << 5)  /**< phy detected the end of a valid PLCP header */
#define	PDBG_RXFRG		(1 << 6)  /**< rx start not asserted */
#define	PDBG_RXV		(1 << 7)  /**< mac is taking receive byte from phy this cycle */
#define	PDBG_RFD		(1 << 16) /**< RF portion of the radio is disabled */

/* objaddr register */
#define	OBJADDR_UCM_SEL		0x00000000
#define	OBJADDR_SHM_SEL		0x00010000
#define	OBJADDR_SCR_SEL		0x00020000
#define	OBJADDR_IHR_SEL		0x00030000
#define	OBJADDR_RCMTA_SEL	0x00040000
#define	OBJADDR_AMT_SEL		0x00040000
#define	OBJADDR_SRCHM_SEL	0x00060000
#define	OBJADDR_KEYTBL_SEL	0x000c0000
#define	OBJADDR_HEB_SEL		0x00120000
#define	OBJADDR_TXDC_TBL_SEL	0x00140000
#define	OBJADDR_TXDC_RIB_SEL	0x00150000
#define	OBJADDR_FCBS_SEL	0x00160000
#define	OBJADDR_LIT_SEL		0x00170000
#define	OBJADDR_LIB_SEL		0x00180000
#define	OBJADDR_WINC		0x01000000
#define	OBJADDR_RINC		0x02000000
#define	OBJADDR_AUTO_INC	0x03000000
/* SHM/SCR/IHR/SHMX/SCRX/IHRX allow 2 bytes read/write, else only 4 bytes */
#define	OBJADDR_2BYTES_ACCESS(sel)	\
	(((sel & 0x70000) == OBJADDR_SHM_SEL) || \
	((sel & 0x70000) == OBJADDR_SCR_SEL) || \
	((sel & 0x70000) == OBJADDR_IHR_SEL))

/* objdata register */
#define	OBJDATA_WR_COMPLT	0x00000001

/* frmtxstatus */
#define	TXS_V			(1 << 0)	/**< valid bit */

#define	TXS_STATUS_MASK		0xffff
/* sw mask to map txstatus for corerevs <= 4 to be the same as for corerev > 4 */
#define	TXS_COMPAT_MASK		0x3
#define	TXS_COMPAT_SHIFT	1
#define	TXS_FID_MASK		0xffff0000
#define	TXS_FID_SHIFT		16

/* frmtxstatus2 */
#define	TXS_SEQ_MASK		0xffff
#define	TXS_PTX_MASK		0xff0000
#define	TXS_PTX_SHIFT		16
#define	TXS_MU_MASK		0x01000000
#define	TXS_MU_SHIFT		24

/* clk_ctl_st, corerev >= 17 */
#define CCS_ERSRC_REQ_D11PLL	0x00000100	/**< d11 core pll request */
#define CCS_ERSRC_REQ_PHYPLL	0x00000200	/**< PHY pll request */
#define CCS_ERSRC_REQ_PTMPLL	0x00001000	/* PTM clock request */
#define CCS_ERSRC_AVAIL_D11PLL	0x01000000	/**< d11 core pll available */
#define CCS_ERSRC_AVAIL_PHYPLL	0x02000000	/**< PHY pll available */
#define CCS_ERSRC_AVAIL_PTMPLL	0x10000000	/**< PHY pll available */

/* tsf_cfprep register */
#define	CFPREP_CBI_MASK		0xffffffc0
#define	CFPREP_CBI_SHIFT	6
#define	CFPREP_CFPP		0x00000001

/* receive fifo control */
#define	RFC_FR			(1 << 0)	/**< frame ready */
#define	RFC_DR			(1 << 1)	/**< data ready */

/* tx fifo sizes for corerev >= 9 */
/* tx fifo sizes values are in terms of 256 byte blocks */
#define TXFIFOCMD_RESET_MASK	(1 << 15)	/**< reset */
#define TXFIFOCMD_FIFOSEL_SHIFT	8		/**< fifo */
#define TXFIFOCMD_FIFOSEL_SET(val)	((val & 0x7) << TXFIFOCMD_FIFOSEL_SHIFT)	/* fifo */
#define TXFIFOCMD_FIFOSEL_GET(val)	((val >> TXFIFOCMD_FIFOSEL_SHIFT) & 0x7)	/* fifo */
#define TXFIFO_FIFOTOP_SHIFT	8		/**< fifo start */

#define TXFIFO_FIFO_START(def, def1)	((def & 0xFF) | ((def1 & 0xFF) << 8))
#define TXFIFO_FIFO_END(def, def1)	(((def & 0xFF00) >> 8) | (def1 & 0xFF00))

/* Must redefine to 65 for 16 MBSS */
#ifdef WLLPRS
#define TXFIFO_START_BLK16	(65+16)	/**< Base address + 32 * 512 B/P + 8 * 512 11g P */
#else /* WLLPRS */
#define TXFIFO_START_BLK16	65	/**< Base address + 32 * 512 B/P */
#endif /* WLLPRS */
#define TXFIFO_START_BLK	6	/**< Base address + 6 * 256 B */
#define TXFIFO_START_BLK_NIN	7	/**< Base address + 6 * 256 B */

#define TXFIFO_AC_SIZE_PER_UNIT	512	/**< one unit corresponds to 512 bytes */

#define MBSS16_TEMPLMEM_MINBLKS	65	/**< one unit corresponds to 256 bytes */

/* phy versions, PhyVersion:Revision field */
#define	PV_AV_MASK		0xf000		/**< analog block version */
#define	PV_AV_SHIFT		12		/**< analog block version bitfield offset */
#define	PV_PT_MASK		0x0f00		/**< phy type */
#define	PV_PT_SHIFT		8		/**< phy type bitfield offset */
#define	PV_PV_MASK		0x00ff		/**< phy version */
#define	PHY_TYPE(v)		((v & PV_PT_MASK) >> PV_PT_SHIFT)

/* phy types, PhyVersion:PhyType field */
#ifndef USE_BCMCONF_H
#define	PHY_TYPE_A		0	/**< A-Phy value */
#define	PHY_TYPE_B		1	/**< B-Phy value */
#define	PHY_TYPE_G		2	/**< G-Phy value */
#define	PHY_TYPE_N		4	/**< N-Phy value */
/* #define	PHY_TYPE_LP		5 */	/**< LP-Phy value */
/* #define	PHY_TYPE_SSN		6 */	/**< SSLPN-Phy value */
#define	PHY_TYPE_HT		7	/**< 3x3 HTPhy value */
#define	PHY_TYPE_LCN		8	/**< LCN-Phy value */
#define	PHY_TYPE_LCNXN		9	/**< LCNXN-Phy value */
#define	PHY_TYPE_LCN40		10	/**< LCN40-Phy value */
#define	PHY_TYPE_AC		11	/**< AC-Phy value */
#define	PHY_TYPE_LCN20		12	/**< LCN20-Phy value */
#define	PHY_TYPE_HE		13	/**< HE-Phy value */
#define	PHY_TYPE_NULL		0xf	/**< Invalid Phy value */
#endif /* USE_BCMCONF_H */

/* analog types, PhyVersion:AnalogType field */
#define	ANA_11G_018		1
#define	ANA_11G_018_ALL		2
#define	ANA_11G_018_ALLI	3
#define	ANA_11G_013		4
#define	ANA_11N_013		5
#define	ANA_11LP_013		6

/** 802.11a PLCP header def */
typedef struct ofdm_phy_hdr ofdm_phy_hdr_t;
BWL_PRE_PACKED_STRUCT struct ofdm_phy_hdr {
	uint8	rlpt[3];	/**< rate, length, parity, tail */
	uint16	service;
	uint8	pad;
} BWL_POST_PACKED_STRUCT;

#define	D11A_PHY_HDR_GRATE(phdr)	((phdr)->rlpt[0] & 0x0f)
#define	D11A_PHY_HDR_GRES(phdr)		(((phdr)->rlpt[0] >> 4) & 0x01)
#define	D11A_PHY_HDR_GLENGTH(phdr)	(((*((uint32 *)((phdr)->rlpt))) >> 5) & 0x0fff)
#define	D11A_PHY_HDR_GPARITY(phdr)	(((phdr)->rlpt[3] >> 1) & 0x01)
#define	D11A_PHY_HDR_GTAIL(phdr)	(((phdr)->rlpt[3] >> 2) & 0x3f)

/** rate encoded per 802.11a-1999 sec 17.3.4.1 */
#define	D11A_PHY_HDR_SRATE(phdr, rate)		\
	((phdr)->rlpt[0] = ((phdr)->rlpt[0] & 0xf0) | ((rate) & 0xf))
/** set reserved field to zero */
#define	D11A_PHY_HDR_SRES(phdr)		((phdr)->rlpt[0] &= 0xef)
/** length is number of octets in PSDU */
#define	D11A_PHY_HDR_SLENGTH(phdr, length)	\
	(*(uint32 *)((phdr)->rlpt) = *(uint32 *)((phdr)->rlpt) | \
	(((length) & 0x0fff) << 5))
/** set the tail to all zeros */
#define	D11A_PHY_HDR_STAIL(phdr)	((phdr)->rlpt[3] &= 0x03)

#define	D11A_PHY_HDR_LEN_L	3	/**< low-rate part of PLCP header */
#define	D11A_PHY_HDR_LEN_R	2	/**< high-rate part of PLCP header */

#define	D11A_PHY_TX_DELAY	(2)	/**< 2.1 usec */

#define	D11A_PHY_HDR_TIME	(4)	/**< low-rate part of PLCP header */
#define	D11A_PHY_PRE_TIME	(16)
#define	D11A_PHY_PREHDR_TIME	(D11A_PHY_PRE_TIME + D11A_PHY_HDR_TIME)

/** 802.11b PLCP header def */
typedef struct cck_phy_hdr cck_phy_hdr_t;
BWL_PRE_PACKED_STRUCT struct cck_phy_hdr {
	uint8	signal;
	uint8	service;
	uint16	length;
	uint16	crc;
} BWL_POST_PACKED_STRUCT;

#define	D11B_PHY_HDR_LEN	6

#define	D11B_PHY_TX_DELAY	(3)	/**< 3.4 usec */

#define	D11B_PHY_LHDR_TIME	(D11B_PHY_HDR_LEN << 3)
#define	D11B_PHY_LPRE_TIME	(144)
#define	D11B_PHY_LPREHDR_TIME	(D11B_PHY_LPRE_TIME + D11B_PHY_LHDR_TIME)

#define	D11B_PHY_SHDR_TIME	(D11B_PHY_LHDR_TIME >> 1)
#define	D11B_PHY_SPRE_TIME	(D11B_PHY_LPRE_TIME >> 1)
#define	D11B_PHY_SPREHDR_TIME	(D11B_PHY_SPRE_TIME + D11B_PHY_SHDR_TIME)

#define	D11B_PLCP_SIGNAL_LOCKED	(1 << 2)
#define	D11B_PLCP_SIGNAL_LE	(1 << 7)

/* AMPDUXXX: move to ht header file once it is ready: Mimo PLCP */
#define MIMO_PLCP_MCS_MASK	0x7f	/**< mcs index */
#define MIMO_PLCP_40MHZ		0x80	/**< 40 Hz frame */
#define MIMO_PLCP_AMPDU		0x08	/**< ampdu */

#define WLC_GET_CCK_PLCP_LEN(plcp) (plcp[4] + (plcp[5] << 8))
#define WLC_GET_MIMO_PLCP_LEN(plcp) (plcp[1] + (plcp[2] << 8))
#define WLC_SET_MIMO_PLCP_LEN(plcp, len) \
	plcp[1] = len & 0xff; plcp[2] = ((len >> 8) & 0xff);

#define WLC_SET_MIMO_PLCP_AMPDU(plcp) (plcp[3] |= MIMO_PLCP_AMPDU)
#define WLC_CLR_MIMO_PLCP_AMPDU(plcp) (plcp[3] &= ~MIMO_PLCP_AMPDU)
#define WLC_IS_MIMO_PLCP_AMPDU(plcp) (plcp[3] & MIMO_PLCP_AMPDU)

/**
 * The dot11a PLCP header is 5 bytes.  To simplify the software (so that we don't need eg different
 * tx DMA headers for 11a and 11b), the PLCP header has padding added in the ucode.
 */
#define	D11_PHY_HDR_LEN	6u

/** For the AC phy PLCP is 12 bytes and not all bytes are used for all the modulations */
#define D11AC_PHY_HDR_LEN	12
#define D11AC_PHY_VHT_PLCP_OFFSET	0
#define D11AC_PHY_HTMM_PLCP_OFFSET	0
#define D11AC_PHY_HTGF_PLCP_OFFSET	3
#define D11AC_PHY_OFDM_PLCP_OFFSET	3
#define D11AC_PHY_CCK_PLCP_OFFSET	6
#define D11AC_PHY_BEACON_PLCP_OFFSET	0

#define D11_PHY_RXPLCP_LEN(rev)		(D11_PHY_HDR_LEN)
#define D11_PHY_RXPLCP_OFF(rev)		(0)

/** TX descriptor - pre40 */
typedef struct d11txh_pre40 d11txh_pre40_t;
BWL_PRE_PACKED_STRUCT struct d11txh_pre40 {
	uint16	MacTxControlLow;		/* 0x0 */
	uint16	MacTxControlHigh;		/* 0x1 */
	uint16	MacFrameControl;		/* 0x2 */
	uint16	TxFesTimeNormal;		/* 0x3 */
	uint16	PhyTxControlWord;		/* 0x4 */
	uint16	PhyTxControlWord_1;		/* 0x5 */
	uint16	PhyTxControlWord_1_Fbr;		/* 0x6 */
	uint16	PhyTxControlWord_1_Rts;		/* 0x7 */
	uint16	PhyTxControlWord_1_FbrRts;	/* 0x8 */
	uint16	MainRates;			/* 0x9 */
	uint16	XtraFrameTypes;			/* 0xa */
	uint8	IV[16];				/* 0x0b - 0x12 */
	uint8	TxFrameRA[6];			/* 0x13 - 0x15 */
	uint16	TxFesTimeFallback;		/* 0x16 */
	uint8	RTSPLCPFallback[6];		/* 0x17 - 0x19 */
	uint16	RTSDurFallback;			/* 0x1a */
	uint8	FragPLCPFallback[6];		/* 0x1b - 1d */
	uint16	FragDurFallback;		/* 0x1e */
	uint16	MModeLen;			/* 0x1f */
	uint16	MModeFbrLen;			/* 0x20 */
	uint16	TstampLow;			/* 0x21 */
	uint16	TstampHigh;			/* 0x22 */
	uint16	ABI_MimoAntSel;			/* 0x23 */
	uint16	PreloadSize;			/* 0x24 */
	uint16	AmpduSeqCtl;			/* 0x25 */
	uint16	TxFrameID;			/* 0x26 */
	uint16	TxStatus;			/* 0x27 */
	uint16	MaxNMpdus;			/* 0x28 corerev >=16 */
	BWL_PRE_PACKED_STRUCT union {
		uint16 MaxAggDur;		/* 0x29 corerev >=16 */
		uint16 MaxAggLen;
	} BWL_POST_PACKED_STRUCT u1;
	BWL_PRE_PACKED_STRUCT union {
		BWL_PRE_PACKED_STRUCT struct {	/* 0x29 corerev >=16 */
			uint8 MaxRNum;
			uint8 MaxAggBytes;	/* Max Agg Bytes in power of 2 */
		} BWL_POST_PACKED_STRUCT s1;
		uint16	MaxAggLen_FBR;
	} BWL_POST_PACKED_STRUCT u2;
	uint16	MinMBytes;			/* 0x2b corerev >=16 */
	uint8	RTSPhyHeader[D11_PHY_HDR_LEN];	/* 0x2c - 0x2e */
	struct	dot11_rts_frame rts_frame;	/* 0x2f - 0x36 */
	uint16	pad;				/* 0x37 */
} BWL_POST_PACKED_STRUCT;

#define	D11_TXH_LEN		112	/**< bytes */

/* Frame Types */
#define FT_LEGACY	(-1)
#define FT_CCK		0
#define FT_OFDM		1
#define FT_HT		2
#define FT_VHT		3
#define FT_HE		4
#define FT_EHT		6

/* HE PPDU type */
#define HE_SU_PPDU              0
#define HE_SU_RE_PPDU           1
#define HE_MU_PPDU              2
#define HE_TRIG_PPDU            3

/* Position of MPDU inside A-MPDU; indicated with bits 10:9 of MacTxControlLow */
#define TXC_AMPDU_SHIFT		9	/**< shift for ampdu settings */
#define TXC_AMPDU_NONE		0	/**< Regular MPDU, not an A-MPDU */
#define TXC_AMPDU_FIRST		1	/**< first MPDU of an A-MPDU */
#define TXC_AMPDU_MIDDLE	2	/**< intermediate MPDU of an A-MPDU */
#define TXC_AMPDU_LAST		3	/**< last (or single) MPDU of an A-MPDU */

/* MacTxControlLow */
#define TXC_AMIC		0x8000
#define TXC_USERIFS		0x4000
#define TXC_LIFETIME		0x2000
#define	TXC_FRAMEBURST		0x1000
#define	TXC_SENDCTS		0x0800
#define TXC_AMPDU_MASK		0x0600
#define TXC_BW_40		0x0100
#define TXC_FREQBAND_5G		0x0080
#define	TXC_DFCS		0x0040
#define	TXC_IGNOREPMQ		0x0020
#define	TXC_HWSEQ		0x0010
#define	TXC_STARTMSDU		0x0008
#define	TXC_SENDRTS		0x0004
#define	TXC_LONGFRAME		0x0002
#define	TXC_IMMEDACK		0x0001

/* MacTxControlHigh */
#define TXC_PREAMBLE_RTS_FB_SHORT	0x8000	/* RTS fallback preamble type 1 = SHORT 0 = LONG */
#define TXC_PREAMBLE_RTS_MAIN_SHORT	0x4000	/* RTS main rate preamble type 1 = SHORT 0 = LONG */
#define TXC_PREAMBLE_DATA_FB_SHORT	0x2000	/**< Main fallback rate preamble type
					 * 1 = SHORT for OFDM/GF for MIMO
					 * 0 = LONG for CCK/MM for MIMO
					 */
/* TXC_PREAMBLE_DATA_MAIN is in PhyTxControl bit 5 */
#define	TXC_AMPDU_FBR		0x1000	/**< use fallback rate for this AMPDU */
#define	TXC_SECKEY_MASK		0x0FF0
#define	TXC_SECKEY_SHIFT	4
#define	TXC_ALT_TXPWR		0x0008	/**< Use alternate txpwr defined at loc. M_ALT_TXPWR_IDX */
#define	TXC_SECTYPE_MASK	0x0007
#define	TXC_SECTYPE_SHIFT	0

/* Null delimiter for Fallback rate */
#define AMPDU_FBR_NULL_DELIM  5		/**< Location of Null delimiter count for AMPDU */

/* PhyTxControl for Mimophy */
#define	PHY_TXC_PWR_MASK	0xFC00
#define	PHY_TXC_PWR_SHIFT	10
#define	PHY_TXC_ANT_MASK	0x03C0	/**< bit 6, 7, 8, 9 */
#define	PHY_TXC_ANT_SHIFT	6
#define	PHY_TXC_ANT_0_1		0x00C0	/**< auto, last rx */
#define	PHY_TXC_LPPHY_ANT_LAST	0x0000
#define	PHY_TXC_ANT_3		0x0200	/**< virtual antenna 3 */
#define	PHY_TXC_ANT_2		0x0100	/**< virtual antenna 2 */
#define	PHY_TXC_ANT_1		0x0080	/**< virtual antenna 1 */
#define	PHY_TXC_ANT_0		0x0040	/**< virtual antenna 0 */

#define	PHY_TXC_SHORT_HDR	0x0010
#define PHY_TXC_FT_MASK		0x0003

#define	PHY_TXC_FT_CCK		0x0000
#define	PHY_TXC_FT_OFDM		0x0001
#define	PHY_TXC_FT_HT		0x0002
#define	PHY_TXC_FT_VHT		0x0003
#define PHY_TXC_FT_HE		0x0004
#define PHY_TXC_FT_EHT		0x0006

#define	PHY_TXC_OLD_ANT_0	0x0000
#define	PHY_TXC_OLD_ANT_1	0x0100
#define	PHY_TXC_OLD_ANT_LAST	0x0300

/** PhyTxControl_1 for Mimophy */
#define PHY_TXC1_BW_MASK		0x0007
#define PHY_TXC1_BW_10MHZ		0
#define PHY_TXC1_BW_10MHZ_UP		1
#define PHY_TXC1_BW_20MHZ		2
#define PHY_TXC1_BW_20MHZ_UP		3
#define PHY_TXC1_BW_40MHZ		4
#define PHY_TXC1_BW_40MHZ_DUP		5
#define PHY_TXC1_MODE_SHIFT		3
#define PHY_TXC1_MODE_MASK		0x0038
#define PHY_TXC1_MODE_SISO		0
#define PHY_TXC1_MODE_CDD		1
#define PHY_TXC1_MODE_STBC		2
#define PHY_TXC1_MODE_SDM		3
#define PHY_TXC1_CODE_RATE_SHIFT	8
#define PHY_TXC1_CODE_RATE_MASK		0x0700
#define PHY_TXC1_CODE_RATE_1_2		0
#define PHY_TXC1_CODE_RATE_2_3		1
#define PHY_TXC1_CODE_RATE_3_4		2
#define PHY_TXC1_CODE_RATE_4_5		3
#define PHY_TXC1_CODE_RATE_5_6		4
#define PHY_TXC1_CODE_RATE_7_8		6
#define PHY_TXC1_MOD_SCHEME_SHIFT	11
#define PHY_TXC1_MOD_SCHEME_MASK	0x3800
#define PHY_TXC1_MOD_SCHEME_BPSK	0
#define PHY_TXC1_MOD_SCHEME_QPSK	1
#define PHY_TXC1_MOD_SCHEME_QAM16	2
#define PHY_TXC1_MOD_SCHEME_QAM64	3
#define PHY_TXC1_MOD_SCHEME_QAM256	4

/* PhyTxControl for HTphy that are different from Mimophy */
#define	PHY_TXC_HTANT_MASK		0x3fC0	/**< bit 6, 7, 8, 9, 10, 11, 12, 13 */
#define	PHY_TXC_HTCORE_MASK		0x03C0	/**< core enable core3:core0, 1=enable, 0=disable */
#define	PHY_TXC_HTCORE_SHIFT		6	/**< bit 6, 7, 8, 9 */
#define	PHY_TXC_HTANT_IDX_MASK		0x3C00	/**< 4-bit, 16 possible antenna configuration */
#define	PHY_TXC_HTANT_IDX_SHIFT		10
#define	PHY_TXC_HTANT_IDX0		0
#define	PHY_TXC_HTANT_IDX1		1
#define	PHY_TXC_HTANT_IDX2		2
#define	PHY_TXC_HTANT_IDX3		3

/* PhyTxControl_1 for HTphy that are different from Mimophy */
#define PHY_TXC1_HTSPARTIAL_MAP_MASK	0x7C00	/**< bit 14:10 */
#define PHY_TXC1_HTSPARTIAL_MAP_SHIFT	10
#define PHY_TXC1_HTTXPWR_OFFSET_MASK	0x01f8	/**< bit 8:3 */
#define PHY_TXC1_HTTXPWR_OFFSET_SHIFT	3

/* TxControl word follows new interface for AX */
/* PhyTxControl_6 for AXphy */
#define PHY_TXC5_AXTXPWR_OFFSET_C0_MASK 0xff00 /**< bit 15:8 */
#define PHY_TXC5_AXTXPWR_OFFSET_C0_SHIFT 8
#define PHY_TXC6_AXTXPWR_OFFSET_C1_MASK 0x00ff /**< bit 7:0 */
#define PHY_TXC6_AXTXPWR_OFFSET_C1_SHIFT 0
#define PHY_TXC5_AXTXPWR_OFFSET_C2_MASK 0x00ff /**< bit 7:0 */
#define PHY_TXC5_AXTXPWR_OFFSET_C2_SHIFT 0

/* XtraFrameTypes */
#define XFTS_RTS_FT_SHIFT	2
#define XFTS_FBRRTS_FT_SHIFT	4
#define XFTS_CHANNEL_SHIFT	8

/** Antenna diversity bit in ant_wr_settle */
#define	PHY_AWS_ANTDIV		0x2000

/* IFS ctl */
#define IFS_USEEDCF	(1 << 2)

/* IFS ctl1 */
#define IFS_CTL1_EDCRS	(1 << 3)
#define IFS_CTL1_EDCRS_20L (1 << 4)
#define IFS_CTL1_EDCRS_40 (1 << 5)
#define IFS_EDCRS_MASK	(IFS_CTL1_EDCRS | IFS_CTL1_EDCRS_20L | IFS_CTL1_EDCRS_40)
#define IFS_EDCRS_SHIFT	3

/* IFS ctl sel pricrs  */
#define IFS_CTL_CRS_SEL_20LL    1
#define IFS_CTL_CRS_SEL_20LU    2
#define IFS_CTL_CRS_SEL_20UL    4
#define IFS_CTL_CRS_SEL_20UU    8
#define IFS_CTL_CRS_SEL_MASK    (IFS_CTL_CRS_SEL_20LL | IFS_CTL_CRS_SEL_20LU | \
				IFS_CTL_CRS_SEL_20UL | IFS_CTL_CRS_SEL_20UU)
#define IFS_CTL_ED_SEL_20LL     (1 << 8)
#define IFS_CTL_ED_SEL_20LU     (1 << 9)
#define IFS_CTL_ED_SEL_20UL     (1 << 10)
#define IFS_CTL_ED_SEL_20UU     (1 << 11)
#define IFS_CTL_ED_SEL_MASK     (IFS_CTL_ED_SEL_20LL | IFS_CTL_ED_SEL_20LU | \
				IFS_CTL_ED_SEL_20UL | IFS_CTL_ED_SEL_20UU)

/* ABI_MimoAntSel */
#define ABI_MAS_ADDR_BMP_IDX_MASK	0x0f00
#define ABI_MAS_ADDR_BMP_IDX_SHIFT	8
#define ABI_MAS_FBR_ANT_PTN_MASK	0x00f0
#define ABI_MAS_FBR_ANT_PTN_SHIFT	4
#define ABI_MAS_MRT_ANT_PTN_MASK	0x000f

#ifdef WLAWDL
#define ABI_MAS_AWDL_TS_INSERT		0x1000	/**< bit 12 */
#endif

#define ABI_MAS_TIMBC_TSF		0x2000	/**< Enable TIMBC tsf field present */

/* MinMBytes */
#define MINMBYTES_PKT_LEN_MASK                  0x0300
#define MINMBYTES_FBRATE_PWROFFSET_MASK         0xFC00
#define MINMBYTES_FBRATE_PWROFFSET_SHIFT        10

/* Rev40 template constants */

/** templates include a longer PLCP header that matches the MAC / PHY interface */
#define	D11_VHT_PLCP_LEN	12

/* 11AC TX DMA buffer header */

#define D11AC_TXH_NUM_RATES			4

/** per rate info - rev40 */
typedef struct d11actxh_rate d11actxh_rate_t;
BWL_PRE_PACKED_STRUCT struct d11actxh_rate {
	uint16  PhyTxControlWord_0;             /* 0 - 1 */
	uint16  PhyTxControlWord_1;             /* 2 - 3 */
	uint16  PhyTxControlWord_2;             /* 4 - 5 */
	uint8   plcp[D11_PHY_HDR_LEN];          /* 6 - 11 */
	uint16  FbwInfo;                        /* 12 -13, fall back bandwidth info */
	uint16  TxRate;                         /* 14 */
	uint16  RtsCtsControl;                  /* 16 */
	uint16  Bfm0;                           /* 18 */
} BWL_POST_PACKED_STRUCT;

/* Bit definition for FbwInfo field */
#define FBW_BW_MASK             3
#define FBW_BW_SHIFT            0
#define FBW_TXBF                4
#define FBW_TXBF_SHIFT          2
/* this needs to be re-visited if we want to use this feature */
#define FBW_BFM0_TXPWR_MASK     0x1F8
#define FBW_BFM0_TXPWR_SHIFT    3
#define FBW_BFM_TXPWR_MASK      0x7E00
#define FBW_BFM_TXPWR_SHIFT     9

/* Bit definition for Bfm0 field */
#define BFM0_TXPWR_MASK         0x3f
#define BFM0_STBC_SHIFT         6
#define BFM0_STBC               (1 << BFM0_STBC_SHIFT)
/* should find a chance to converge the two */
#define D11AC2_BFM0_TXPWR_MASK  0x7f
#define D11AC2_BFM0_STBC_SHIFT  7
#define D11AC2_BFM0_STBC        (1 << D11AC2_BFM0_STBC_SHIFT)

/* per packet info */
typedef struct d11pktinfo_common d11pktinfo_common_t;
typedef struct d11pktinfo_common d11actxh_pkt_t;
BWL_PRE_PACKED_STRUCT struct d11pktinfo_common {
	/* Per pkt info */
	uint16  TSOInfo;                        /* 0 */
	uint16  MacTxControlLow;                /* 2 */
	uint16  MacTxControlHigh;               /* 4 */
	uint16  Chanspec;                       /* 6 */
	uint8   IVOffset;                       /* 8 */
	uint8   PktCacheLen;                    /* 9 */
	uint16  FrameLen;                       /* 10. In [bytes] units. */
	uint16  TxFrameID;                      /* 12 */
	uint16  Seq;                            /* 14 */
	uint16  Tstamp;                         /* 16 */
	uint16  TxStatus;                       /* 18 */
} BWL_POST_PACKED_STRUCT;

/* common cache info between rev40 and rev80 formats */
typedef struct d11txh_cache_common d11txh_cache_common_t;
BWL_PRE_PACKED_STRUCT struct d11txh_cache_common {
	uint8   BssIdEncAlg;                    /* 0 */
	uint8   KeyIdx;                         /* 1 */
	uint8   PrimeMpduMax;                   /* 2 */
	uint8   FallbackMpduMax;                /* 3 */
	uint16  AmpduDur;                       /* 4 - 5 */
	uint8   BAWin;                          /* 6 */
	uint8   MaxAggLen;                      /* 7 */
} BWL_POST_PACKED_STRUCT;

/** Per cache info - rev40 */
typedef struct d11actxh_cache d11actxh_cache_t;
BWL_PRE_PACKED_STRUCT struct d11actxh_cache {
	d11txh_cache_common_t common;		/*  0 -  7 */
	uint8   TkipPH1Key[10];                 /*  8 - 17 */
	uint8   TSCPN[6];                       /* 18 - 23 */
} BWL_POST_PACKED_STRUCT;

/** Long format tx descriptor - rev40 */
typedef struct d11actxh d11actxh_t;
BWL_PRE_PACKED_STRUCT struct d11actxh {
	/* Per pkt info */
	d11actxh_pkt_t	PktInfo;			/* 0 - 19 */

	union {

		/** Rev 40 to rev 63 layout */
		struct {
			/** Per rate info */
			d11actxh_rate_t RateInfo[D11AC_TXH_NUM_RATES];  /* 20 - 99 */

			/** Per cache info */
			d11actxh_cache_t	CacheInfo;                    /* 100 - 123 */
		} rev40;

		/** Rev >= 64 layout */
		struct {
			/** Per cache info */
			d11actxh_cache_t	CacheInfo;                    /* 20 - 43 */

			/** Per rate info */
			d11actxh_rate_t RateInfo[D11AC_TXH_NUM_RATES];  /* 44 - 123 */
		} rev64;

	};
} BWL_POST_PACKED_STRUCT;

#define D11AC_TXH_LEN		sizeof(d11actxh_t)	/* 124 bytes */

/* Short format tx descriptor only has per packet info */
#define D11AC_TXH_SHORT_LEN	sizeof(d11actxh_pkt_t)	/* 20 bytes */

/* -TXDC-TxH Excluding Rate Info 41 bytes (Note 1 byte of RATEINFO is removed */
#define D11AC_TXH_SHORT_EXT_LEN		(sizeof(d11txh_rev80_t) - 1)

/* Retry limit regs */
/* Current retries for the fallback rates are hardcoded */
#define D11AC_TXDC_SRL_FB	(3u)	/* Short Retry Limit - Fallback */
#define D11AC_TXDC_LRL_FB	(2u)	/* Long Retry Limit - Fallback */

#define D11AC_TXDC_RET_LIM_MASK (0x000Fu)
#define D11AC_TXDC_SRL_SHIFT	(0u)	/* Short Retry Limit */
#define D11AC_TXDC_SRL_FB_SHIFT (4u)	/* Short Retry Limit - Fallback */
#define D11AC_TXDC_LRL_SHIFT	(8u)	/* Long Retry Limit */
#define D11AC_TXDC_LRL_FB_SHIFT (12u)	/* Long Retry Limit - Fallback */

/* MacTxControlLow */
#define D11AC_TXC_HDR_FMT_SHORT		0x0001	/**< 0: long format, 1: short format */
#define D11AC_TXC_UPD_CACHE		0x0002
#define D11AC_TXC_CACHE_IDX_MASK	0x003C	/**< Cache index 0 .. 15 */
#define D11AC_TXC_CACHE_IDX_SHIFT	2

#define D11AC_TXDC_IDX_SHIFT		1
#define D11AC_TXDC_CPG_SHIFT		5
#define D11REV80_TXDC_RIB_CPG		0x0020  /**< Cache Index CPG (Bit 5)   -TXDC- */
#define D11REV80_TXDC_RIB_DEL_MASK	0x001E  /**< Cache index CIPX 0 .. 15 (Bit 1-4 -TXDC- */
#define D11REV80_TXDC_RIB_IMM_MASK	0x003E	/**< Cache index CIPX 0 .. 31 (Bit 1-5) -TXDC- */
#define D11AC_TXC_AMPDU			0x0040	/**< Is aggregate-able */
#define D11AC_TXC_IACK			0x0080	/**< Expect immediate ACK */
#define D11AC_TXC_LFRM			0x0100	/**< Use long/short retry frame count/limit */
#define D11AC_TXC_IPMQ			0x0200	/**< Ignore PMQ */
#define D11AC_TXC_MBURST		0x0400	/**< Burst mode */
#define D11AC_TXC_ASEQ			0x0800	/**< Add ucode generated seq num */
#define D11AC_TXC_AGING			0x1000	/**< Use lifetime */
#define D11AC_TXC_AMIC			0x2000	/**< Compute and add TKIP MIC */
#define D11AC_TXC_STMSDU		0x4000	/**< First MSDU */
#define D11AC_TXC_URIFS			0x8000	/**< Use RIFS */

/* MacTxControlHigh */
#define D11AC_TXC_DISFCS		0x0001	/**< Discard FCS */
#define D11AC_TXC_FIX_RATE		0x0002	/**< Use primary rate only */
#define D11AC_TXC_SVHT			0x0004	/**< Single VHT mpdu ampdu */
#define D11AC_TXC_PPS			0x0008	/**< Enable PS Pretend feature */
#define D11AC_TXC_UCODE_SEQ		0x0010	/* Sequence counter for BK traffic, for offloads */
#define D11AC_TXC_TIMBC_TSF		0x0020	/**< Enable TIMBC tsf field present */
#define D11AC_TXC_TCPACK		0x0040
#define D11AC_TXC_AWDL_PHYTT 	0x0080 /**< Fill in PHY Transmission Time for AWDL action frames */
#define D11AC_TXC_TOF			0x0100 /**< Enable wifi ranging processing for rxd frames */
#define D11AC_TXC_MU			0x0200 /**< MU Tx data */
#define D11AC_TXC_BFIX			0x0800 /**< BFI from SHMx */
#define D11AC_TXC_NORETRY		0x0800 /**< Disable retry for tsync frames */
#define D11AC_TXC_UFP			0x1000	/**< UFP */
#define D11AC_TXC_OVERRIDE_NAV		0x1000 /**< if set, ucode will tx without honoring NAV */
#define D11AC_TXC_DYNBW			0x2000	/**< Dynamic BW */
#define D11AC_TXC_TXPROF_EN		0x8000	/**< TxProfile Enable TODO: support multiple idx */
#define D11AC_TXC_SLTF			0x8000	/**< 11az Secure Ranging frame */

#define D11AC_TSTAMP_SHIFT		8	/**< Tstamp in 256us units */

/* PhyTxControlWord_0 */
#define D11AC_PHY_TXC_FT_MASK		0x0003

/* vht txctl0 */
#define D11AC_PHY_TXC_NON_SOUNDING	0x0004
#define D11AC_PHY_TXC_BFM			0x0008
#define D11AC_PHY_TXC_SHORT_PREAMBLE	0x0010
#define D11AC2_PHY_TXC_STBC		0x0020
#define D11AC_PHY_TXC_ANT_MASK		0x3FC0
#define D11AC_PHY_TXC_CORE_MASK		0x03C0
#define D11AC_PHY_TXC_CORE_SHIFT	6
#define D11AC_PHY_TXC_ANT_IDX_MASK	0x3C00
#define D11AC_PHY_TXC_ANT_IDX_SHIFT	10
#define D11AC_PHY_TXC_BW_MASK		0xC000
#define D11AC_PHY_TXC_BW_SHIFT		14
#define D11AC_PHY_TXC_BW_20MHZ		0x0000
#define D11AC_PHY_TXC_BW_40MHZ		0x4000
#define D11AC_PHY_TXC_BW_80MHZ		0x8000
#define D11AC_PHY_TXC_BW_160MHZ		0xC000

/* PhyTxControlWord_1 */
#define D11AC_PHY_TXC_PRIM_SUBBAND_MASK		0x0007
#define D11AC_PHY_TXC_PRIM_SUBBAND_LLL		0x0000
#define D11AC_PHY_TXC_PRIM_SUBBAND_LLU		0x0001
#define D11AC_PHY_TXC_PRIM_SUBBAND_LUL		0x0002
#define D11AC_PHY_TXC_PRIM_SUBBAND_LUU		0x0003
#define D11AC_PHY_TXC_PRIM_SUBBAND_ULL		0x0004
#define D11AC_PHY_TXC_PRIM_SUBBAND_ULU		0x0005
#define D11AC_PHY_TXC_PRIM_SUBBAND_UUL		0x0006
#define D11AC_PHY_TXC_PRIM_SUBBAND_UUU		0x0007
#define D11AC_PHY_TXC_TXPWR_OFFSET_MASK 	0x01F8
#define D11AC_PHY_TXC_TXPWR_OFFSET_SHIFT	3
#define D11AC2_PHY_TXC_TXPWR_OFFSET_MASK 	0x03F8
#define D11AC2_PHY_TXC_TXPWR_OFFSET_SHIFT	3
#define D11AC_PHY_TXC_TXBF_USER_IDX_MASK	0x7C00
#define D11AC_PHY_TXC_TXBF_USER_IDX_SHIFT	10
#define D11AC2_PHY_TXC_DELTA_TXPWR_OFFSET_MASK 	0x7C00
#define D11AC2_PHY_TXC_DELTA_TXPWR_OFFSET_SHIFT	10
/* Rather awkward bit mapping to keep pctl1 word same as legacy, for proprietary 11n rate support */
#define D11AC_PHY_TXC_11N_PROP_MCS		0x8000 /* this represents bit mcs[6] */
#define D11AC2_PHY_TXC_MU			0x8000

/* PhyTxControlWord_2 phy rate */
#define D11AC_PHY_TXC_PHY_RATE_MASK		0x003F
#define D11AC2_PHY_TXC_PHY_RATE_MASK		0x007F

/* 11b phy rate */
#define D11AC_PHY_TXC_11B_PHY_RATE_MASK		0x0003
#define D11AC_PHY_TXC_11B_PHY_RATE_1		0x0000
#define D11AC_PHY_TXC_11B_PHY_RATE_2		0x0001
#define D11AC_PHY_TXC_11B_PHY_RATE_5_5		0x0002
#define D11AC_PHY_TXC_11B_PHY_RATE_11		0x0003

/* 11a/g phy rate */
#define D11AC_PHY_TXC_11AG_PHY_RATE_MASK	0x0007
#define D11AC_PHY_TXC_11AG_PHY_RATE_6		0x0000
#define D11AC_PHY_TXC_11AG_PHY_RATE_9		0x0001
#define D11AC_PHY_TXC_11AG_PHY_RATE_12		0x0002
#define D11AC_PHY_TXC_11AG_PHY_RATE_18		0x0003
#define D11AC_PHY_TXC_11AG_PHY_RATE_24		0x0004
#define D11AC_PHY_TXC_11AG_PHY_RATE_36		0x0005
#define D11AC_PHY_TXC_11AG_PHY_RATE_48		0x0006
#define D11AC_PHY_TXC_11AG_PHY_RATE_54		0x0007

/* 11ac phy rate */
#define D11AC_PHY_TXC_11AC_MCS_MASK		0x000F
#define D11AC_PHY_TXC_11AC_NSS_MASK		0x0030
#define D11AC_PHY_TXC_11AC_NSS_SHIFT		4

/* 11n phy rate */
#define D11AC_PHY_TXC_11N_MCS_MASK		0x003F
#define D11AC2_PHY_TXC_11N_MCS_MASK		0x007F
#define D11AC2_PHY_TXC_11N_PROP_MCS		0x0040 /* this represents bit mcs[6] */

/* PhyTxControlWord_2 rest */
#define D11AC_PHY_TXC_STBC			0x0040
#define D11AC_PHY_TXC_DYN_BW_IN_NON_HT_PRESENT	0x0080
#define D11AC_PHY_TXC_DYN_BW_IN_NON_HT_DYNAMIC	0x0100
#define D11AC2_PHY_TXC_TXBF_USER_IDX_MASK	0xFE00
#define D11AC2_PHY_TXC_TXBF_USER_IDX_SHIFT	9

/* RtsCtsControl */
#define D11AC_RTSCTS_FRM_TYPE_MASK	0x0001	/**< frame type */
#define D11AC_RTSCTS_FRM_TYPE_11B	0x0000	/**< 11b */
#define D11AC_RTSCTS_FRM_TYPE_11AG	0x0001	/**< 11a/g */
#define D11AC_RTSCTS_USE_RTS		0x0004	/**< Use RTS */
#define D11AC_RTSCTS_USE_CTS		0x0008	/**< Use CTS */
#define D11AC_RTSCTS_SHORT_PREAMBLE	0x0010	/**< Long/short preamble: 0 - long, 1 - short? */
#define D11AC_RTSCTS_LAST_RATE		0x0020	/**< this is last rate */
#define D11AC_RTSCTS_IMBF		0x0040	/**< Implicit TxBF */
#define D11AC_RTSCTS_MIMOPS_RTS		0x8000	/**< Use RTS for mimops */
#define D11AC_RTSCTS_DPCU_VALID		0x0080	/**< DPCU Valid : Same bitfield as above */
#define D11AC_RTSCTS_BF_IDX_MASK	0xF000	/**< 4-bit index to the beamforming block */
#define D11AC_RTSCTS_BF_IDX_SHIFT	12
#define D11AC_RTSCTS_RATE_MASK		0x0F00	/**< Rate table offset: bit 3-0 of PLCP byte 0 */
#define D11AC_RTSCTS_USE_RATE_SHIFT	8

/* BssIdEncAlg */
#define D11AC_BSSID_MASK		0x000F	/**< BSS index */
#define D11AC_BSSID_SHIFT		0
#define D11AC_ENCRYPT_ALG_MASK		0x00F0	/**< Encryption algoritm */
#define D11AC_ENCRYPT_ALG_SHIFT		4
#define D11AC_ENCRYPT_ALG_NOSEC		0x0000	/**< No security */
#define D11AC_ENCRYPT_ALG_WEP		0x0010	/**< WEP */
#define D11AC_ENCRYPT_ALG_TKIP		0x0020	/**< TKIP */
#define D11AC_ENCRYPT_ALG_AES		0x0030	/**< AES */
#define D11AC_ENCRYPT_ALG_WEP128	0x0040	/**< WEP128 */
#define D11AC_ENCRYPT_ALG_NA		0x0050	/**< N/A */
#define D11AC_ENCRYPT_ALG_WAPI		0x0060	/**< WAPI */

/* AmpduDur */
#define D11AC_AMPDU_MIN_DUR_IDX_MASK	0x000F	/**< AMPDU minimum duration index */
#define D11AC_AMPDU_MIN_DUR_IDX_SHIFT	0
#define D11AC_AMPDU_MAX_DUR_MASK	0xFFF0	/**< AMPDU maximum duration in unit 16 usec */
#define D11AC_AMPDU_MAX_DUR_SHIFT	4

/**
 * TX Descriptor definitions for supporting rev80 (HE)
 */
/* Maximum number of TX fallback rates per packet */
#define D11_REV80_TXH_NUM_RATES			4
#define D11_REV80_TXH_PHYTXCTL_MIN_LENGTH	1

/** per rate info - fixed portion - rev80 */
typedef struct d11txh_rev80_rate_fixed d11txh_rev80_rate_fixed_t;
BWL_PRE_PACKED_STRUCT struct d11txh_rev80_rate_fixed {
	uint16	TxRate;			/* rate in 500Kbps */
	uint16	RtsCtsControl;		/* RTS - CTS control */
	uint8	plcp[D11_PHY_HDR_LEN];	/* 6 bytes */
} BWL_POST_PACKED_STRUCT;

/* rev80 specific per packet info fields */
typedef struct d11pktinfo_rev80 d11pktinfo_rev80_t;
BWL_PRE_PACKED_STRUCT struct d11pktinfo_rev80 {
	uint16	HEModeControl;			/* 20 */
	uint16  length;				/* 22 - length of txd in bytes */
} BWL_POST_PACKED_STRUCT;

#define D11_REV80_TXH_TX_MODE_SHIFT		0	/* Bits 2:0 of HeModeControl */
#define D11_REV80_TXH_TX_MODE_MASK		0x3
#define D11_REV80_TXH_HTC_OFFSET_SHIFT		4	/* Bits 8:4 of HeModeControl */
#define D11_REV80_TXH_HTC_OFFSET_MASK		0x01F0u
#define D11_REV80_TXH_TWT_EOSP			0x0200u	/* bit 9 indicate TWT EOSP */
#define D11_REV80_TXH_QSZ_QOS_CTL_IND_SHIFT	10	/* Bit 10 of HeModeControl */
#define D11_REV80_TXH_QSZ_QOS_CTL_IND_MASK	(1 << D11_REV80_TXH_QSZ_QOS_CTL_IND_SHIFT)
#define D11_REV80_TXH_USE_BSSCOLOR_SHM_SHIFT	15	/* Bit 15 of HEModeControl */
#define D11_REV80_TXH_USE_BSSCOLOR_SHM_MASK	(1 << D11_REV80_TXH_USE_BSSCOLOR_SHM_SHIFT)

/* Calculate Length for short format TXD */
#define D11_TXH_SHORT_LEN(__corerev__)		(D11REV_GE(__corerev__, 80) ? \
						 D11_REV80_TXH_SHORT_LEN :    \
						 D11AC_TXH_SHORT_LEN)

/* Calculate Length for short format TXD  (TXDC and/or FMF) */
#define D11_TXH_SHORT_EX_LEN(__corerev__)	(D11REV_GE(__corerev__, 80) ? \
						 D11_REV80_TXH_SHORT_EX_LEN : \
						 D11AC_TXH_SHORT_LEN)

#define D11_REV80_TXH_IS_HE_AMPDU_SHIFT		11	/* Bit 11 of HeModeControl */
#define D11_REV80_TXH_IS_HE_AMPDU_MASK		(1 << D11_REV80_TXH_IS_HE_AMPDU_SHIFT)

#define D11_REV80_PHY_TXC_EDCA			0x00
#define D11_REV80_PHY_TXC_OFDMA_RA		0x01	/* Use Random Access Trigger for Tx */
#define D11_REV80_PHY_TXC_OFDMA_DT		0x02	/* Use Directed Trigger for Tx */
#define D11_REV80_PHY_TXC_OFDMA_ET		0x03	/* Use earliest Trigger Opportunity */

/** Per cache info - rev80 */
typedef struct d11txh_rev80_cache d11txh_rev80_cache_t;
BWL_PRE_PACKED_STRUCT struct d11txh_rev80_cache {
	d11txh_cache_common_t common;		/* 0 - 7 */
	uint16	ampdu_mpdu_all;			/* 8 - 9 */
	uint16	aggid;				/* 10 - 11 */
	uint8	tkipph1_index;			/* 12 */
	uint8	pktext;				/* 13 */
	uint16	hebid_map;			/* 14 -15: HEB ID bitmap */
} BWL_POST_PACKED_STRUCT;

/** Fixed size portion of TX descriptor - rev80 */
typedef struct d11txh_rev80 d11txh_rev80_t;
BWL_PRE_PACKED_STRUCT struct d11txh_rev80 {
	/**
	 * Per pkt info fields (common + rev80 specific)
	 *
	 * Note : Ensure that PktInfo field is always the first member
	 * of the d11txh_rev80 struct (that is at OFFSET - 0)
	 */
	d11pktinfo_common_t PktInfo;	/* 0 - 19 */
	d11pktinfo_rev80_t PktInfoExt;	/* 20 - 23 */

	/** Per cache info */
	d11txh_rev80_cache_t CacheInfo;	/* 24 - 39 */

	/**
	 * D11_REV80_TXH_NUM_RATES number of Rate Info blocks
	 * contribute to the variable size portion of the TXD.
	 * Each Rate Info element (block) is a funtion of
	 * (N_PwrOffset, N_RU, N_User).
	 */
	uint8 RateInfoBlock[1];
} BWL_POST_PACKED_STRUCT;

/* Size of fixed portion in TX descriptor (without CacheInfo(Link info) and RateInfoBlock)
 * this portion never change regardless of TXDC/FMF support.
 */
/* OFFSETOF() is available in bcmutils.h but including it will cause
 * recursive inclusion of d11.h specifically on NDIS platforms.
 */
#ifdef BCMFUZZ
	/* use 0x10 offset to avoid undefined behavior error due to NULL access */
#define D11_REV80_TXH_FIXED_LEN	(((uint)(uintptr)&((d11txh_rev80_t *)0x10)->CacheInfo) - 0x10)
#else
#define D11_REV80_TXH_FIXED_LEN	((uint)(uintptr)&((d11txh_rev80_t *)0)->CacheInfo)
#endif /* BCMFUZZ */

/* Short format tx descriptor only has per packet info (24 bytes) */
