/*
 * BCM43XX PCIE core hardware definitions.
 *
 * Copyright (C) 2020, Broadcom.
 *
 *      Unless you and Broadcom execute a separate written software license
 * agreement governing use of this software, this software is licensed to you
 * under the terms of the GNU General Public License version 2 (the "GPL"),
 * available at http://www.broadcom.com/licenses/GPLv2.php, with the
 * following added to such license:
 *
 *      As a special exception, the copyright holders of this software give you
 * permission to link this software with independent modules, and to copy and
 * distribute the resulting executable under terms of your choice, provided that
 * you also meet, for each linked independent module, the terms and conditions of
 * the license of that module.  An independent module is a module which is not
 * derived from this software.  The special exception does not apply to any
 * modifications of the software.
 *
 *
 * <<Broadcom-WL-IPTag/Dual:>>
 */
#ifndef	_PCIE_CORE_H
#define	_PCIE_CORE_H

#include <sbhnddma.h>
#include <siutils.h>

#define REV_GE_73(rev) (PCIECOREREV((rev)) >= 73)
#define REV_GE_69(rev) (PCIECOREREV((rev)) >= 69)
#define REV_GE_68(rev) (PCIECOREREV((rev)) >= 68)
#define REV_GE_64(rev) (PCIECOREREV((rev)) >= 64)
#define REV_GE_15(rev) (PCIECOREREV((rev)) >= 15)

/* cpp contortions to concatenate w/arg prescan */
#ifndef PAD
#define	_PADLINE(line)	pad ## line
#define	_XSTR(line)	_PADLINE(line)
#define	PAD		_XSTR(__LINE__)
#endif

/* PCIE Enumeration space offsets */
#define  PCIE_CORE_CONFIG_OFFSET	0x0
#define  PCIE_FUNC0_CONFIG_OFFSET	0x400
#define  PCIE_FUNC1_CONFIG_OFFSET	0x500
#define  PCIE_FUNC2_CONFIG_OFFSET	0x600
#define  PCIE_FUNC3_CONFIG_OFFSET	0x700
#define  PCIE_SPROM_SHADOW_OFFSET	0x800
#define  PCIE_SBCONFIG_OFFSET		0xE00

#define PCIEDEV_MAX_DMAS			4

/* PCIE Bar0 Address Mapping. Each function maps 16KB config space */
#define PCIE_DEV_BAR0_SIZE		0x4000
#define PCIE_BAR0_WINMAPCORE_OFFSET	0x0
#define PCIE_BAR0_EXTSPROM_OFFSET	0x1000
#define PCIE_BAR0_PCIECORE_OFFSET	0x2000
#define PCIE_BAR0_CCCOREREG_OFFSET	0x3000

/* different register spaces to access thr'u pcie indirect access */
#define PCIE_CONFIGREGS		1		/* Access to config space */
#define PCIE_PCIEREGS		2		/* Access to pcie registers */

#define PCIEDEV_HOSTADDR_MAP_BASE     0x8000000
#define PCIEDEV_HOSTADDR_MAP_WIN_MASK 0xFE000000

#define PCIEDEV_TR0_WINDOW_START 0x08000000
#define PCIEDEV_TR0_WINDOW_END   0x09FFFFFF

#define PCIEDEV_TR1_WINDOW_START 0x0A000000
#define PCIEDEV_TR1_WINDOW_END   0x0BFFFFFF

#define PCIEDEV_TR2_WINDOW_START 0x0C000000
#define PCIEDEV_TR2_WINDOW_END   0x0DFFFFFF

#define PCIEDEV_TR3_WINDOW_START 0x0E000000
#define PCIEDEV_TR3_WINDOW_END   0x0FFFFFFF

#define PCIEDEV_TRANS_WIN_LEN	0x2000000
#define PCIEDEV_ARM_ADDR_SPACE 0x0FFFFFFF

/* PCIe translation windoes */
#define PCIEDEV_TRANS_WIN_0 0
#define PCIEDEV_TRANS_WIN_1 1
#define PCIEDEV_TRANS_WIN_2 2
#define PCIEDEV_TRANS_WIN_3 3

#define PCIEDEV_ARM_ADDR(host_addr, win) \
	(((host_addr) & 0x1FFFFFF) | ((win) << 25) | PCIEDEV_HOSTADDR_MAP_BASE)

/* Current mapping of PCIe translation windows to SW features */

#define PCIEDEV_TRANS_WIN_TRAP_HANDLER	PCIEDEV_TRANS_WIN_0
#define PCIEDEV_TRANS_WIN_HOSTMEM	PCIEDEV_TRANS_WIN_1
#define PCIEDEV_TRANS_WIN_SWPAGING	PCIEDEV_TRANS_WIN_1
#define PCIEDEV_TRANS_WIN_BT		PCIEDEV_TRANS_WIN_2
#define PCIEDEV_TRANS_WIN_FWTRACE	PCIEDEV_TRANS_WIN_3

/* dma regs to control the flow between host2dev and dev2host  */
typedef volatile struct pcie_devdmaregs {
	dma64regs_t	tx;
	uint32		PAD[2];
	dma64regs_t	rx;
	uint32		PAD[2];
} pcie_devdmaregs_t;

#define PCIE_DB_HOST2DEV_0		0x1
#define PCIE_DB_HOST2DEV_1		0x2
#define PCIE_DB_DEV2HOST_0		0x3
#define PCIE_DB_DEV2HOST_1		0x4
#define PCIE_DB_DEV2HOST1_0		0x5

/* door bell register sets */
typedef struct pcie_doorbell {
	uint32		host2dev_0;
	uint32		host2dev_1;
	uint32		dev2host_0;
	uint32		dev2host_1;
} pcie_doorbell_t;

/* Flow Ring Manager */
#define IFRM_FR_IDX_MAX		256
#define IFRM_FR_CONFIG_GID	2
#define IFRM_FR_GID_MAX		4
#define IFRM_FR_DEV_MAX		8
#define IFRM_FR_TID_MAX		8
#define IFRM_FR_DEV_VALID	2

#define IFRM_VEC_REG_BITS	32

#define IFRM_FR_PER_VECREG			4
#define IFRM_FR_PER_VECREG_SHIFT	2
#define IFRM_FR_PER_VECREG_MASK		((0x1 << IFRM_FR_PER_VECREG_SHIFT) - 1)

#define IFRM_VEC_BITS_PER_FR	(IFRM_VEC_REG_BITS/IFRM_FR_PER_VECREG)

/* IFRM_DEV_0 : d11AC, IFRM_DEV_1 : d11AD */
#define IFRM_DEV_0	0
#define IFRM_DEV_1	1
#define IHRM_FR_SW_MASK (1u << IFRM_DEV_0)
#define IHRM_FR_HW_MASK (1u << IFRM_DEV_1)

#define IFRM_FR_GID_0 0
#define IFRM_FR_GID_1 1
#define IFRM_FR_GID_2 2
#define IFRM_FR_GID_3 3

#define IFRM_TIDMASK 0xffffffff

/* ifrm_ctrlst register */
#define IFRM_EN (1<<0)
#define IFRM_BUFF_INIT_DONE (1<<1)
#define IFRM_COMPARE_EN0 (1<<4)
#define IFRM_COMPARE_EN1 (1<<5)
#define IFRM_COMPARE_EN2 (1<<6)
#define IFRM_COMPARE_EN3 (1<<7)
#define IFRM_INIT_DV0 (1<<8)
#define IFRM_INIT_DV1 (1<<9)
#define IFRM_INIT_DV2 (1<<10)
#define IFRM_INIT_DV3 (1<<11)

/* ifrm_msk_arr.addr, ifrm_tid_arr.addr register */
#define IFRM_ADDR_SHIFT 0
#define IFRM_FRG_ID_SHIFT 8

/* ifrm_vec.diff_lat register */
#define IFRM_DV_LAT			(1<<0)
#define IFRM_DV_LAT_DONE	(1<<1)
#define IFRM_SDV_OFFSET_SHIFT	4
#define IFRM_SDV_FRGID_SHIFT	8
#define IFRM_VECSTAT_MASK		0x3
#define IFRM_VEC_MASK			0xff

/* HMAP Windows */
#define HMAP_MAX_WINDOWS	8

/* idma frm array */
typedef struct pcie_ifrm_array {
	uint32		addr;
	uint32		data;
} pcie_ifrm_array_t;

/* idma frm vector */
typedef struct pcie_ifrm_vector {
	uint32		diff_lat;
	uint32		sav_tid;
	uint32		sav_diff;
	uint32		PAD[1];
} pcie_ifrm_vector_t;

/* idma frm interrupt */
typedef struct pcie_ifrm_intr {
	uint32		intstat;
	uint32		intmask;
} pcie_ifrm_intr_t;

/* HMAP window register set */
typedef volatile struct pcie_hmapwindow {
	uint32 baseaddr_lo; /* BaseAddrLower */
	uint32 baseaddr_hi; /* BaseAddrUpper */
	uint32 windowlength; /* Window Length */
	uint32	PAD[1];
} pcie_hmapwindow_t;

typedef struct pcie_hmapviolation {
	uint32 hmap_violationaddr_lo;	/* violating address lo */
	uint32 hmap_violationaddr_hi;	/* violating addr hi */
	uint32 hmap_violation_info;	/* violation info */
	uint32	PAD[1];
} pcie_hmapviolation_t;

#if !defined(DONGLEBUILD) || defined(BCMSTANDALONE_TEST) || \
	defined(ATE_BUILD) || defined(BCMDVFS)
/* SB side: PCIE core and host control registers */
typedef volatile struct sbpcieregs {
	uint32 control;		/* host mode only */
	uint32 iocstatus;	/* PCIE2: iostatus */
	uint32 PAD[1];
	uint32 biststatus;	/* bist Status: 0x00C */
	uint32 gpiosel;		/* PCIE gpio sel: 0x010 */
	uint32 gpioouten;	/* PCIE gpio outen: 0x14 */
	uint32 gpioout;		/* PCIE gpio out: 0x18 */
	uint32 PAD;
	uint32 intstatus;	/* Interrupt status: 0x20 */
	uint32 intmask;		/* Interrupt mask: 0x24 */
	uint32 sbtopcimailbox;	/* sb to pcie mailbox: 0x028 */
	uint32 obffcontrol;	/* PCIE2: 0x2C */
	uint32 obffintstatus;	/* PCIE2: 0x30 */
	uint32 obffdatastatus;	/* PCIE2: 0x34 */
	uint32 PAD[1];
	uint32 ctoctrl;		/* PCIE2: 0x3C */
	uint32 errlog;		/* PCIE2: 0x40 */
	uint32 errlogaddr;	/* PCIE2: 0x44 */
	uint32 mailboxint;	/* PCIE2: 0x48 */
	uint32 mailboxintmsk; /* PCIE2: 0x4c */
	uint32 ltrspacing;	/* PCIE2: 0x50 */
	uint32 ltrhysteresiscnt;	/* PCIE2: 0x54 */
	uint32 msivectorassign;	/* PCIE2: 0x58 */
	uint32 intmask2;	/* PCIE2: 0x5C */
	uint32 PAD[40];
	uint32 sbtopcie0;	/* sb to pcie translation 0: 0x100 */
	uint32 sbtopcie1;	/* sb to pcie translation 1: 0x104 */
	uint32 sbtopcie2;	/* sb to pcie translation 2: 0x108 */
	uint32 sbtopcie0upper;	/* sb to pcie translation 0: 0x10C */
	uint32 sbtopcie1upper;	/* sb to pcie translation 1: 0x110 */
	uint32 PAD[3];

	/* pcie core supports in direct access to config space */
	uint32 configaddr;	/* pcie config space access: Address field: 0x120 */
	uint32 configdata;	/* pcie config space access: Data field: 0x124 */
	union {
		struct {
			/* mdio access to serdes */
			uint32 mdiocontrol;	/* controls the mdio access: 0x128 */
			uint32 mdiodata;	/* Data to the mdio access: 0x12c */
			/* pcie protocol phy/dllp/tlp register indirect access mechanism */
			uint32 pcieindaddr; /* indirect access to the internal register: 0x130 */
			uint32 pcieinddata;	/* Data to/from the internal regsiter: 0x134 */
			uint32 clkreqenctrl;	/* >= rev 6, Clkreq rdma control : 0x138 */
			uint32 PAD[177]; /* last 0x3FC */
			/* 0x400 - 0x7FF, PCIE Cfg Space, note: not used anymore in PcieGen2 */
			uint32 pciecfg[4][64];
		} pcie1;
		struct {
			/* mdio access to serdes */
			uint32 mdiocontrol;	/* controls the mdio access: 0x128 */
			uint32 mdiowrdata;	/* write data to mdio 0x12C */
			uint32 mdiorddata;	/* read data to mdio 0x130 */
			uint32	PAD[3]; 	/* 0x134-0x138-0x13c */
			/* door bell registers available from gen2 rev5 onwards */
			pcie_doorbell_t	   dbls[PCIEDEV_MAX_DMAS]; /* 0x140 - 0x17F */
			uint32	dataintf;	/* 0x180 */
			uint32  PAD[1];		/* 0x184 */
			uint32	d2h_intrlazy_0; /* 0x188 */
			uint32	h2d_intrlazy_0; /* 0x18c */
			uint32  h2d_intstat_0;  /* 0x190 */
			uint32  h2d_intmask_0;	/* 0x194 */
			uint32  d2h_intstat_0;  /* 0x198 */
			uint32  d2h_intmask_0;  /* 0x19c */
			uint32	ltr_state;	/* 0x1A0 */
			uint32	pwr_int_status;	/* 0x1A4 */
			uint32	pwr_int_mask;	/* 0x1A8 */
			uint32	pme_source; /* 0x1AC */
			uint32	err_hdr_logreg1; /* 0x1B0 */
			uint32	err_hdr_logreg2; /* 0x1B4 */
			uint32	err_hdr_logreg3; /* 0x1B8 */
			uint32	err_hdr_logreg4; /* 0x1BC */
			uint32	err_code_logreg; /* 0x1C0 */
			uint32	axi_dbg_ctl; /* 0x1C4 */
			uint32	axi_dbg_data0; /* 0x1C8 */
			uint32	axi_dbg_data1; /* 0x1CC */
			uint32  PAD[4]; /* 0x1D0 - 0x1DF */
			uint32  clk_ctl_st;	/* 0x1E0 */
			uint32  PAD[1];		/* 0x1E4 */
			uint32	powerctl;	/* 0x1E8 */
			uint32	powerctl2;	/* 0x1EC */
			uint32  PAD[4];		/* 0x1F0 - 0x1FF */
			pcie_devdmaregs_t  h2d0_dmaregs; /* 0x200 - 0x23c */
			pcie_devdmaregs_t  d2h0_dmaregs; /* 0x240 - 0x27c */
			pcie_devdmaregs_t  h2d1_dmaregs; /* 0x280 - 0x2bc */
			pcie_devdmaregs_t  d2h1_dmaregs; /* 0x2c0 - 0x2fc */
			pcie_devdmaregs_t  h2d2_dmaregs; /* 0x300 - 0x33c */
			pcie_devdmaregs_t  d2h2_dmaregs; /* 0x340 - 0x37c */
			pcie_devdmaregs_t  h2d3_dmaregs; /* 0x380 - 0x3bc */
			pcie_devdmaregs_t  d2h3_dmaregs; /* 0x3c0 - 0x3fc */
			uint32	d2h_intrlazy_1; /* 0x400 */
			uint32	h2d_intrlazy_1; /* 0x404 */
			uint32	h2d_intstat_1;	/* 0x408 */
			uint32	h2d_intmask_1;	/* 0x40c */
			uint32	d2h_intstat_1;	/* 0x410 */
			uint32	d2h_intmask_1;	/* 0x414 */
			uint32	PAD[2];			/* 0x418 - 0x41C */
			uint32	d2h_intrlazy_2; /* 0x420 */
			uint32	h2d_intrlazy_2; /* 0x424 */
			uint32	h2d_intstat_2;	/* 0x428 */
			uint32	h2d_intmask_2;	/* 0x42c */
			uint32	d2h_intstat_2;	/* 0x430 */
			uint32	d2h_intmask_2;	/* 0x434 */
			uint32	PAD[10];		/* 0x438 - 0x45F */
			uint32	ifrm_ctrlst;	/* 0x460 */
			uint32	PAD[1];			/* 0x464 */
			pcie_ifrm_array_t	ifrm_msk_arr;		/* 0x468 - 0x46F */
			pcie_ifrm_array_t	ifrm_tid_arr[IFRM_FR_DEV_VALID];
				/* 0x470 - 0x47F */
			pcie_ifrm_vector_t	ifrm_vec[IFRM_FR_DEV_MAX];
				/* 0x480 - 0x4FF */
			pcie_ifrm_intr_t	ifrm_intr[IFRM_FR_DEV_MAX];
				/* 0x500 - 0x53F */
				/* HMAP regs for PCIE corerev >= 24  [0x540 - 0x5DF] */
			pcie_hmapwindow_t	hmapwindow[HMAP_MAX_WINDOWS];	/* 0x540 - 0x5BF */
			pcie_hmapviolation_t hmapviolation;	/* 0x5C0 - 0x5CF */
			uint32 hmap_window_config;	/* 0x5D0 */
			uint32	PAD[3];			/* 0x5D4 - 0x5DF */
			uint32  idma_hwa_status;	/* 0x5E0 */
			uint32	PAD[7];			/* 0x5E4 - 0x5FF */
			uint32	PAD[2][64];		/* 0x600 - 0x7FF */
		} pcie2;
	} u;
	uint16	sprom[64];		/* SPROM shadow Area : 0x800 - 0x880 */
	uint32	PAD[96];		/* 0x880 - 0x9FF */
	/* direct memory access (pcie2 rev19 and after) : 0xA00 - 0xAFF */
	union {
		/* corerev < 64 */
		struct {
			uint32		dar_ctrl;		/* 0xA00 */
			uint32		PAD[7];			/* 0xA04-0xA1F */
			uint32		intstatus;		/* 0xA20 */
			uint32		PAD[1];			/* 0xA24 */
			uint32		h2d_db_0_0;		/* 0xA28 */
			uint32		h2d_db_0_1;		/* 0xA2C */
			uint32		h2d_db_1_0;		/* 0xA30 */
			uint32		h2d_db_1_1;		/* 0xA34 */
			uint32		h2d_db_2_0;		/* 0xA38 */
			uint32		h2d_db_2_1;		/* 0xA3C */
			uint32		errlog;			/* 0xA40 */
			uint32		erraddr;		/* 0xA44 */
			uint32		mbox_int;		/* 0xA48 */
			uint32		fis_ctrl;		/* 0xA4C */
			uint32		PAD[36];		/* 0xA50 - 0xADC */
			uint32		clk_ctl_st;		/* 0xAE0 */
			uint32		PAD[1];			/* 0xAE4 */
			uint32		powerctl;		/* 0xAE8 */
			uint32		PAD[5];			/* 0xAEC-0xAFF */
		} dar;
		/* corerev > = 64 */
		struct {
			uint32		dar_ctrl;		/* 0xA00 */
			uint32		dar_cap;		/* 0xA04 */
			uint32		clk_ctl_st;		/* 0xA08 */
			uint32		powerctl;		/* 0xA0C */
			uint32		intstatus;		/* 0xA10 */
			uint32		PAD[3];			/* 0xA14-0xA1F */
			uint32		h2d_db_0_0;		/* 0xA20 */
			uint32		h2d_db_0_1;		/* 0xA24 */
			uint32		h2d_db_1_0;		/* 0xA28 */
			uint32		h2d_db_1_1;		/* 0xA2C */
			uint32		h2d_db_2_0;		/* 0xA30 */
			uint32		h2d_db_2_1;		/* 0xA34 */
			uint32		h2d_db_3_0;		/* 0xA38 */
			uint32		h2d_db_3_1;		/* 0xA3C */
			uint32		h2d_db_4_0;		/* 0xA40 */
			uint32		h2d_db_4_1;		/* 0xA44 */
			uint32		h2d_db_5_0;		/* 0xA48 */
			uint32		h2d_db_5_1;		/* 0xA4C */
			uint32		h2d_db_6_0;		/* 0xA50 */
			uint32		h2d_db_6_1;		/* 0xA54 */
			uint32		h2d_db_7_0;		/* 0xA58 */
			uint32		h2d_db_7_1;		/* 0xA5C */
			uint32		errlog;			/* 0xA60 */
			uint32		erraddr;		/* 0xA64 */
			uint32		mbox_int;		/* 0xA68 */
			uint32		fis_ctrl;		/* 0xA6C */
			uint32		PAD[36];		/* 0xA70-0xAFF */
		} dar_64;
	} u1;
	uint32		PAD[64];		/* 0xB00-0xBFF */
	/* Function Control/Status Registers for corerev >= 64 */
	/* 0xC00 - 0xCFF */
	struct {
		uint32		control;		/* 0xC00 */
		uint32		iostatus;		/* 0xC04 */
		uint32		capability;		/* 0xC08 */
		uint32		PAD[1];			/* 0xC0C */
		uint32		intstatus;		/* 0xC10 */
		uint32		intmask;		/* 0xC14 */
		uint32		pwr_intstatus;	/* 0xC18 */
		uint32		pwr_intmask;	/* 0xC1C */
		uint32		msi_vector;		/* 0xC20 */
		uint32		msi_intmask;	/* 0xC24 */
		uint32		msi_intstatus;	/* 0xC28 */
		uint32		msi_pend_cnt;	/* 0xC2C */
		uint32		mbox_intstatus;	/* 0xC30 */
		uint32		mbox_intmask;	/* 0xC34 */
		uint32		ltr_state;		/* 0xC38 */
		uint32		PAD[1];			/* 0xC3C */
		uint32		intr_vector;	/* 0xC40 */
		uint32		intr_addrlow;	/* 0xC44 */
		uint32		intr_addrhigh;	/* 0xC48 */
		uint32		PAD[45];		/* 0xC4C-0xCFF */
	} ftn_ctrl;
} sbpcieregs_t;
#endif /* !defined(DONGLEBUILD) || defined(BCMSTANDALONE_TEST) || */
	/* defined(ATE_BUILD) defined(BCMDVFS) */

#define PCIE_CFG_DA_OFFSET 0x400	/* direct access register offset for configuration space */

/* 10th and 11th 4KB BAR0 windows */
#define PCIE_TER_BAR0_WIN	0xc50
#define PCIE_TER_BAR0_WRAPPER	0xc54

/* PCI control */
#define PCIE_RST_OE	0x01	/* When set, drives PCI_RESET out to pin */
#define PCIE_RST	0x02	/* Value driven out to pin */
#define PCIE_SPERST	0x04	/* SurvivePeRst */
#define PCIE_FORCECFGCLKON_ALP	0x08
#define PCIE_DISABLE_L1CLK_GATING	0x10
#define PCIE_DLYPERST	0x100	/* Delay PeRst to CoE Core */
#define PCIE_DISSPROMLD	0x200	/* DisableSpromLoadOnPerst */
#define PCIE_WakeModeL2	0x1000	/* Wake on L2 */
#define PCIE_MULTIMSI_EN		0x2000	/* enable multi-vector MSI messages */
#define PCIE_PipeIddqDisable0	0x8000	/* Disable assertion of pcie_pipe_iddq during L1.2 and L2 */
