#ifndef _H_SD_PROTOCOL
#define _H_SD_PROTOCOL

#include <linux/slab.h>
#include <linux/cardreader/cardreader.h>
#include <linux/cardreader/card_block.h>
#include <linux/cardreader/sdio_hw.h>

#include <mach/am_regs.h>
#include <mach/irqs.h>
#include <mach/card_io.h>

typedef enum _SDIO_CMD_ERR {
	SDIO_NONE_ERR,
	SDIO_PACK_CRC_ERR,
	SDIO_PACK_TIMEOUT_ERR,
	SDIO_RES_CRC_ERR,
	SDIO_RES_TIMEOUT_ERR
} SDIO_CMD_ERR;

//Never change any sequence of following data variables
#pragma pack(1)


/**********************
	SDXC regs (9)
***********************/

#define SDHC_BASE 0xC1108E00

#define SDHC_ARGU 0x2380
#define SDHC_SEND 0x2381
#define SDHC_CTRL 0x2382
#define SDHC_STAT 0x2383
#define SDHC_CLKC 0x2384
#define SDHC_ADDR 0x2385
#define SDHC_PDMA 0x2386
#define SDHC_MISC 0x2387
#define SDHC_DATA 0x2388
#define SDHC_ICTL 0x2389
#define SDHC_ISTA 0x238A
#define SDHC_SRST 0x238B

extern int using_sdxc_controller;

// 0 : SDHC_ARGU
typedef struct SDXC_Arg_Reg {
	unsigned long command;
} SDXC_Arg_Reg_t;

// 1 : SDHC_SEND
typedef struct SDXC_Send_Reg {
	unsigned command_index : 6;
	unsigned command_has_resp : 1;
	unsigned command_has_data : 1;
	unsigned response_length : 1;
	unsigned response_no_crc : 1;
	unsigned data_direction : 1;
	unsigned data_stop : 1;
	unsigned total_pack : 20;
} SDXC_Send_Reg_t;

/*
//SDHC_CTRL
typedef struct SDXC_Ctrl_Reg {
	unsigned dat_width : 2;	//dat_type
	unsigned ddr_mode : 1;
	unsigned sdxc_soft_reset : 1;
	unsigned pack_len : 9;		//0:512, 1:1, ..., 511:511
	unsigned rx_timeout : 7;
	
	////unsigned sdxc_irq_en : 12;		//detail
	unsigned dma_done_int_en 	: 1;
	unsigned sdio_dat1_int_en 	: 1;		//@@
	unsigned rx_fifo_int_en 	: 1;
	unsigned tx_fifo_int_en 	: 1;
	
	unsigned data_complete_int_en 	: 1;	//@@
	unsigned pack_crc_err_int_en 	: 1;
	unsigned pack_timeout_int_en 	: 1;
	unsigned pack_complete_int_en 	: 1;
	
	unsigned dat0_ready_int_en 		: 1;
	
	unsigned res_crc_err_int_en 	: 1;
	unsigned res_timeout_int_en 	: 1;
	unsigned res_ok_int_en 			: 1;	//@@
} SDXC_Ctrl_Reg_t;
*/
// 2 : SDHC_CTRL
typedef struct SDXC_Ctrl_Reg {
	unsigned dat_width : 2;	//dat_type
	unsigned ddr_mode : 1;
	unsigned reserved1 : 1;
	unsigned pack_len : 9;		//0:512, 1:1, ..., 511:511
	unsigned rx_timeout : 7;
	unsigned rc_period : 4;
	unsigned endian : 2;		
	unsigned reserved2 : 6;		
} SDXC_Ctrl_Reg_t;

/*
//SDHC_STAT
typedef struct SDXC_Status_Reg {
	unsigned busy : 1;
	unsigned dat_state : 4;
	unsigned cmd_state : 1;
	unsigned request_rx : 1;	//???	set when rx_count >= rx_threshold
	unsigned request_tx : 1;	//???	set when tx_count <= tx_threshold
	unsigned tx_count : 6;
	unsigned rx_count : 6;
	
	////unsigned sdxc_irq_state : 12;	//detail
	unsigned dma_done_int 		: 1;
	unsigned sdio_dat1_int 		: 1;		//@@
	unsigned rx_fifo_int 		: 1;
	unsigned tx_fifo_int 		: 1;
	
	unsigned data_complete_int 	: 1;		//@@
	unsigned pack_crc_err_int 	: 1;
	unsigned pack_timeout_int 	: 1;
	unsigned pack_complete_int 	: 1;
	
	unsigned dat0_ready_int 	: 1;
	
	unsigned res_crc_err_int 	: 1;
	unsigned res_timeout_int 	: 1;
	unsigned res_ok_int 		: 1;		//@@
} SDXC_Status_Reg_t;
*/
// 3 : SDHC_STAT
typedef struct SDXC_Status_Reg {
	unsigned busy : 1;
	unsigned dat_3_0 : 4;
	unsigned cmd_state : 1;
	unsigned reserved1 : 1;	
	unsigned reserved2 : 1;	
	unsigned rx_count : 6;
	unsigned tx_count : 6;
	unsigned dat_7_4 : 4;
	
	unsigned reserved3 : 8;	
} SDXC_Status_Reg_t;

/*
//SDHC_CLKC
typedef struct SDXC_Clk_Reg {
	unsigned clk_div : 16;
	unsigned clk_in_sel : 3;
	unsigned clk_en : 1;
	unsigned phase_sel : 2;
	unsigned reserved1 : 1;
	unsigned clk_ctl_en : 1;	//???  write 0,  change, write 1
	unsigned sdio_dat1_irq2_en : 1;
	unsigned sdio_dat1_irq2_delay : 2;
	unsigned reserved2 : 5;
} SDXC_Clk_Reg_t;
*/
// 4 : SDHC_CLKC
typedef struct SDXC_Clk_Reg {
	unsigned clk_div : 16;
	unsigned clk_in_sel : 3;
	unsigned clk_en : 1;
	unsigned rx_clk_phase_sel : 2;
	unsigned rx_clk_feedback_en : 1;
	unsigned clk_ctl_en : 1;	//???  write 0,  change, write 1
	unsigned clk_jic_control : 1;	//???
	unsigned reserved1 : 7;
} SDXC_Clk_Reg_t;

// 5 : SDHC_ADDR
typedef struct SDXC_Addr_Reg {
	unsigned long dma_addr;
} SDXC_Addr_Reg_t;

// 6 : SDHC_PDMA
typedef struct SDXC_PDMA_Reg {
	unsigned dma_mode : 1;		//0:PIO, 1:DMA
	unsigned pio_rd_resp : 3;	//0:[39:8],  1:1st long,  2:2nd long, ...,  6 or 7:cmd arg
	unsigned dma_urgent : 1;
	unsigned wr_burst : 5;
	unsigned rd_burst : 5;
	unsigned rx_threshold : 6;
	unsigned tx_threshold : 6;
	unsigned rx_manual_flush : 1;	//???
	unsigned reserved1 : 4;
} SDXC_PDMA_Reg_t;

/*
//SDHC_MISC
typedef struct SDXC_Misc_Reg {
	unsigned cmd_line_delay : 2;	//for tuning
	unsigned dat_line_delay : 2;	//for tuning
	unsigned manual_stop : 1;
	unsigned ext_ctrl : 1;
	unsigned burst_num : 6;
	unsigned thread_id : 6;
	unsigned pio_rd_flag : 1;
	unsigned pio_rd_mode : 1;		//0:one time mode,  1:burst mode
	unsigned rx_limit : 6;
	unsigned tx_limit : 6;
} SDXC_Misc_Reg_t;
*/
// 7 : SDHC_MISC
typedef struct SDXC_Misc_Reg {
	unsigned cmd_line_delay : 2;	//for tuning
	unsigned dat_line_delay : 2;	//for tuning
	unsigned rx_full_threshold : 6;		//default : 30
	unsigned tx_empty_threshold : 6;	//default : 0
	unsigned burst_num : 6;
	unsigned thread_id : 6;
	unsigned manual_stop : 1;
	unsigned reserved1 : 3;
} SDXC_Misc_Reg_t;

// 8 : SDHC_DATA
typedef struct SDXC_Data_Reg {
	unsigned long value;
} SDXC_Data_Reg_t;

// 9 : SDHC_ICTL
typedef struct SDXC_Ictl_Reg {	//interrupt control
	unsigned res_ok_int_en 			: 1;	//@@
	unsigned res_timeout_int_en 	: 1;
	unsigned res_crc_err_int_en 	: 1;
	unsigned dat0_ready_int_en 		: 1;

	unsigned pack_complete_int_en 	: 1;
	unsigned pack_timeout_int_en 	: 1;
	unsigned pack_crc_err_int_en 	: 1;
	unsigned data_complete_int_en 	: 1;	//@@

	unsigned rx_fifo_int_en 	: 1;
	unsigned tx_fifo_int_en 	: 1;
	unsigned sdio_dat1_int_en 	: 1;		//@@
	unsigned dma_done_int_en 	: 1;

	unsigned rx_fifo_full_int_en 			: 1;
	unsigned tx_fifo_empty_int_en 			: 1;
	unsigned additional_sdio_dat1_int_en 	: 1;		//???

	unsigned reserved1 : 1;	
	unsigned sdio_dat1_mask_delay : 2;	
	unsigned reserved2 : 14;
} SDXC_Ictl_Reg_t;

// A : SDHC_ISTA
typedef struct SDXC_Ista_Reg {	//interrupt status
	unsigned res_ok_int 		: 1;		//@@
	unsigned res_timeout_int 	: 1;
	unsigned res_crc_err_int 	: 1;
	unsigned dat0_ready_int 	: 1;

	unsigned pack_complete_int 	: 1;
	unsigned pack_timeout_int 	: 1;
	unsigned pack_crc_err_int 	: 1;
	unsigned data_complete_int 	: 1;		//@@

	unsigned rx_fifo_int 		: 1;
	unsigned tx_fifo_int 		: 1;
	unsigned sdio_dat1_int 		: 1;		//@@
	unsigned dma_done_int 		: 1;

	unsigned rx_fifo_full_int 	: 1;
	unsigned tx_fifo_empty_int 	: 1;
	unsigned additional_sdio_dat1_int 	: 1;		//???

	unsigned reserved1 : 17;
} SDXC_Ista_Reg_t;

// B : SDHC_SRST
typedef struct SDXC_Srst_Reg {	//soft reset
	unsigned main_ctrl_srst : 1;
	unsigned rx_fifo_srst : 1;
	unsigned tx_fifo_srst : 1;
	unsigned rx_dphy_srst : 1;	//manual clear
	unsigned tx_dphy_srst : 1;	//manual clear
	unsigned dma_srst : 1;
	unsigned reserved1 : 26;
} SDXC_Srst_Reg_t;


typedef struct _SD_REG_SSR {
	unsigned Reserved1_1 : 5;
	unsigned SECURE_MODE : 1;
	unsigned DAT_BUS_WIDTH : 2;
	
	unsigned Reserved2 : 6;
	unsigned Reserved1_2 : 2;
	
	unsigned short SD_CARD_TYPE;			// 16
	
	unsigned int SIZE_OF_PROTECTED_AREA;	// 32
	unsigned char SPEED_CLASS;				//8
	unsigned char PERPORMANCE_MOVE;			//8
	
	unsigned Reserved3 : 4;
	unsigned AU_SIZE : 4;
	
	unsigned short ERASE_SIZE;				// 16

	unsigned ERASE_OFFSET : 2;
	unsigned ERASE_TIMEOUT : 6;
	
	unsigned char Reserved4[11];			// 88
	unsigned char Reserved5[39];			// 312
} SD_REG_SSR_t;
    
//MSB->LSB, structure for Operation Conditions Register
typedef struct _SD_REG_OCR {

	//unsigned Reserved0:6;	
	unsigned S18A : 1;
	unsigned Reserved0 : 5;
	unsigned Card_Capacity_Status:1;	//Card_High_capacity
	unsigned Card_Busy:1;	//Card power up status bit (busy)

	unsigned VDD_28_29:1;	/* VDD voltage 2.8 ~ 2.9 */
	unsigned VDD_29_30:1;	/* VDD voltage 2.9 ~ 3.0 */
	unsigned VDD_30_31:1;	/* VDD voltage 3.0 ~ 3.1 */
	unsigned VDD_31_32:1;	/* VDD voltage 3.1 ~ 3.2 */	
	unsigned VDD_32_33:1;	/* VDD voltage 3.2 ~ 3.3 */	
	unsigned VDD_33_34:1;	/* VDD voltage 3.3 ~ 3.4 */	
	unsigned VDD_34_35:1;	/* VDD voltage 3.4 ~ 3.5 */	
	unsigned VDD_35_36:1;	/* VDD voltage 3.5 ~ 3.6 */	

	unsigned VDD_20_21:1;	/* VDD voltage 2.0 ~ 2.1 */	
	unsigned VDD_21_22:1;	/* VDD voltage 2.1 ~ 2.2 */	
	unsigned VDD_22_23:1;	/* VDD voltage 2.2 ~ 2.3 */	
	unsigned VDD_23_24:1;	/* VDD voltage 2.3 ~ 2.4 */
	unsigned VDD_24_25:1;	/* VDD voltage 2.4 ~ 2.5 */	
	unsigned VDD_25_26:1;	/* VDD voltage 2.5 ~ 2.6 */	
	unsigned VDD_26_27:1;	/* VDD voltage 2.6 ~ 2.7 */	
	unsigned VDD_27_28:1;	/* VDD voltage 2.7 ~ 2.8 */

	unsigned Reserved4:1;	/* MMC VDD voltage 1.45 ~ 1.50 */
	unsigned Reserved3:1;	/* MMC VDD voltage 1.50 ~ 1.55 */	
	unsigned Reserved2:1;	/* MMC VDD voltage 1.55 ~ 1.60 */	
	unsigned Reserved1:1;	/* MMC VDD voltage 1.60 ~ 1.65 */	
	unsigned VDD_16_17:1;	/* VDD voltage 1.6 ~ 1.7 */	
	unsigned VDD_17_18:1;	/* VDD voltage 1.7 ~ 1.8 */	
	unsigned VDD_18_19:1;	/* VDD voltage 1.8 ~ 1.9 */	
	unsigned VDD_19_20:1;	/* VDD voltage 1.9 ~ 2.0 */
} SD_REG_OCR_t;


typedef struct _SDIO_REG_OCR {

	unsigned VDD_28_29:1;	/* VDD voltage 2.8 ~ 2.9 */
	unsigned VDD_29_30:1;	/* VDD voltage 2.9 ~ 3.0 */
	unsigned VDD_30_31:1;	/* VDD voltage 3.0 ~ 3.1 */	
	unsigned VDD_31_32:1;	/* VDD voltage 3.1 ~ 3.2 */
	unsigned VDD_32_33:1;	/* VDD voltage 3.2 ~ 3.3 */	
	unsigned VDD_33_34:1;	/* VDD voltage 3.3 ~ 3.4 */	
	unsigned VDD_34_35:1;	/* VDD voltage 3.4 ~ 3.5 */	
	unsigned VDD_35_36:1;	/* VDD voltage 3.5 ~ 3.6 */
	
	unsigned VDD_20_21:1;	/* VDD voltage 2.0 ~ 2.1 */
	unsigned VDD_21_22:1;	/* VDD voltage 2.1 ~ 2.2 */
	unsigned VDD_22_23:1;	/* VDD voltage 2.2 ~ 2.3 */
	unsigned VDD_23_24:1;	/* VDD voltage 2.3 ~ 2.4 */
	unsigned VDD_24_25:1;	/* VDD voltage 2.4 ~ 2.5 */
	unsigned VDD_25_26:1;	/* VDD voltage 2.5 ~ 2.6 */
	unsigned VDD_26_27:1;	/* VDD voltage 2.6 ~ 2.7 */
	unsigned VDD_27_28:1;	/* VDD voltage 2.7 ~ 2.8 */	

	unsigned Reserved:8;	/* reserved */
} SDIO_REG_OCR_t;

//MSB->LSB, structure for Card_Identification Register
typedef struct _SD_REG_CID {

	unsigned char MID;	//Manufacturer ID
	char OID[2];		//OEM/Application ID	
	char PNM[5];		//Product Name
	unsigned char PRV;	//Product Revision
	unsigned long PSN;	//Serial Number
	unsigned MDT_high:4;	//Manufacture Date Code
	unsigned Reserved:4;	
	unsigned MDT_low:8;	// MDT = (MDT_high << 8) | MDT_low
	unsigned NotUsed:1;
	unsigned CRC:7;	//CRC7 checksum
} SD_REG_CID_t;

//MSB->LSB, structure for Card-Specific Data Register
typedef struct _SD_REG_CSD {

	unsigned Reserved1:2;
	unsigned MMC_SPEC_VERS:4;	//MMC Spec_vers
	unsigned CSD_STRUCTURE:2;	//CSD structure	

	unsigned TAAC:8;	//data read access-time-1
	unsigned NSAC:8;	//data read access-time-2 in CLK cycles(NSAC*100)
	unsigned TRAN_SPEED:8;	//max. data transfer rate
	unsigned CCC_high:8;	//card command classes	

	unsigned READ_BL_LEN:4;	//max. read data block length
	unsigned CCC_low:4;	// CCC = (CCC_high << 4) | CCC_low

	unsigned C_SIZE_high:2;	//device size
	unsigned Reserved2:2;
	unsigned DSR_IMP:1;	//DSR implemented
	unsigned READ_BLK_MISALIGN:1;	//read block misalignment
	unsigned WRITE_BLK_MISALIGN:1;	//write block misalignment
	unsigned READ_BL_PARTIAL:1;	//partial blocks for read allowed
	
	unsigned C_SIZE_mid:8;

	unsigned VDD_R_CURR_MAX:3;	//max. read current @VDD max
	unsigned VDD_R_CURR_MIN:3;	//max. read current @VDD min
	unsigned C_SIZE_low:2;	// C_SIZE = (C_SIZE_high << 10) | (C_SIZE_mid << 2) | C_SIZE_low

	unsigned C_SIZE_MULT_high:2;	
	unsigned VDD_W_CURR_MAX:3;	//max. write current @VDD max
	unsigned VDD_W_CURR_MIN:3;	//max. write current @VDD min
	
	unsigned SECTOR_SIZE_high:6;	//erase sector size
	unsigned ERASE_BLK_EN:1;	//erase single block enable
	unsigned C_SIZE_MULT_low:1;	// C_SIZE_MULT = (C_SIZE_MULT_high << 1) | C_SIZE_MULT_low
	
	unsigned WP_GRP_SIZE:7;	//write protect group size
	unsigned SECTOR_SIZE_low:1;	// SECTOR_SIZE = (SECTOR_SIZE_high << 1) | SECTOR_SIZE_low
	
	unsigned WRITE_BL_LEN_high:2;	//max. write data block length
	unsigned R2W_FACTOR:3;	//write speed factor
	unsigned Reserved3:2;
	
	unsigned WP_GRP_ENABLE:1;	//write protect group enable
	unsigned Reserved4:5;	
	unsigned WRITE_BL_PARTIAL:1;	//partial blocks for write allowed
	unsigned WRITE_BL_LEN_low:2;	//WRITE_BL_LEN = (WRITE_BL_LEN_high << 2) | WRITE_BL_LEN_low
	
	unsigned Reserved5:2;
	unsigned FILE_FORMAT:2;	//File format
	unsigned TMP_WRITE_PROTECT:1;	//temporary write protection
	unsigned PERM_WRITE_PROTECT:1;	//permanent write protection
	unsigned COPY:1;	//copy flag (OTP)
	unsigned FILE_FORMAT_GRP:1;	//File format group
	
	unsigned NotUsed:1;	
	unsigned CRC:7;	//CRC checksum
} SD_REG_CSD_t;


typedef struct _SDHC_REG_CSD {
	
	unsigned Reserved1:6;
	unsigned CSD_STRUCTURE:2;	//CSD structure
	
	unsigned TAAC:8;	//data read access-time-1
	unsigned NSAC:8;	//data read access-time-2 in CLK cycles(NSAC*100)
	unsigned TRAN_SPEED:8;	//max. data transfer rate
	
	unsigned CCC_high:8;	//card command classes
	unsigned READ_BL_LEN:4;	//max. read data block length
	unsigned CCC_low:4;	// CCC = (CCC_high << 4) | CCC_low
	
	unsigned Reserved2:4;
	unsigned DSR_IMP:1;	//DSR implemented
	unsigned READ_BLK_MISALIGN:1;	//read block misalignment
	unsigned WRITE_BLK_MISALIGN:1;	//write block misalignment
	unsigned READ_BL_PARTIAL:1;	//partial blocks for read allowed
	
	unsigned C_SIZE_high:6;	//device size       
	unsigned Reserved3:2;

	unsigned C_SIZE_mid:8;
	unsigned C_SIZE_low:8;
	
	unsigned SECTOR_SIZE_high:6;	//erase sector size
	unsigned ERASE_BLK_EN:1;	//erase single block enable
	unsigned Reserved4:1;
	
	unsigned WP_GRP_SIZE:7;	//write protect group size
	unsigned SECTOR_SIZE_low:1;	// SECTOR_SIZE = (SECTOR_SIZE_high << 1) | SECTOR_SIZE_low
	
	unsigned WRITE_BL_LEN_high:2;	//max. write data block length
	unsigned R2W_FACTOR:3;	//write speed factor
	unsigned Reserved5:2;
	unsigned WP_GRP_ENABLE:1;	//write protect group enable
		
	unsigned Reserved6:5;
	unsigned WRITE_BL_PARTIAL:1;	//partial blocks for write allowed
	unsigned WRITE_BL_LEN_low:2;	//WRITE_BL_LEN = (WRITE_BL_LEN_high << 2) | WRITE_BL_LEN_low

	unsigned Reserved7:2;
	unsigned FILE_FORMAT:2;	//File format
	unsigned TMP_WRITE_PROTECT:1;	//temporary write protection
	unsigned PERM_WRITE_PROTECT:1;	//permanent write protection
	unsigned COPY:1;	//copy flag (OTP)
	unsigned FILE_FORMAT_GRP:1;	//File format group

	unsigned NotUsed:1;	
	unsigned CRC:7;	//CRC checksum
} SDHC_REG_CSD_t;

/*typedef struct _MMC_REG_EXT_CSD
{
    unsigned char Reserved1[7];
    unsigned char S_CMD_SET;
    unsigned char Reserved2[300];
    unsigned char PWR_CL_26_360;
    unsigned char PWR_CL_52_360;
    unsigned char PWR_CL_26_195;
    unsigned char PWR_CL_52_195;
    unsigned char Reserved3[3];
    unsigned char CARD_TYPE;
    unsigned char Reserved4;
    unsigned char CSD_STRUCTURE;
    unsigned char Reserved5;
    unsigned char EXT_CSD_REV;
    unsigned char CMD_SET;
    unsigned char Reserved6;
    unsigned char CMD_SET_REV;
    unsigned char Reserved7;
    unsigned char POWER_CLASS;
    unsigned char Reserved8;
    unsigned char HS_TIMING;
    unsigned char Reserved9;
    unsigned char BUS_WIDTH;
    unsigned char Reserved10[183];
            } MMC_REG_EXT_CSD_t;*/// reserved for future use
typedef struct _MMC_REG_EXT_CSD
{
 	unsigned char Reserved26[134];                 //133
 	unsigned char SEC_BAD_BLK_MGMNT;               //134
 	unsigned char Reserved25;                      //135
 	unsigned char ENH_START_ADDR[4];               //136
 	unsigned char ENH_SIZE_MULT[3];                //140
 	unsigned char GP_SIZE_MULT[12];                //143
 	unsigned char PARTITION_SETTING_COMPLETED;     //155
 	unsigned char PARTITIONS_ATTRIBUTE;            //156
 	unsigned char MAX_ENH_SIZE_MULT[3];            //157
 	unsigned char PARTITIONING_SUPPORT;            //160
 	unsigned char HPI_MGMT;                        //161
 	unsigned char RST_n_FUNCTION;                  //162
 	unsigned char BKOPS_EN;                        //163
 	unsigned char BKOPS_START;                     //164
 	unsigned char Reserved24;                      //165
 	unsigned char WR_REL_PARAM;                    //166
 	unsigned char WR_REL_SET;                      //167
 	unsigned char RPMB_SIZE_MULT;                  //168
 	unsigned char FW_CONFIG;                       //169
 	unsigned char Reserved23; 	                   //170
 	unsigned char USER_WP;                         //171
 	unsigned char Reserved22;                      //172
 	unsigned char BOOT_WP;                         //173
 	unsigned char Reserved21; 	                   //174
 	unsigned char ERASE_GROUP_DEF;                 //175
 	unsigned char Reserved20; 	                   //176
 	unsigned char BOOT_BUS_WIDTH;                  //177
 	unsigned char BOOT_CONFIG_PROT;                //178
 	unsigned char PARTITION_CONFIG;                //179
 	unsigned char Reserved19;                      //180
 	unsigned char ERASED_MEM_CONT;                 //181
 	unsigned char Reserved18;                      //182
 	unsigned char BUS_WIDTH;                       //183
 	unsigned char Reserved17;                      //184
 	unsigned char HS_TIMING;                       //185
 	unsigned char Reserved16;                      //186
 	unsigned char POWER_CLASS;                     //187
 	unsigned char Reserved15;                      //188
 	unsigned char CMD_SET_REV;                     //189
 	unsigned char Reserved14;                      //190 
 	unsigned char CMD_SET;                         //191
 	unsigned char EXT_CSD_REV;                     //192
 	unsigned char Reserved13;                      //193
 	unsigned char CSD_STRUCTURE;                   //194
 	unsigned char Reserved12;                      //195
 	unsigned char CARD_TYPE;                       //196
 	unsigned char Reserved11;                      //197
 	unsigned char OUT_OF_INTERRUPT_TIME;           //198
 	unsigned char PARTITION_SWITCH_TIME;           //199
 	unsigned char PWR_CL_52_195;                   //200
 	unsigned char PWR_CL_26_195;                   //201
 	unsigned char PWR_CL_52_360;                   //202
 	unsigned char PWR_CL_26_360;                   //203
 	unsigned char Reserved10;                      //204
 	unsigned char MIN_PERF_R_4_26;                 //205
 	unsigned char MIN_PERF_W_4_26;                 //206
 	unsigned char MIN_PERF_R_8_26_4_52;            //207
 	unsigned char MIN_PERF_W_8_26_4_52;            //208
 	unsigned char MIN_PERF_R_8_52;                 //209
 	unsigned char MIN_PERF_W_8_52;                 //210
 	unsigned char Reserved9;                       //211
 	unsigned char SEC_COUNT[4];                    //212
 	unsigned char Reserved8;                       //216
 	unsigned char S_A_TIMEOUT;                     //217
 	unsigned char Reserved7;                       //218
 	unsigned char S_C_VCCQ;                        //219
 	unsigned char S_C_VCC;                         //220
 	unsigned char HC_WP_GRP_SIZE;                  //221
 	unsigned char REL_WR_SEC_C;                    //222
 	unsigned char ERASE_TIMEOUT_MULT;              //223
 	unsigned char HC_ERASE_GRP_SIZE;               //224
 	unsigned char ACC_SIZE;                        //225
 	unsigned char BOOT_SIZE_MULTI;                 //226
 	unsigned char Reserved6;                       //227
 	unsigned char BOOT_INFO;                       //228
 	unsigned char SEC_TRIM_MULT;                   //229
 	unsigned char SEC_ERASE_MULT;                  //230
 	unsigned char SEC_FEATURE_SUPPORT;             //231
 	unsigned char TRIM_MULT;                       //232
 	unsigned char Reserved5;                       //233
 	unsigned char MIN_PERF_DDR_R_8_52;             //234
 	unsigned char MIN_PERF_DDR_W_8_52;             //235
 	unsigned char Reserved4[2];                    //236
 	unsigned char PWR_CL_DDR_52_195;               //238
 	unsigned char PWR_CL_DDR_52_360;               //239
 	unsigned char Reserved3;                       //240
 	unsigned char INI_TIMEOUT_AP;                  //241
 	unsigned char CORRECTLY_PRG_SECTORS_NUM[4];    //242
 	unsigned char BKOPS_STATUS;                    //246
 	unsigned char Reserved2[255];                  //247
 	unsigned char BKOPS_SUPPORT;                   //502
 	unsigned char HPI_FEATURES;                    //503
 	unsigned char S_CMD_SET;                       //504
    unsigned char Reserved1[7];                    //505
} MMC_REG_EXT_CSD_t;
    
//MSB->LSB, structure for SD CARD Configuration Register
typedef struct _SD_REG_SCR {
	
	unsigned SD_SPEC:4;	//SD Card¡ªSpec. Version
	unsigned SCR_STRUCTURE:4;	//SCR Structure
	
	unsigned SD_BUS_WIDTHS:4;	//DAT Bus widths supported
	unsigned SD_SECURITY:3;	//SD Security Support
	unsigned DATA_STAT_AFTER_ERASE:1;	//data_status_after erases
	
	//unsigned Reserved1:16;	//for alignment
	unsigned CMD_SUPPORT : 2;
	unsigned Reserved1 : 13;
	unsigned SD_SPEC3 : 1;
	
	unsigned long Reserved2;
} SD_REG_SCR_t;


typedef struct _SDIO_REG_CCCR {

	unsigned char CCCR_SDIO_SPEC;	//cccr and sdio spec verion low four bits(cccr) high four bits(sdio)
	unsigned char SD_SPEC;	//SD Card¡ªSpec. Version low four bits
	unsigned char IO_ENABLE;	//
	unsigned char IO_READY;	//
	unsigned char INT_ENABLE;	//
	unsigned char INT_PENDING;
	unsigned char INT_ABORT;
	unsigned char BUS_Interface_Control;
	unsigned char Card_Capability;	
