share/man/man4/acpicbkbd.4
.\"	$OpenBSD: acpicbkbd.4,v 1.1 2016/08/23 18:39:08 jcs Exp $
.\"
.\" Copyright (c) 2016 joshua stein <jcs@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 23 2016 $
.Dt ACPICBKBD 4
.Os
.Sh NAME
.Nm acpicbkbd
.Nd Chromebook keyboard backlight
.Sh SYNOPSIS
.Cd "acpicbkbd* at acpi?"
.Sh DESCRIPTION
The
.Nm
driver enables adjustment of the keyboard backlight level on Chromebook
laptops with supported hardware.
Backlight levels can be retrieved and modified with the
.Xr wsconsctl 8
variable
.Va keyboard.backlight .
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr wsconsctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An joshua stein Aq Mt jcs@openbsd.org .
