share/man/man4/acpipwrres.4
.\"	$OpenBSD: acpipwrres.4,v 1.3 2020/04/06 00:01:08 pirofti Exp $
.\"
.\" Copyright (c) 2009 Paul Irofti <paul@irofti.net>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.\"
.Dd $Mdocdate: April 6 2020 $
.Dt ACPIPWRRES 4
.Os
.Sh NAME
.Nm acpipwrres
.Nd ACPI power resources
.Sh SYNOPSIS
.Cd "acpipwrres* at acpi?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the ACPI power resources management.
A power resource refers to a software-controllable power plane, clock plane or
other resource upon which an integrated ACPI power-managed device might rely.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.6 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Paul Irofti Aq Mt paul@irofti.net .
