share/man/man4/acpihve.4
.\"	$OpenBSD: acpihve.4,v 1.2 2018/04/28 15:44:59 jasper Exp $
.\"
.\" Copyright (c) 2017 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: April 28 2018 $
.Dt ACPIHVE 4
.Os
.Sh NAME
.Nm acpihve
.Nd Hyper-V entropy
.Sh SYNOPSIS
.Cd "acpihve* at acpi?"
.Sh DESCRIPTION
Hyper-V hosts make entropy available to guests in the OEM0 ACPI table.
The
.Nm
driver feeds this entropy into the kernel's entropy pool.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr enqueue_randomness 9
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.1 .
