share/man/man4/acpitz.4
.\"	$OpenBSD: acpitz.4,v 1.6 2013/07/16 16:05:48 schwarze Exp $
.\"
.\" Copyright (c) 2006 Dmitri Alenitchev <dma@dma.org.ru>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 16 2013 $
.Dt ACPITZ 4
.Os
.Sh NAME
.Nm acpitz
.Nd ACPI thermal zone
.Sh SYNOPSIS
.Cd "acpitz* at acpi?"
.Sh DESCRIPTION
The
.Nm
driver supports ACPI Thermal Zones.
Temperature information is available through this driver as a sensor
which is updated every 10 seconds or, if the implementation supports it,
via an event.
If the temperature exceeds the
.Sq critical
temperature threshold, the system will be shut down and powered off.
The sensor provided by
.Nm
can be monitored using
.Xr sysctl 8
or
.Xr sensorsd 8 .
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr intro 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.8 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Can Erkin Acar Aq Mt canacar@openbsd.org .
