share/man/man4/amldwusb.4
.\"	$OpenBSD: amldwusb.4,v 1.1 2019/08/29 17:40:57 kettenis Exp $
.\"
.\" Copyright (c) 2019 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 29 2019 $
.Dt AMLDWUSB 4
.Os
.Sh NAME
.Nm amldwusb
.Nd Amlogic USB 3.0 glue logic
.Sh SYNOPSIS
.Cd "amldwusb* at fdt?"
.Cd "xhci* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver controls the interface logic for the Synopsys DesignWare USB
3.0 controller on Amlogic SoCs.
.Sh SEE ALSO
.Xr amlpciephy 4 ,
.Xr amlusbphy 4 ,
.Xr intro 4 ,
.Xr xhci 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 6.6 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
