share/man/man4/amlsm.4
.\"	$OpenBSD: amlsm.4,v 1.2 2020/06/20 21:16:14 jmc Exp $
.\"
.\" Copyright (c) 2020 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: June 20 2020 $
.Dt AMLSM 4
.Os
.Sh NAME
.Nm amlsm
.Nd Amlogic secure monitor
.Sh SYNOPSIS
.Cd "amlsm* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the secure monitor firmware interface on
various Amlogic SOCs.
It uses this interface to read the chip ID of the SoC and feeds it to
the random subsystem's entropy pool.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr random 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 6.7 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
