share/man/man4/amluart.4
.\"	$OpenBSD: amluart.4,v 1.2 2020/06/20 21:16:14 jmc Exp $
.\"
.\" Copyright (c) 2019 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: June 20 2020 $
.Dt AMLUART 4
.Os
.Sh NAME
.Nm amluart
.Nd Amlogic Universal Asynchronous Receiver/Transmitter
.Sh SYNOPSIS
.Cd "amluart* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver supports the Amlogic Universal Asynchronous
Receiver/Transmitter (UART).
.Sh SEE ALSO
.Xr tty 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.6 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
