share/man/man4/asbtm.4
.\"	$OpenBSD: asbtm.4,v 1.5 2013/07/16 16:05:48 schwarze Exp $
.\"
.\" Copyright (c) 2005 Damien Miller <djm@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 16 2013 $
.Dt ASBTM 4
.Os
.Sh NAME
.Nm asbtm
.Nd Asus ASB 100 temperature sensor
.Sh SYNOPSIS
.Cd "asbtm* at iic?"
.Sh DESCRIPTION
The
.Nm
driver supports the Asus ASB 100 temperature sensor, making its sensor
readings available through a
.Xr sysctl 8
interface.
.Pp
The driver reads seven voltage (A/D) inputs, three fan inputs, two on-chip
temperature sensors and up to two satellite temperature sensors.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Damien Miller Aq Mt djm@openbsd.org .
