share/man/man4/bcmdmac.4
.\"	$OpenBSD: bcmdmac.4,v 1.2 2020/04/22 11:35:03 jmc Exp $
.\"
.\" Copyright (c) 2020 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: April 22 2020 $
.Dt BCMDMAC 4
.Os
.Sh NAME
.Nm bcmdmac
.Nd Broadcom BCM238x DMA controller
.Sh SYNOPSIS
.Cd "bcmdmac* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the DMA controller integrated on Broadcom
BCM283x and BCM2711 SoCs.
.Pp
The controller is used to support DMA for devices that don't provide a
DMA controller of their own.
.Sh SEE ALSO
.Xr bcmsdhost 4 ,
.Xr intro 4
.Sh HISTORY
.Ox
support for
.Nm
first appeared in
.Ox 6.7 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Jared D. McNeill
for
.Nx
and ported to
.Ox
by
.An Neil Ashford Aq Mt ashfordneil0@gmail.com
and
.An Tobias Heider Aq Mt tobhe@openbsd.org .
