share/man/man4/bcmmbox.4
.\"	$OpenBSD: bcmmbox.4,v 1.1 2020/04/19 16:09:45 tobhe Exp $
.\"
.\" Copyright (c) 2020 Tobias Heider <tobhe@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: April 19 2020 $
.Dt BCMMBOX 4
.Os
.Sh NAME
.Nm bcmmbox
.Nd Broadcom BCM283x VideoCore Mailboxes
.Sh SYNOPSIS
.Cd "bcmmbox* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver handles communication with the VideoCore on Broadcom BCM2835, BCM2836
and BCM2837 SoCs.
.Sh SEE ALSO
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.7 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Neil Ashford Aq Mt ashfordneil0@gmail.com
and
.An Tobias Heider Aq Mt tobhe@openbsd.org .
