share/man/man4/bcmstbreset.4
.\"	$OpenBSD: bcmstbreset.4,v 1.1 2025/08/20 12:14:21 kettenis Exp $
.\"
.\" Copyright (c) 2025 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 20 2025 $
.Dt BCMSTBRESET 4
.Os
.Sh NAME
.Nm bcmstbreset
.Nd Broadcom Set-top Box reset controller
.Sh SYNOPSIS
.Cd "bcmstbreset* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver controls the reset signals for integrated components of
Broadcom Set-top Box SoCs.
This includes the Broadcom BCM2712 SoC that is used in the Raspberry
Pi 5.
It does not provide direct device driver entry points but makes its
functions available to other drivers.
.Sh SEE ALSO
.Xr intro 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 7.8 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
