share/man/man4/bcmstbpinctrl.4
.\"	$OpenBSD: bcmstbpinctrl.4,v 1.1 2025/08/19 11:58:31 kettenis Exp $
.\"
.\" Copyright (c) 2025 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 19 2025 $
.Dt BCMSTBPINCTRL 4
.Os
.Sh NAME
.Nm bcmstbpinctrl
.Nd Broadcom Set-top Box pin multiplexing
.Sh SYNOPSIS
.Cd "bcmstbpinctrl* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver uses pin control data from the device tree to select one of
multiple possible roles available for pins on Broadcom Set-top Box
SoCs.
This includes the Broadcom BCM2712 SoC that is used in the Raspberry
Pi 5.
It does not provide direct device driver entry points but makes its
functions available to other drivers.
.Sh SEE ALSO
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.8 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
