share/man/man4/cdsdhc.4
.\"	$OpenBSD: cdsdhc.4,v 1.1 2022/01/18 07:53:39 visa Exp $
.\"
.\" Copyright (c) 2022 Visa Hankala
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: January 18 2022 $
.Dt CDSDHC 4
.Os
.Sh NAME
.Nm cdsdhc
.Nd Cadence SD/SDIO/eMMC host controller
.Sh SYNOPSIS
.Cd "cdsdhc* at fdt?"
.Cd "sdmmc* at cdsdhc?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Cadence SD/SDIO/eMMC host controller,
which provides an interface to the
.Xr sdmmc 4
bus.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr sdmmc 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.1 .
