share/man/man4/dwmmc.4
.\"	$OpenBSD: dwmmc.4,v 1.2 2023/04/04 00:38:38 jsg Exp $
.\"
.\" Copyright (c) 2017 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: April 4 2023 $
.Dt DWMMC 4
.Os
.Sh NAME
.Nm dwmmc
.Nd Synopsys DesignWare MMC/SD/SDIO controller
.Sh SYNOPSIS
.Cd "dwmmc* at fdt?"
.Cd "sdmmc* at dwmmc?"
.Sh DESCRIPTION
The
.Nm
driver provides support for various MMC/SD/SDIO controllers based on
the Synopsys DesignWare SD/eMMC core.
These controllers are typically found on SoCs, such as the Rockchip
RK3288/RK3399 and Samsung Exynos ARM SoCs.
.Pp
The
.Xr sdmmc 4
subsystem performs SD/MMC transactions to communicate with whatever
MMC/SD/SDIO devices are inserted into the card slot or directly
connected to the controller.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr sdmmc 4
.Sh HISTORY
.Ox
support for
.Nm
first appeared in
.Ox 6.2 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
