share/man/man4/endrun.4
.\"	$OpenBSD: endrun.4,v 1.3 2015/01/15 00:48:10 deraadt Exp $
.\"
.\" Copyright (c) 2008 Marc Balmer <mbalmer@openbsd.org>
.\" Copyright (c) 2009 Kevin Steves <stevesk@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: January 15 2015 $
.Dt ENDRUN 4
.Os
.Sh NAME
.Nm endrun
.Nd EndRun Technologies native time-of-day message timedelta sensor
.Sh SYNOPSIS
.Cd "pseudo-device endrun" Op Ar count
.Sh DESCRIPTION
This line discipline interfaces serial EndRun Technologies devices.
.Pp
The line discipline is enabled by the following sequence:
.Bd -literal -offset indent
#include <sys/ioctl.h>
int ldisc = ENDRUNDISC, fildes; ...
ioctl(fildes, TIOCSETD, &ldisc);
.Ed
.Pp
The byte stream is unaltered by the line discipline which
maintains a timedelta sensor using the EndRun data.
The timedelta sensor will appear as endrun* in the list of sensors and the delta
(in nanoseconds) between the received time information and the local time can
be accessed through the
.Xr sysctl 8
interface.
.Sh SENSOR STATES
The quality of the timedelta is reported as the sensor status:
.Bl -tag -width "CRITICALXX" -offset indent
.It OK
The time information is valid.
The timedelta is safe to use for applications like
.Xr ntpd 8 .
.It WARN
The attached receiver has been indicating a warning condition
for at least the last ten minutes.
The timedelta should be used with care.
.It CRITICAL
tty timestamping has been turned on but there is no PPS signal present or the
receiver indicated a warning condition for at least the last twenty minutes.
Check your hardware.
.El
.Pp
The status of a second sensor is used to report the status of the
device itself using the Time Figure Of Merit (TFOM) character:
.Bl -tag -width "CRITICALXX" -offset indent
.It OK
The clock is synchronized.
TFOM is 6-8.
.It WARN
The clock is synchronized and the time error is greater
than 10ms or the clock is in the unsynchronized state.
TFOM is 9.
.It CRITICAL
The TFOM is invalid.
.El
.Sh SEE ALSO
.Xr tty 4 ,
.Xr ldattach 8 ,
.Xr ntpd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
interface first appeared in
.Ox 4.6 .
