share/man/man4/epic.4
.\"     $OpenBSD: epic.4,v 1.10 2022/03/21 14:56:16 miod Exp $
.\"
.\" Copyright (c) 1998 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: March 21 2022 $
.Dt EPIC 4
.Os
.Sh NAME
.Nm epic
.Nd SMC 83C170 (EPIC/100) 10/100 Ethernet device
.Sh SYNOPSIS
.Cd "epic* at pci?"
.Cd "acphy* at mii?"
.Cd "lxtphy* at mii?"
.Cd "qsphy* at mii?"
.Sh DESCRIPTION
The
.Nm
interface provides access to the 10Mb/s and 100Mb/s Ethernet networks via the
.Tn SMC
.Tn EPIC
chipset.
This driver provides support for the
.Tn SMC
.Tn EtherPower II 10/100
Ethernet cards.
.Pp
The
.Nm
supports several media types, which are selected via the
.Xr ifconfig 8
command.
The supported media types are:
.Bl -tag -width 6n -offset indent
.It Cm media No autoselect
Attempt to autoselect the media type (default)
.It Cm media No 100baseFX Cm mediaopt No full-duplex
Use 100baseFX (fiber), full duplex
.It Cm media No 100baseFX Cm mediaopt No half-duplex
Use 100baseFX (fiber), half duplex
.It Cm media No 100baseTX Cm mediaopt No full-duplex
Use 100baseTX, full duplex
.It Cm media No 100baseTX Cm mediaopt No half-duplex
Use 100baseTX, half duplex
.It Cm media No 100baseTX Cm mediaopt No loopback
Put the interface into loopback mode
.It Cm media No 10baseT Cm mediaopt No full-duplex
Use 10baseT, full duplex
.It Cm media No 10baseT Cm mediaopt No half-duplex
Use 10baseT, half duplex
.It Cm media No 10baseT Cm mediaopt No loopback
Put the interface into loopback mode
.El
.Sh SEE ALSO
.Xr acphy 4 ,
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr inet 4 ,
.Xr intro 4 ,
.Xr lxtphy 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr qsphy 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Nx 1.4 .
.Ox
support was added in
.Ox 3.8 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Jason R. Thorpe Aq Mt thorpej@wasabisystems.com
and ported to
.Ox
by
.An Brad Smith Aq Mt brad@openbsd.org .
