share/man/man4/fusbtc.4
.\"	$OpenBSD: fusbtc.4,v 1.2 2019/05/12 08:56:10 jmc Exp $
.\"
.\" Copyright (c) 2019 Patrick Wildt <patrick@blueri.se>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 12 2019 $
.Dt FUSBTC 4
.Os
.Sh NAME
.Nm fusbtc
.Nd Fairchild FUSB302 USB Type-C Port controller
.Sh SYNOPSIS
.Cd "fusbtc* at iic?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Fairchild FUSB302 USB Type-C port controller.
It takes care of plug and unplug events on the USB Type-C port and discovers
the orientation of the plug so that the USB SuperSpeed pins can be routed
correctly.
Additionally it enables power on the USB Type-C port when a sink
is connected to power attached devices.
.Sh SEE ALSO
.Xr iic 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.6 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Patrick Wildt Aq Mt patrick@blueri.se .
