share/man/man4/fuse.4
.\" $OpenBSD: fuse.4,v 1.12 2016/05/16 17:55:57 jmc Exp $
.\"
.\" Copyright (c) 2013 Sylvestre Gallon <ccna.syl@gmail.com>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 16 2016 $
.Dt FUSE 4
.Os
.Sh NAME
.Nm fuse
.Nd file system in userland
.Sh SYNOPSIS
.Cd "option FUSE"
.Cd "pseudo-device fuse"
.Sh DESCRIPTION
The
.Nm
device provides a FUSE interface for implementing a file system in userland.
.Pp
This device does not support partial reads and writes.
.Sh FILES
.Bl -tag -width /dev/fuse* -compact
.It Pa /dev/fuse0
.Nm
device special file
.El
.Sh SEE ALSO
.Xr fuse_main 3 ,
.Xr intro 4 ,
.Xr fb_setup 9
.Sh HISTORY
The
.Nm
driver
first appeared in
.Ox 5.4 .
