share/man/man4/gpioleds.4
.\"	$OpenBSD: gpioleds.4,v 1.1 2021/09/25 10:43:23 kn Exp $
.\"
.\" Copyright (c) 2021 Klemens Nanni <kn@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 25 2021 $
.Dt GPIOLEDS 4
.Os
.Sh NAME
.Nm gpioleds
.Nd GPIO LEDs
.Sh SYNOPSIS
.Cd "gpioleds* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for LEDs connected to GPIO pins.
.Pp
Currently, LEDs are only set to their default state,
e.g. to indicate the power status of the system.
.Sh SEE ALSO
.Xr gpio 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.1 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Klemens Nanni Aq Mt kn@openbsd.org .
