share/man/man4/gscsio.4
.\"	$OpenBSD: gscsio.4,v 1.6 2013/07/16 16:05:49 schwarze Exp $
.\"
.\" Copyright (c) 2004 Alexander Yurchenko <grange@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 16 2013 $
.Dt GSCSIO 4
.Os
.Sh NAME
.Nm gscsio
.Nd National Semiconductor Geode SC1100 I2C controller
.Sh SYNOPSIS
.Cd "gscsio* at isa?"
.Cd "iic* at gscsio?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the National Semiconductor Geode SC1100
System-on-Chip Super I/O module.
The Super I/O (SIO) module incorporates one serial port, an infrared
communication port, two ACCESS.bus interface (ACB) ports, system wakeup
control (SWC), and a real-time clock (RTC).
Only the ACCESS.bus interface is currently supported.
.Pp
ACB is a two-wire synchronous serial interface compatible with the
Philips'
.Tn I2C
bus, and can be accessed through the
.Xr iic 4
framework.
The
.Nm
driver
programs the ACB port to work with a standard
.Tn I2C
frequency 100kHz.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4 ,
.Xr isa 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.6 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Alexander Yurchenko Aq Mt grange@openbsd.org .
