share/man/man4/hiclock.4
.\"	$OpenBSD: hiclock.4,v 1.2 2018/08/27 20:36:49 jmc Exp $
.\"
.\" Copyright (c) 2018 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 27 2018 $
.Dt HICLOCK 4
.Os
.Sh NAME
.Nm hiclock
.Nd HiSilicon clock controller
.Sh SYNOPSIS
.Cd "hiclock* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver controls the clock signals for integrated components of HiSilicon SoCs.
.Sh SEE ALSO
.Xr hireset 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 6.4 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
