share/man/man4/iasuskbd.4
.\"	$OpenBSD: iasuskbd.4,v 1.1 2025/06/23 18:54:05 kettenis Exp $
.\"
.\" Copyright (c) 2025 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: June 23 2025 $
.Dt IASUSKBD 4
.Os
.Sh NAME
.Nm iasuskbd
.Nd ASUS I2C HID keyboard support
.Sh SYNOPSIS
.Cd "iasuskbd* at ihidev?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the ASUS-specific features of I2C HID
keyboards found on some ASUS laptops.
It enables adjustment of the keyboard backlight level on
these laptops.
Backlight levels can be retrieved and modified with the
.Xr wsconsctl 8
variable
.Va keyboard.backlight .
.Sh SEE ALSO
.Xr ihidev 4 ,
.Xr wsconsctl 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 7.8 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
