share/man/man4/luphy.4
.\"	$OpenBSD: luphy.4,v 1.5 2009/07/31 14:20:29 jmc Exp $
.\"
.\" Copyright (c) 2005 Brad Smith <brad@comstyle.com>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 31 2009 $
.Dt LUPHY 4
.Os
.Sh NAME
.Nm luphy
.Nd Lucent Technologies LU6612 10/100 Ethernet PHY
.Sh SYNOPSIS
.Cd "luphy* at mii?"
.Sh DESCRIPTION
The
.Nm
driver supports the Lucent Technologies LU6612 10/100 Ethernet PHY.
.Sh SEE ALSO
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr mii 4 ,
.Xr ifconfig 8
