share/man/man4/malo.4
.\"	$OpenBSD: malo.4,v 1.54 2025/03/27 15:12:14 jmc Exp $
.\"
.\" Copyright (c) 2006 Theo de Raadt.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: March 27 2025 $
.Dt MALO 4
.Os
.Sh NAME
.Nm malo
.Nd Marvell Libertas IEEE 802.11b/g wireless network device
.Sh SYNOPSIS
.Cd "malo* at cardbus?"
.Cd "malo* at pci?"
.Cd "malo* at pcmcia?"
.Sh DESCRIPTION
The
.Nm
driver provides support for Marvell Libertas 88W8335/88W8310/88W8385 based
PCI/CardBus/PCMCIA network adapters.
The second generation 88W8335/88W8310 chipsets support 802.11b/g.
.Pp
These are the modes the
.Nm
driver can operate in:
.Bl -tag -width "IBSS-masterXX"
.It BSS mode
Also known as
.Em infrastructure
mode, this is used when associating with an access point, through
which all traffic passes.
This mode is the default.
.It monitor mode
In this mode the driver is able to receive packets without
associating with an access point.
This disables the internal receive filter and enables the card to
capture packets from networks which it wouldn't normally have access to,
or to scan for access points.
.El
.Pp
The
.Nm
driver can be configured to use
Wired Equivalent Privacy (WEP) or
Wi-Fi Protected Access (WPA1 and WPA2).
WPA2 is currently the most secure encryption standard for wireless networks
supported by
.Ox .
It is strongly recommended that neither WEP nor WPA1
are used as the sole mechanism to secure wireless communication,
due to serious weaknesses.
WPA1 is disabled by default and may be enabled using the option
.Qq Cm wpaprotos Ar wpa1,wpa2 .
For standard WPA networks which use pre-shared keys (PSK),
keys are configured using the
.Qq Cm wpakey
option.
WPA-Enterprise networks require use of the wpa_supplicant package.
The
.Nm
driver relies on the software 802.11 stack for both encryption and decryption
of data frames.
.Pp
The
.Nm
driver can be configured at runtime with
.Xr ifconfig 8
or on boot with
.Xr hostname.if 5 .
.Sh FILES
The driver needs a set of firmware files which are loaded when
an interface is brought up:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It Pa /etc/firmware/malo8335-h
.It Pa /etc/firmware/malo8335-m
.It Pa /etc/firmware/malo8338
.It Pa /etc/firmware/malo8385-h
.It Pa /etc/firmware/malo8385-m
.El
.Pp
These firmware files are not free because Marvell refuses
to grant distribution rights.
As a result, even though
.Ox
includes the driver, the firmware files cannot be included and
users have to download these files on their own.
.Pp
A prepackaged version of the firmware can be installed using
.Xr fw_update 8 .
.Sh HARDWARE
The following cards are among those supported by the
.Nm
driver:
.Bl -column "I-O DATA WN-G54/CF" "88W8385" "CardBus" "Standard" -offset 6n
.It Em Card Ta Em Chip Ta Em Bus Ta Em Standard
.It "Ambicom WL54CF" Ta 88W8385 Ta PCMCIA Ta b/g
.It "I-O DATA WN-G54/CF" Ta 88W8385 Ta PCMCIA Ta b/g
.It "Netgear WG511v2" Ta 88W8310 Ta CardBus Ta b/g
.It "Netgear WG311v3" Ta 88W8335 Ta PCI Ta b/g
.It "SparkLAN WCFM-100" Ta 88W8385 Ta PCMCIA Ta b/g
.It "Tenda TWL541C" Ta 88W8310 Ta CardBus Ta b/g
.It "Tenda TWL542P" Ta 88W8335 Ta PCI Ta b/g
.El
.Sh EXAMPLES
The following example scans for available networks:
.Pp
.Dl # ifconfig malo0 scan
.Pp
The following
.Xr hostname.if 5
example configures malo0 to join network
.Dq mynwid ,
using WPA key
.Dq mywpakey ,
obtaining an IP address using DHCP:
.Bd -literal -offset indent
join mynwid wpakey mywpakey
inet autoconf
.Ed
.Sh SEE ALSO
.Xr arp 4 ,
.Xr cardbus 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr hostname.if 5 ,
.\".Xr hostapd 8 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.1 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Claudio Jeker
and
.An Marcus Glocker .
.Sh CAVEATS
WPA encryption is not supported for PCMCIA devices.
