share/man/man4/mcprtc.4
.\"	$OpenBSD: mcprtc.4,v 1.1 2019/09/06 09:38:19 patrick Exp $
.\"
.\" Copyright (c) 2019 Patrick Wildt <patrick@blueri.se>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 6 2019 $
.Dt MCPRTC 4
.Os
.Sh NAME
.Nm mcprtc
.Nd Microchip MCP79400 real-time clock
.Sh SYNOPSIS
.Cd "mcprtc* at iic? addr 0x6f"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Microchip MCP79400 real-time clock chip
and similar variants.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.6 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Patrick Wildt Aq Mt patrick@blueri.se .
