share/man/man4/mtd.4
.\" $OpenBSD: mtd.4,v 1.10 2021/09/08 20:29:21 jmc Exp $
.\"
.\" Copyright (c) 2003 Oleg Safiullin <form@pdp11.org.ru>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice unmodified, this list of conditions, and the following
.\"    disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: September 8 2021 $
.Dt MTD 4
.Os
.Sh NAME
.Nm mtd
.Nd Myson Technology MTD800/MTD803/MTD891 10/100/1Gb Ethernet device
.Sh SYNOPSIS
.Cd "mtd* at pci?"
.Cd "mtdphy* at mii?"
.Sh DESCRIPTION
The
.Nm
driver provides support for Myson MTD800/MTD803 Fast Ethernet and
MTD891 Gigabit Ethernet chips.
.Pp
Supported models include:
.Pp
.Bl -bullet -compact
.It
Safeway Lancard SW-10/100 PCI (model 117204)
.It
Surecom EP-320X-S
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr mii 4 ,
.Xr mtdphy 4 ,
.Xr pci 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.4 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Oleg Safiullin Aq Mt form@pdp11.org.ru
.Sh BUGS
The
.Nm
driver does not support Power Management.
