share/man/man4/mtrng.4
.\"	$OpenBSD: mtrng.4,v 1.1 2025/02/14 03:15:06 hastings Exp $
.\"
.\" Copyright (c) 2025 James Hastings <hastings@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: February 14 2025 $
.Dt MTRNG 4
.Os
.Sh NAME
.Nm mtrng
.Nd MediaTek random number generator
.Sh SYNOPSIS
.Cd "mtrng* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the random number generator found on
MediaTek SoCs.
.Pp
It feeds the random subsystem's entropy pool with 32 bits of
random data every second.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr random 4 ,
.Xr arc4random 9
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.7 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An James Hastings Aq Mt hastings@openbsd.org .
