share/man/man4/mvpp.4
.\"	$OpenBSD: mvpp.4,v 1.1 2020/06/25 12:26:31 patrick Exp $
.\"
.\" Copyright (c) 2020 Patrick Wildt <patrick@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: June 25 2020 $
.Dt MVPP 4
.Os
.Sh NAME
.Nm mvpp ,
.Nm mvppc
.Nd Marvell ARMADA Ethernet device
.Sh SYNOPSIS
.Cd "mvppc* at fdt?"
.Cd "mvpp* at mvppc?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Ethernet controller on the Marvell ARMADA
70x0 and 80x0 series SoCs.
For more information on configuring this device, see
.Xr ifconfig 8 .
.Sh SEE ALSO
.Xr ifmedia 4 ,
.Xr mii 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.8 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Patrick Wildt Aq Mt patrick@blueri.se .
