share/man/man4/mvspi.4
.\"	$OpenBSD: mvspi.4,v 1.1 2019/10/07 19:43:00 patrick Exp $
.\"
.\" Copyright (c) 2019 Patrick Wildt <patrick@blueri.se>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: October 7 2019 $
.Dt MVSPI 4
.Os
.Sh NAME
.Nm mvspi
.Nd Marvell Armada 3700 onboard SPI controller
.Sh SYNOPSIS
.Cd "mvspi* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the SPI controller found on the Marvell
Armada 3700 SoC.
.Sh SEE ALSO
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.6 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Patrick Wildt Aq Mt patrick@blueri.se .
