share/man/man4/ngbe.4
.\" $OpenBSD: ngbe.4,v 1.2 2023/03/31 13:45:13 jmc Exp $
.\"
.\" Copyright (c) 2023 Kevin Lo <kevlo@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: March 31 2023 $
.Dt NGBE 4
.Os
.Sh NAME
.Nm ngbe
.Nd WangXun WX1860 PCI Express 10/100/1Gb Ethernet device
.Sh SYNOPSIS
.Cd "ngbe* at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for PCI Express Gigabit Ethernet adapters based
on the WangXun WX1860AL1 and WX1860A2 Ethernet controllers,
including the following:
.Pp
.Bl -bullet -offset indent -compact
.It
LR-LINK LRES2034PT (WX1860AL1)
.It
LR-LINK LRES2045PT (WX1860A2)
.El
.Pp
The
.Nm
driver supports IPv4 receive IP/TCP/UDP checksum offload and VLAN
tag insertion and stripping.
.Pp
The
.Nm
driver supports the following media types:
.Bl -tag -width autoselect -offset indent
.It autoselect
Enables auto-negotiation for speed and duplex.
.It 10baseT Cm mediaopt No full-duplex
Sets 10Mbps operation.
.It 100baseTX Cm mediaopt No full-duplex
Sets 100Mbps operation.
.It 1000baseT
Sets 1000Mbps operation.
Only full-duplex mode is supported at this speed.
.El
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.4 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Kevin Lo Aq Mt kevlo@openbsd.org .
