share/man/man4/pcagpio.4
.\"	$OpenBSD: pcagpio.4,v 1.11 2013/07/16 16:05:49 schwarze Exp $
.\"
.\" Copyright (c) 2005 Theo de Raadt <deraadt@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 16 2013 $
.Dt PCAGPIO 4
.Os
.Sh NAME
.Nm pcagpio
.Nd Philips PCA955[4567] GPIO controller
.Sh SYNOPSIS
.Cd "pcagpio* at iic?"
.Cd "gpio* at pcagpio?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Philips PCA955[4567] GPIO controllers.
The PCA955[467] devices have 8 pins and the PCA9555 device has 16 pins
which can be configured as either inputs or outputs, and accessed
using
.Xr gpioctl 8 .
.\" Both values are made available through the
.\" .Xr sysctl 8
.\" interface.
.Sh SEE ALSO
.Xr gpio 4 ,
.Xr iic 4 ,
.Xr intro 4 ,
.Xr gpioctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.9 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Theo de Raadt Aq Mt deraadt@openbsd.org .
