share/man/man4/plgpio.4
.\"	$OpenBSD: plgpio.4,v 1.1 2018/08/26 18:10:16 kettenis Exp $
.\"
.\" Copyright (c) 2018 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 26 2018 $
.Dt PLGPIO 4
.Os
.Sh NAME
.Nm plgpio
.Nd ARM PrimeCell PL061 GPIO controller
.Sh SYNOPSIS
.Cd "plgpio* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver supports the ARM PrimeCell PL061 GPIO controller.
It does not provide direct device driver entry points but makes its
functions available to other drivers.
.Sh SEE ALSO
.Xr intro 4
.Rs
.%T ARM PrimeCell General Purpose Input/Output (PL011) Technical Reference Manual
.%V ARM DDI 0190
.Re
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.4 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
