share/man/man4/qcdpc.4
.\"	$OpenBSD: qcdpc.4,v 1.3 2025/07/18 09:31:23 jsg Exp $
.\"
.\" Copyright (c) 2025 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 18 2025 $
.Dt QCDPC 4
.Os
.Sh NAME
.Nm qcdpc
.Nd Qualcomm DisplayPort Controller
.Sh SYNOPSIS
.Cd "qcdpc* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the DisplayPort controller that is part of
the MSM Mobile Display Subsystem (MDSS) found on the Qualcomm
Snapdragon SoCs.
It provides backlight control for some eDP display panels.
.Sh SEE ALSO
.Xr drm 4 ,
.Xr intro 4 ,
.Xr qcdrm 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.8 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
