share/man/man4/qcpmicgpio.4
.\"	$OpenBSD: qcpmicgpio.4,v 1.2 2022/11/10 19:10:50 jmc Exp $
.\"
.\" Copyright (c) 2022 Patrick Wildt <patrick@blueri.se>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: November 10 2022 $
.Dt QCPMICGPIO 4
.Os
.Sh NAME
.Nm qcpmicgpio
.Nd Qualcomm PMIC GPIO controller
.Sh SYNOPSIS
.Cd "qcpmicgpio* at qcpmic?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the GPIO ports found on Qualcomm Snapdragon
SoCs.
It does not provide direct device driver entry points but makes its
functions available to other drivers.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr qcpmic 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Patrick Wildt Aq Mt patrick@blueri.se .
