share/man/man4/qcpon.4
.\"	$OpenBSD: qcpon.4,v 1.2 2022/11/10 19:10:50 jmc Exp $
.\"
.\" Copyright (c) 2022 Patrick Wildt <patrick@blueri.se>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: November 10 2022 $
.Dt QCPON 4
.Os
.Sh NAME
.Nm qcpon
.Nd Qualcomm PON controller
.Sh SYNOPSIS
.Cd "qcpon* at qcpmic?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the PON controllers integrated on various
Qualcomm Snapdragon SoCs.
This controller contains the power button.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr qcpmic 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 7.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Patrick Wildt Aq Mt patrick@blueri.se .
