share/man/man4/re.4
.\" $OpenBSD: re.4,v 1.56 2022/02/18 10:24:32 jsg Exp $
.\" Copyright (c) 2003
.\"	Bill Paul <wpaul@windriver.com>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: /repoman/r/ncvs/src/share/man/man4/re.4,v 1.4 2004/03/04 06:42:46 sanpei Exp $
.\"
.Dd $Mdocdate: February 18 2022 $
.Dt RE 4
.Os
.Sh NAME
.Nm re
.Nd Realtek 8139C+/8169/816xS/811xS/8168/810xE 10/100/1Gb Ethernet device
.Sh SYNOPSIS
.Cd "re* at pci?"
.Cd "re* at cardbus?"
.Cd "eephy* at mii?"
.Cd "rgephy* at mii?"
.Cd "rlphy* at mii?"
.Sh DESCRIPTION
The
.Nm
driver provides support for various NICs based on the
Realtek RTL8139C+, RTL8169, RTL816xS, RTL811xS, RTL8168 and
RTL810xE PCI and PCI Express Ethernet controllers,
including the following:
.Pp
.Bl -bullet -compact
.It
Alloy Computer Products EtherGOLD 1439E 10/100 (8139C+)
.It
Buffalo LGY-PCI-GT (8169S)
.It
Compaq Evo N1015v Integrated Ethernet (8139C+)
.It
Corega CG-LAPCIGT (8169S)
.It
D-Link DGE-528T (8169S)
.It
D-Link DGE-530T C1 (8169/8110SB)
.It
D-Link DGE-660TD (8169/8110SB)
.It
Gigabyte 7N400 Pro2 Integrated Gigabit Ethernet (8110S)
.It
LevelOne GNC-0105T (8169S)
.It
Linksys EG1032v3 (8169S)
.It
Netgear GA311 (8169S)
.It
Netgear GA511 PC Card (8169)
.It
PLANEX COMMUNICATIONS Inc. GN-1200TC (8169S)
.It
Surecom EP-320G-TX1 (8169S)
.It
TTTech MC322 (8139C+)
.It
US Robotics USR997902 (8169S)
.It
Xterasys XN-152 10/100/1000 NIC (8169)
.El
.Pp
NICs based on the 8139C+ and 810xE are capable of 10 and 100Mbps speeds
over CAT5 cable.
NICs based on the 8169, 816xS, 811xS and 8168 are capable of 10, 100 and
1000Mbps operation.
.Pp
All
.Nm
NICs support
IPv4 transmit/receive IP/TCP/UDP checksum offload, VLAN tag insertion and
stripping, and use a descriptor-based DMA mechanism.
The 8102E(L), 8103E(L), 8168C/8111C, 8168D/8111D, 8168DP/8111DP and
8168E/8111E chips also support IPv6 receive TCP/UDP checksum offload.
.Pp
The 8139C+ is a single-chip solution combining both a 10/100 MAC and PHY.
The 8169 is a 10/100/1000 MAC only, requiring a GMII or TBI external PHY.
The 8169S, 8110S, 8111B and 8168 are single-chip devices
containing both a 10/100/1000 MAC and 10/100/1000 copper PHY.
Standalone 10/100/1000 cards are available in both 32-bit PCI and 64-bit
PCI models.
The 8110S and 8111B are designed for embedded LAN-on-motherboard applications.
.Pp
The 8168, 8169, 8169S and 8110S also support jumbo frames.
.Pp
The
.Nm
driver additionally supports Wake on LAN (WoL).
See
.Xr arp 8
and
.Xr ifconfig 8
for more details.
.Pp
The
.Nm
driver supports the following media types:
.Bl -tag -width 10baseTXUTP
.It autoselect
Enable autoselection of the media type and options.
The user can manually override the autoselected mode by adding media options
to the appropriate
.Xr hostname.if 5
file.
.It 10baseT/UTP
Set 10Mbps operation.
The
.Xr ifconfig 8
.Ic mediaopt
option can also be used to select either
.Ar full-duplex
or
.Ar half-duplex
modes.
.It 100baseTX
Set 100Mbps (Fast Ethernet) operation.
The
.Xr ifconfig 8
.Ic mediaopt
option can also be used to select either
.Ar full-duplex
or
.Ar half-duplex
modes.
.It 1000baseT
Set 1000baseT operation over twisted pair.
The Realtek GigE chips support 1000Mbps in
.Ar full-duplex
mode only.
.\" .It 1000baseSX
.\" Set 1000Mbps (Gigabit Ethernet) operation.
.\" Both
.\" .Ar full-duplex
.\" and
.\" .Ar half-duplex
.\" modes are supported.
.El
.Pp
The
.Nm
driver supports the following media options:
.Bl -tag -width full-duplex
.It full-duplex
Force full duplex operation.
.It half-duplex
Force half duplex operation.
.El
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
.Sh SEE ALSO
.Xr arp 4 ,
.Xr eephy 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr rgephy 4 ,
.Xr rlphy 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Rs
.%T Realtek Semiconductor RTL8139C+, RTL8169, RTL8169S and RTL8110S datasheets
.%U https://www.realtek.com/en
.Re
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 3.6 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Bill Paul Aq Mt wpaul@windriver.com
and ported to
.Ox
by
.An Peter Valchev Aq Mt pvalchev@openbsd.org .
.Sh BUGS
The Xterasys XN-152 32-bit PCI NIC, which uses the RTL8169 MAC and
Marvell 88E1000 PHY, has a defect that causes DMA corruption
if the board is plugged into a 64-bit PCI slot.
The defect lies in the board design, not the chip itself: the PCI REQ64#
and ACK64# lines should be pulled high, but they are not.
The result is that the 8169 chip is tricked into performing 64-bit DMA
transfers even though a 64-bit data path between the NIC and the bus does
not actually exist.
.Pp
Unfortunately, it is not possible to correct this problem in software.
The user should ensure the NIC is installed in a 32-bit PCI slot to avoid
this problem.
