share/man/man4/rge.4
.\" $OpenBSD: rge.4,v 1.9 2025/09/19 00:42:06 kevlo Exp $
.\"
.\" Copyright (c) 2019, 2020, 2024 Kevin Lo <kevlo@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 19 2025 $
.Dt RGE 4
.Os
.Sh NAME
.Nm rge
.Nd Realtek 8125/8126/8127 PCI Express 10/100/1Gb/2.5Gb/5Gb/10Gb
Ethernet device
.Sh SYNOPSIS
.Cd "rge* at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for NICs based on the
Realtek RTL8125, RTL8126 and RTL8127 PCI Express Ethernet controllers,
including the following:
.Pp
.Bl -bullet -offset indent -compact
.It
IOCrest IO-PCE8126-GLAN Adapter (5000baseT)
.It
Realtek 8125/8125B 2.5GbE Adapter (2500baseT)
.It
Rivet Networks Killer E3000 Adapter (2500baseT)
.It
TP-LINK TL-NG421 Adapter (2500baseT)
.El
.Pp
NICs based on the RTL8125 are capable of 10, 100, 1000 and 2500Mbps operation.
NICs based on the RTL8126 are capable of 10, 100, 1000, 2500 and
5000Mbps operation.
The RTL8127 supports 10Gbps speed.
.Pp
The
.Nm
driver additionally supports Wake on LAN (WoL).
See
.Xr arp 8
and
.Xr ifconfig 8
for more details.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.6 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Kevin Lo Aq Mt kevlo@openbsd.org .
