share/man/man4/rktcphy.4
.\"	$OpenBSD: rktcphy.4,v 1.1 2021/06/29 12:51:18 patrick Exp $
.\"
.\" Copyright (c) 2021 Patrick Wildt <patrick@blueri.se>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: June 29 2021 $
.Dt RKTCPHY 4
.Os
.Sh NAME
.Nm rktcphy
.Nd Rockchip Type-C PHY
.Sh SYNOPSIS
.Cd "rktcphy* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver controls the Type-C PHY integrated on Rockchip SoCs.
.Sh SEE ALSO
.Xr intro 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 7.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Emmanuel Vadot
for
.Fx
and ported to
.Ox
by
.An Patrick Wildt Aq Mt patrick@blueri.se .
