share/man/man4/simplepanel.4
.\"	$OpenBSD: simplepanel.4,v 1.1 2020/04/13 11:54:43 jmc Exp $
.\"
.\" Copyright (c) 2020 Patrick Wildt <patrick@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: April 13 2020 $
.Dt SIMPLEPANEL 4
.Os
.Sh NAME
.Nm simplepanel
.Nd simple panel display
.Sh SYNOPSIS
.Cd "simplepanel* at mainbus?"
.Sh DESCRIPTION
.Nm
is a generic driver for panels,
integrated into the
.Xr drm 4
subsystem.
It also provides a hardcoded mode for the
Pinebook Pro display panel.
.Sh SEE ALSO
.Xr mainbus 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.7 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Patrick Wildt Aq Mt patrick@openbsd.org .
