share/man/man4/sxiccmu.4
.\"	$OpenBSD: sxiccmu.4,v 1.2 2019/02/01 01:26:50 jsg Exp $
.\"
.\" Copyright (c) 2014 Raphael Graf <rapha@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: February 1 2019 $
.Dt SXICCMU 4
.Os
.Sh NAME
.Nm sxiccmu
.Nd Allwinner clock control module device
.Sh SYNOPSIS
.Cd "sxiccmu* at fdt? early 1"
.Sh DESCRIPTION
The
.Nm
driver provides support for the clock control module device integrated in
Allwinner Technology A10, A10s, A20, A23, A33, A64, A80, H3, H5, R40 and V40
SoCs.
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 5.5 .
