share/man/man4/tpm.4
.\"	$OpenBSD: tpm.4,v 1.3 2021/09/12 16:37:42 jmc Exp $
.\"
.\" Copyright (c) 2010 Hans-Joerg Hoexer
.\" Copyright (c) 2016 joshua stein <jcs@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 12 2021 $
.Dt TPM 4
.Os
.Sh NAME
.Nm tpm
.Nd Trusted Platform Module device
.Sh SYNOPSIS
.Cd "tpm* at acpi?"
.Sh DESCRIPTION
The
.Nm
driver supports devices implementing the TPM Interface Spec 1.2.
.Pp
Supported devices include:
.Pp
.Bl -bullet -compact -offset indent
.It
Atmel 97SC3203
.It
Broadcom BCM0102
.It
Infineon IFX SLD 9630 TT 1.1 and IFX SLB 9635 TT 1.2
.It
Intel INTC0102
.It
Sinosun SNS SSX35
.It
STM ST19WP18
.It
Winbond WEC WPCT200
.El
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.1 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was initially written by
.An Michael Shalayeff
and
.An Hans-Joerg Hoexer .
.Sh CAVEATS
Functionality is limited to instructing the device to save its state before a
system suspend.
