share/man/man4/uscom.4
.\"	$OpenBSD: uscom.4,v 1.4 2019/02/24 17:37:42 patrick Exp $
.\"
.\" Copyright (c) 2006 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: February 24 2019 $
.Dt USCOM 4
.Os
.Sh NAME
.Nm uscom
.Nd simple USB serial adapters
.Sh SYNOPSIS
.Cd "uscom* at uhub?"
.Cd "ucom* at uscom?"
.Sh DESCRIPTION
The
.Nm
driver supports simple USB serial adapters that don't need a custom driver.
.Pp
The following devices should work with the
.Nm
driver:
.Bd -literal -offset indent
HP 39G
HP 49G
Dynastream ANT USB-2 Stick
Dynastream ANT USB-m Stick
.Ed
.Sh SEE ALSO
.Xr tty 4 ,
.Xr ucom 4 ,
.Xr uhub 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 5.6 .
