share/man/man4/vioblk.4
.\"     $OpenBSD: vioblk.4,v 1.8 2021/06/14 06:27:22 jsg Exp $
.\"
.\" Copyright (c) 2012 Stefan Fritsch <sf@sfritsch.de>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: June 14 2021 $
.Dt VIOBLK 4
.Os
.Sh NAME
.Nm vioblk
.Nd VirtIO disk
.Sh SYNOPSIS
.Cd "vioblk* at virtio?"
.Sh DESCRIPTION
The
.Nm
driver provides a virtual disk using a
.Xr virtio 4
block device provided by bhyve, KVM, QEMU, and VirtualBox.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr scsi 4 ,
.Xr virtio 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Stefan Fritsch Aq Mt sf@sfritsch.de ,
based on the
.Xr vdsk 4
driver by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
