share/man/man4/viomb.4
.\"	$NetBSD: viomb.4,v 1.2 2011/11/26 22:36:14 wiz Exp $
.\"	$OpenBSD: viomb.4,v 1.2 2013/01/16 00:30:48 brad Exp $
.\" Copyright (c) 2012 Dinar Talypov <dinar@i-nk.ru>
.\" Copyright (C) 2011 Minoura Makoto.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: January 16 2013 $
.Dt VIOMB 4
.Os
.Sh NAME
.Nm viomb
.Nd VirtIO memory ballooning driver
.Sh SYNOPSIS
.Cd "viomb*  at virtio?"
.Sh DESCRIPTION
The
.Nm
driver supports the virtio-compliant memory ballooning device.
.Pp
Memory ballooning works as follows:
.Pp
.Bl -enum -compact
.It
The host operator requests a guest to return some amount of memory to the host
(via, for example, the QEMU monitor balloon command).
.It
The hypervisor sends the request via the VirtIO memory ballooning device.
.It
The guest
.Nm
driver requests allocation of that amount of physical memory from the
.Ox
memory management system.
.It
The
.Nm
device tells the hypervisor the guest physical memory address of the
allocated memory via the VirtIO memory ballooning device.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr virtio 4
.Rs
.%A Rusty Russell, IBM Corporation
.%T Virtio PCI Card Specification
.%U http://ozlabs.org/~rusty/virtio-spec/
.Re
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 5.3 .
