share/man/man9/ffs.9
.\"	$OpenBSD: ffs.9,v 1.2 2022/09/10 08:18:06 jsg Exp $
.\"
.\" Copyright (c) 2002, 2003 CubeSoft Communications, Inc.
.\" <http://www.csoft.org>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
.\" IN ANY WAY OUT OF THE USE OF THIS SOFTWARE EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: September 10 2022 $
.Dt FFS 9
.Os
.Sh NAME
.Nm ffs ,
.Nm fls ,
.Nm flsl
.Nd kernel library find bit routines
.Sh SYNOPSIS
.In lib/libkern/libkern.h
.Ft int
.Fn ffs "int value"
.Ft int
.Fn fls "int value"
.Ft int
.Fn flsl "long value"
.Sh DESCRIPTION
The
.Fn ffs
function finds the first bit set in
.Fa value .
It has the same semantics as its libc counterpart
.Xr ffs 3 .
.Pp
The
.Fn fls
and
.Fn flsl
functions find the last bit set in
.Fa value
and return the index of that bit.
.Sh SEE ALSO
.Xr ffs 3
.Sh STANDARDS
The
.Fn ffs
function conforms to
.St -p1003.1-2008 .
.Sh HISTORY
The
.Fn ffs
function is based on a vax instruction of the same name.
