share/man/man9/hardclock.9
.\"	$OpenBSD: hardclock.9,v 1.13 2020/06/26 18:48:31 cheloha Exp $
.\"
.\" Copyright (c) 2001 Kenneth R Westerback
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer,
.\"    without modification, immediately at the beginning of the file.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR OR HIS RELATIVES BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF MIND, USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
.\" IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: June 26 2020 $
.Dt HARDCLOCK 9
.Os
.Sh NAME
.Nm hardclock
.Nd real-time system clock
.Sh SYNOPSIS
.In sys/systm.h
.Ft void
.Fo hardclock
.Fa "struct clockframe *frame"
.Fc
.Sh DESCRIPTION
.Fn hardclock
implements the real-time system clock, interrupting
.Xr hz 9
times a second.
The argument
.Fa frame
is an opaque, machine dependent structure that encapsulates the
previous machine state.
.Pp
.Fn hardclock
performs a variety of time related housekeeping tasks, such as:
.Bl -bullet -offset indent
.It
If the current process has virtual or profiling interval
timers, update the timers and deliver appropriate signals.
.It
If there is no separate statistics clock, execute
.Fn statclock .
.It
Increment the time of day, implementing any adjustments requested by
.Xr adjtime 2
or required as a result of running an NTP daemon or other configured
external clock.
.It
Update the real-time timeout queue, calling
.Fn softclock
directly if the current interrupt priority is low enough.
.El
.Sh CODE REFERENCES
.Fn hardclock
is implemented in the file
.Pa sys/kern/kern_clock.c .
.Sh SEE ALSO
.Xr adjtime 2 ,
.Xr hz 9 ,
.Xr microtime 9 ,
.Xr spl 9 ,
.Xr timeout 9
