share/man/man9/log.9
.\"	$OpenBSD: log.9,v 1.11 2015/09/14 15:14:55 schwarze Exp $
.\"     $NetBSD: log.9,v 1.6 1999/08/17 05:24:06 enami Exp $
.\"
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Michael Graff.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: September 14 2015 $
.Dt LOG 9
.Os
.Sh NAME
.Nm log ,
.Nm addlog
.Nd log a message from the kernel through the /dev/klog device
.Sh SYNOPSIS
.In sys/syslog.h
.Ft void
.Fo log
.Fa "int level"
.Fa "const char *format"
.Fa "..."
.Fc
.Ft void
.Fn addlog "const char *format" ...
.Sh DESCRIPTION
The
.Fn log
function allows the kernel to send formatted messages to user processes
listening on
.Pa /dev/klog .
Usually
.Xr syslogd 8
monitors
.Pa /dev/klog
for these messages and writes them to a log file.
.Pp
All messages are formatted using
.Xr printf 9 ,
logged using facility
.Dv LOG_KERN ,
and priority level
.Fa level .
.Pp
The
.Fn addlog
function is used to build a log message in steps, by adding information
to an initial call to
.Fn log .
.Sh SEE ALSO
.Xr syslog 3 ,
.Xr syslogd 8 ,
.Xr printf 9
