share/man/man9/ppsratecheck.9
.\"	$OpenBSD: ppsratecheck.9,v 1.7 2020/06/26 18:48:31 cheloha Exp $
.\"	$NetBSD: ppsratecheck.9,v 1.1 2000/08/03 00:09:39 itojun Exp $
.\"
.\" Copyright (c) 2000 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jun-ichiro itojun Hagino.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: June 26 2020 $
.Dt PPSRATECHECK 9
.Os
.Sh NAME
.Nm ppsratecheck
.Nd function to help implement rate-limited actions
.Sh SYNOPSIS
.In sys/time.h
.Ft int
.Fn ppsratecheck "struct timeval *lasttime" "int *curpps" "int maxpps"
.Sh DESCRIPTION
The
.Fn ppsratecheck
function provides an easy way to perform packet-per-sec,
or event-per-sec, rate limitation.
The motivation for implementing
.Fn ppsratecheck
was to provide a mechanism that could be used to add rate limitation to
network packet output.
For certain network packets, we may want to impose rate limitation,
to avoid denial-of-service attack possibilities.
.Pp
.Fa maxpps
specifies maximum permitted packets, or events, per second.
If
.Fn ppsratecheck
is called more than
.Fa maxpps
times in a given one second period,
the function will return 0, indicating that we exceeded the limit.
If we are below the limit, the function will return 1.
If
.Fa maxpps
is set to 0, the function will always return 0
.Pq no packets/events are permitted .
Negative
.Fa maxpps
indicates that rate limitation is disabled, and
.Fn ppsratecheck
will always return 1.
.Pp
.Fa curpps
and
.Fa lasttime
are used to maintain the number of recent calls.
.Fa curpps
will be incremented every time
.Fn ppsratecheck
is called, and will be reset whenever necessary.
.Sh SEE ALSO
.Xr log 9 ,
.Xr microtime 9 ,
.Xr printf 9 ,
.Xr ratecheck 9
.Sh HISTORY
The
.Fn ppsratecheck
function appeared in
.Nx 1.5 .
