share/man/man9/tfind.9
.\"	$OpenBSD: tfind.9,v 1.3 2025/06/13 18:34:00 schwarze Exp $
.\"
.\" Copyright (c) 1999 Marc Espie
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: June 13 2025 $
.Dt TFIND 9
.Os
.Sh NAME
.Nm tfind ,
.Nm prfind ,
.Nm pgfind
.Nd find thread, process and process group by number
.Sh SYNOPSIS
.In sys/types.h
.In sys/signal.h
.In sys/proc.h
.Ft struct proc *
.Fn tfind "pid_t tid"
.Ft struct process *
.Fn prfind "pid_t pid"
.Ft struct pgrp *
.Fn pgfind "pid_t pgid"
.Sh DESCRIPTION
The
.Fn tfind ,
.Fn prfind ,
and
.Fn pgfind
functions retrieve thread, process and process group structures from thread,
process and process group IDs, respectively.
.Pp
These functions return
.Dv NULL
if the requested ID can't be found.
.Sh CODE REFERENCES
Those functions are implemented in the file
.Pa sys/kern/kern_proc.c .
