share/man/man9/tvtohz.9
.\"	$OpenBSD: tvtohz.9,v 1.11 2019/01/18 03:34:58 schwarze Exp $
.\"
.\" Copyright (c) 1999 Marc Espie
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: January 18 2019 $
.Dt TVTOHZ 9
.Os
.Sh NAME
.Nm tvtohz ,
.Nm tstohz
.Nd translate time period to timeout delay
.Sh SYNOPSIS
.In sys/types.h
.In sys/time.h
.In sys/systm.h
.Ft int
.Fn tvtohz "const struct timeval *tv"
.Ft int
.Fn tstohz "const struct timespec *ts"
.Sh DESCRIPTION
The
.Fn tvtohz
and
.Fn tstohz
functions return the number of ticks in the specified amount of time.
If the return value would exceed the maximum value representable by an
.Vt int ,
it is capped at
.Dv INT_MAX .
They are mainly used to translate a
.Vt timeval
or
.Vt timespec ,
respectively,
into a suitable argument for
.Xr tsleep 9 .
.Sh CODE REFERENCES
These functions are implemented in the file
.Pa sys/kern/kern_clock.c .
.Sh SEE ALSO
.Xr hz 9 ,
.Xr timeout 9
